{
    "data_id": "1038364",
    "id": "thewashingtonstandard--2019-11-01--Colorado: Innocent Man’s Home Destroyed After SWAT Shows Up In Search Of Clothing Shoplifter – Court",
    "date": "11/1/2019",
    "source": "thewashingtonstandard",
    "title": "Colorado: Innocent Man’s Home Destroyed After SWAT Shows Up In Search Of Clothing Shoplifter – Court Says He’s Owed No Compensation",
    "content": "Colorado: Innocent Man’s Home Destroyed After SWAT Shows Up In Search Of Clothing Shoplifter – Court Says He’s Owed No Compensation\n\nA federal appeals court ruled this week that an innocent Colorado man is owed no compensation after a SWAT team literally blew up and tore out sections of his house following the illegal entrance into his home of a suspected clothing shoplifter.\n\nLeo Lech sued Greenwood police after they fired gas munition and 40-millimeter rounds through the windows of his home in the June 2015 during a 19-hour standoff with the shoplifter who illegally entered his home and barricaded himself inside.\n\nThe damages and replacement costs total nearly $400,000, according to Lech.\n\nFirst, take a look at the damage.\n\nIf using all those explosive and rounds weren’t enough, the police actually drove an armored vehicle through the doors and tossed in several flashbang grenades and detonated explosives.\n\nSeriously, this is in a neighborhood and over a clothing shoplifter! Who is training these guys? Or should I say, who is indoctrinating them to think they are in a war zone?\n\nAccording to the Washington Post, after the suspect was apprehended, it left Leo Lech’s son, John, without a home. John lived there with his girlfriend and her 9-year-old son.\n\nHowever, seeing the damage, you would think the police and the city would have taken responsibility, but they didn’t.\n\nThey insulted the Lech’s by refusing to compensate them and then insulting them by offering them $5,000 in temporary rental assistance and for the insurance deductible.\n\nNow, after the Leches sued, a federal appeals court has decided what else the city owes the Lech family for destroying their house more than four years ago: nothing.\n\nOn Tuesday, a three-judge panel for the U.S. Court of Appeals for the 10th Circuit unanimously ruled that the city is not required to compensate the Lech family for their lost home because it was destroyed by police while they were trying to enforce the law, rather than taken by eminent domain.\n\nThe Lechs had sued under the Fifth Amendment’s Takings Clause, which guarantees citizens compensation if their property is seized by the government for public use. But the court said that Greenwood Village was acting within its “police power” when it damaged the house, which the court said doesn’t qualify as a “taking” under the Fifth Amendment. The court acknowledged that this may seem “unfair,” but when police have to protect the public, they can’t be “burdened with the condition” that they compensate whomever is damaged by their actions along the way.\n\n“It just goes to show that they can blow up your house, throw you out on the streets and say, ‘See you later. Deal with it,’ ” Leo Lech said in an interview with The Washington Post on Tuesday. “What happened to us should never happen in this country, ever.”\n\nNow, Lech is contemplating taking his case to the supreme Court of the united States.\n\nGreenwood Village spokeswoman Melissa Gallegos applauded the 10th Circuit’s ruling saying, “The house was being used as a barricade, and the damage done to it was to remove the barricade and get the gunman out without any loss of life. That is not a use of another’s property under eminent domain, but a use of another’s property during a police emergency.”\n\nA police emergency? The took a tank in there! They were setting off explosives!\n\nRobert Jonathan Seacat, had stolen a shirt and a couple of belts from a Walmart. He was attempting to steal the Lech’s car when police arrived at the house when officers claimed in an affidavit that he fired at them with a handgun.\n\nAnd for 19 hours, he was held up inside the home.\n\n“They proceed to destroy the house — room by room, by room, by room,” Lech said. “This is one guy with a handgun. This guy was sleeping. This guy was eating. This guy was just hanging out in this house. I mean, they proceeded to blow up the entire house.”\n\n“There was one gunman with a handgun and they chose to turn this house into something that resembles Osama Bin Laden’s compound,” he said.\n\n“They methodically fired explosives into every room in this house in order to extract one person” Lech continued. “Granted, he had a handgun, but against 100 officers?”\n\n“You know, the proper thing to do would be to evacuate these homes around here, ensure the safety of the homeowners around here, fire some tear gas through the windows,” he added. “If that didn’t work, you have 50 SWAT officers with body armor break down the door.”\n\nThat does seem a lot more logical and quite a bit safer, but what Mr. Lech doesn’t understand is these guys have all these new weapons of war, as certain gun grabbers say that shouldn’t be on our streets, that they need to play with. Notice who the state protects when those are used in such a manner? That’s right, their agents. They could care less for the homeowner.\n\nSpeaking of his home, Lech said, “It survived two World Wars, OK, but it didn’t survive the American police paramilitary operation,”\n\nOf course, the police merely issued words and not real sympathy over the matter.\n\n“My mission is to get that individual out unharmed and make sure my team and everyone else around including the community goes home unharmed,” Greenwood Village Police Commander Dustin Varney said in 2015, KUSA reported. “Sometimes that means property gets damaged, and I am sorry for that.”\n\nWow! Honestly, this is just pure tyranny and incompetence. Varney’s mission is to keep the peace, not disturb it in such a fashion, and with no remorse for what they did to the Lech’s home, the devastation the family endured and I would imagine the high premiums they were forced to pay following Varney and his team’s weekend warriors party.\n\nArticle posted with permission from Sons Of Liberty Media",
    "author": "Tim Brown",
    "url": "https://thewashingtonstandard.com/colorado-innocent-mans-home-destroyed-after-swat-shows-up-in-search-of-clothing-shoplifter-court-says-hes-owed-no-compensation/",
    "published": "Fri, 01 Nov 2019 21:31:02 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}