{
    "data_id": "1038181",
    "id": "thewashingtonstandard--2019-09-29--Mississippi Cops Go To Wrong Home Execute Innocent Man Claim It Was OK Because He Had No Const",
    "date": "9/29/2019",
    "source": "thewashingtonstandard",
    "title": "Mississippi:  Cops Go To Wrong Home – Execute Innocent Man – Claim It Was OK Because He Had No Constitutional Rights",
    "content": "Mississippi: Cops Go To Wrong Home – Execute Innocent Man – Claim It Was OK Because He Had No Constitutional Rights\n\nSouthaven, MS — Two years ago, police responding to a call of domestic violence went to the wrong home and killed an innocent husband. A year later, the tragedy grew deeper when TFTP learned that the officers involved in the killing would not be charged. Now, two years later, we are finding that the government is trying to dismiss the family’s lawsuit, claiming that Ismael Lopez had no Constitutional rights, therefore, his murder did not matter.\n\nIn July of 2018, the officers who killed Lopez were brought to a grand jury by District Attorney John Champion who attempted to get them indicted on charges of homicide. However, the grand jury irresponsibly failed to return an indictment.\n\n“The grand jury was given all of the evidence and they decided not to indict,” Champion said. “From my perspective, the case is closed at this point.”\n\nNow, according to a document filed by the City of Southaven Tuesday, the city is attempting to justify the murder and dismiss the lawsuit by claiming Lopez has no rights because he was an undocumented immigrant.\n\nLopez’s family attorneys Murray Wells and Aaron Neglia responded to the filing, calling the policy “ludicrous,” according to WMC5. Wells explained to the news outlet that he’s never seen anything like this before, and neither have we.\n\n“The city announced their policy is that undocumented residents have no constitutional protection,” Wells said. “This is an attempt to chip away at our constitution.”\n\nWells correctly stated that any person on US soil is subject to the constitution and the Supreme Court has well established this. Otherwise, Wells said using their justification, “Stormtroopers can kill you without any […] repercussions.”\n\nIndeed, that is the case. If the state can simply claim, post-murder, that the person they killed had no rights, what exactly is there a legal system for in the first place?\n\nWhat’s more, Lopez was actually married to a legal citizen and had lived in the neighborhood for 16 years.\n\n“Everything about this is wrong. I am outraged. Shame, shame on the police department, shame on the DA. Mr. Champion, shame on you. You need to retire,” Pastor Rolando Rostro, Lopez family advocate, said last year.\n\nAs TFTP reported at the time, in July of 2017, Ismael Lopez and his wife were the only ones home when Ismael heard his dogs barking, so he took a look outside to see what was going on. Seconds later, he would be shot and killed by people who claim to protect society. Police had no right to be there and had gone to the wrong address.\n\nThe Southaven Police Department admitted officers went to the wrong house that fateful night. According to police, they were trying to serve a warrant for domestic assault to Samuel Pearman—who lives 36 feet away from Lopez’s home.\n\nPolice claim that when Lopez came to the door, he pointed a gun at them. However, multiple bullets were fired through the closed door and Champion admitted that the autopsy showed Lopez died from a gunshot wound to the back of the head.\n\nAccording to WMC 5, three officers were at the scene, but only one of them opened fire. That officer fired six total shots—two at a dog that ran out of Lopez’s house toward the officers and four into the house. The bullets went through Lopez’s front door; one hit him in the back of the head. Lopez’s dog was grazed by a bullet.\n\n“I do not believe [the officers] identified themselves at the door,” Champion said.\n\nChampion said Lopez was pulling the gun away from the direction of the officers when the officers opened fire. He said he did not want to speculate about how it happened, but he thought Lopez could have been shot in the back of the head while he turned away from the officers, reports WMC 5.\n\nThe autopsy would later prove this to be true.\n\nNone of the officers were wearing a body camera nor was any of the incident recorded on dash camera.\n\nThe federal lawsuit filed by the family is seeking $20 million. City officials said they are ready to “vigorously defend our officers and city in a court of law.” …because officers who shoot innocent people in the back of the head after going to the wrong home, need defending.\n\nAll the officers involved have since returned to full duty, including the one who killed Lopez.\n\nAs the Free Thought Project has reported numerous times, entirely innocent people are often shot or killed by police at the wrong home. The innocent home owner comes to the door with a gun to see who the intruders are and bang, they are met with a hail of gunfire from cops who failed to check their GPS before assaulting completely innocent people.\n\nSadly, as it seems, none of the officers involved in this case will be charged as TFTP reported last year, cops can go to the wrong house, kill the innocent homeowner and face no charges.\n\nA disturbing precedent was set in March of 2017 in a federal appeals court which ruled in favor of police who knocked on the wrong door at 1:30 am, failed to identify themselves, and then repeatedly shot the innocent homeowner until he died.\n\nThe homeowner, 26-year-old Andrew Scott had committed no crime when officers came to his home that night on July 15, 2012.\n\n“Government officials insist that there is nothing unlawful, unreasonable or threatening about the prospect of armed police dressed in SWAT gear knocking on doors in the middle of night and ‘asking’ homeowners to engage in warrantless ‘knock-and-talk’ sessions,” said constitutional attorney John W. Whitehead, president of The Rutherford Institute and author of Battlefield America: The War on the American People. “However, as Andrew Scott learned, there’s always a price to pay for saying no to such heavy-handed requests by police. If the courts continue to sanction such aggressive, excessive, coercive ‘knock-and-shoot’ tactics, it will give police further incentive to terrorize and kill American citizens without fear of repercussion.”\n\nIn the land of the free, those who claim they have sworn to protect you, can come to your house and kill you, and face no consequences by claiming you have no rights. This is why police in America kill more citizens than anywhere in the rest of the world. This is why people protest. This is why people are angry.",
    "author": "Matt Agorist",
    "url": "https://thewashingtonstandard.com/mississippi-cops-go-to-wrong-home-execute-innocent-man-claim-it-was-ok-because-he-had-no-constitutional-rights/",
    "published": "2019-09-29 13:23:49+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}