{
    "data_id": "1038106",
    "id": "thewashingtonstandard--2019-09-19--New Jersey Cops Who Fired At Innocent Man Ultimately Leading To Him Being Set On Fire Savagely B",
    "date": "9/19/2019",
    "source": "thewashingtonstandard",
    "title": "New Jersey:  Cops Who Fired At Innocent Man Ultimately Leading To Him Being Set On Fire & Savagely Beat Him Get No Jail",
    "content": "New Jersey: Cops Who Fired At Innocent Man Ultimately Leading To Him Being Set On Fire & Savagely Beat Him Get No Jail\n\nJersey City, NJ — As TFTP reported in 2017, a high-speed chase in Jersey City ended when the car police were chasing crashed and turned another man’s car into a ball of flames. But it’s the chaotic insanity which followed the crash and the fire that resulted in the indictment of several Jersey City police officers and a massive lawsuit against the city and the department.\n\nThis week, however, all of the officers involved took plea deals and although they were fired, not a single one of them will go to jail for what they did.\n\nThe taxpayers will now be held liable as the innocent victim of gross police negligence and brutality, Miguel Feliz, has filed a $25 million claim against Jersey city and its police department for excessive force used on him in the June 4th incident. Feliz has been unable to return to work since police caused his car to be set on fire, in turn, setting Feliz on fire, and then brutally attacking him.\n\nAs TFTP reported, the group of New Jersey police officers involved were indicted, including two for attempted murder, after they were caught on camera kicking Feliz as he crawled from the burning wreckage of a crash involving the pursuit of Leo Pinkston.\n\nThe officers all faced a slew of charges each:\n\nHowever, none of these charges stuck and they will escape almost all accountability. According to NorthJersey.com, officers Eric Kosinski and Francisco Rodriguez each pleaded guilty to endangering another person. Kosinski, Rodriguez and Khan each fired their weapons during the pursuit.\n\nAll four former officers are barred from future law enforcement employment.\n\n“This agreement is substantive in that it provides accountability for the actions of the police officers while at the same time taking into account the input of the victim,” Hudson County Prosecutor Esther Suarez said in a statement. “It is the most fair and just resolution in a difficult case.”\n\nAsk Feliz — whose body is covered in third-degree burns and whose face was kicked in by police boots as fire engulfed his body — if he thinks this is “the most fair and just resolution.”\n\nAs we reported at the time, Jersey City police were pursuing Pinkston, 48, on the night of June 4, 2017, and had attempted to kill him by firing rounds into his vehicle. He fled, but crashed into another car which was pushed into a telephone pole.\n\nThe car Pinkston crashed into then caught on fire. The innocent man inside the car—Feliz—was able to escape the flames, but not without injury. His clothes and skin were burning.\n\nAs Feliz scrambles to take off his burning clothes as he gets out of the fire, a bystander named Erik Roberto was filming the scene. Roberto screamed to the police, “Oh no…no…Help him out! Help him out!”\n\nBut they did the exact opposite.\n\n“They didn’t help him. They just started kicking him and dragging him…I don’t think they treated him in the right way and that’s not how you treat any human being in this world,” Roberto lamented to reporters.\n\nAfter police rapidly approached the man, with guns drawn, they began kicking him in the ribs and head, apparently mistaking him for Pinkston. It was only after kicking and beating him that they then decided to drag him away from the flames of the burning vehicle.\n\nThe actions of the officers are considered abhorrent by Jersey City Mayor Steven Fulop who told reporters at the time, “I don’t think there’s any explanation that would justify their actions…The entire pursuit that was previous to that fiery crash had questionable judgment calls by the officers, from the shootings to continuing to pursue the car…”\n\nLaughably and predictably, the Jersey City Police Officers Benevolent Association (JCPOBA) president Carmine Disbrow issued a statement defending the actions of its officers that day.\n\nWe at The Free Thought Project beg to differ. The video clearly shows officers, who would have to have been blind not to see a burning man, go up and kick him like a junkyard dog and drag his body like a dead corpse across the pavement.\n\nFeliz now lives in West NY. His father said he suffered severe burns and spent many days in the burn unit in the hospital. He also sustained fractured ribs and has been left permanently disfigured.\n\nHis father called the actions of the officers an attempted “massacre” and said he’d just left home to go to work when the accident and beating took place.\n\nThe entire incident serves to illustrate how police officers treat individuals they suspect as having committed crimes. No longer are suspects innocent until proven guilty. All too often, as TFTP has tirelessly reported, cops comport themselves as judge, jury, and executioners.",
    "author": "Matt Agorist",
    "url": "https://thewashingtonstandard.com/new-jersey-cops-who-fired-at-innocent-man-ultimately-leading-to-him-being-set-on-fire-savagely-beat-him-get-no-jail/",
    "published": "2019-09-19 15:01:07+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}