{
    "data_id": "1038366",
    "id": "thewashingtonstandard--2019-11-01--Kansas: Taypayers To Be Held Liable After SWAT Raids Innocent Family Over Growing Tomato Plants",
    "date": "11/1/2019",
    "source": "thewashingtonstandard",
    "title": "Kansas: Taypayers To Be Held Liable After SWAT Raids Innocent Family Over Growing Tomato Plants",
    "content": "Leawood, KS — Adlynn and Robert Harte and their two children had harmed no one and broken no laws when heavily armed militarized SWAT deputies with the Johnson County sheriff’s department stormed their home like it was an ISIS compound. The “hero” deputies were searching for evidence of marijuana production and use but they found none because the Harte’s don’t use or produce marijuana. They do grow vegetables, however, and they also drink tea.\n\nThe Hartes and their two children were held at gunpoint and nearly killed for purchasing supplies for their vegetable garden and drinking tea. After they were seen buying gardening supplies, cops rummaged through their trash and mistook tea leaves for weed, sparking ‘probable cause’ for the raid. Since the raid in 2012, the Harte family has been attempting to seek justice but to no avail. This month, however, they finally got a break.\n\nAccording to Reason, the U.S. Court of Appeals for the 10th Circuit ruled that Adlynn and Robert Harte, who lost their case after a jury trial in 2017, were wrongly denied the opportunity to pursue several of their claims against the Johnson County sheriff’s deputies who stormed into their home as part of a comically inept publicity stunt.\n\nIn the realm of unlawful police raids, this one may take the cake. It began with a Missouri State Highway Patrolman staking out a garden store every day in Kansas City in hopes of catching some pot growers. Robert Harte visited the store with his two children to buy supplies for an educational vegetable garden project in his basement.\n\nThe sergeant shared Harte’s information with a counterpart in the Johnson County Sheriff’s Office (JCSO), which was planning to raid several suspected cannabis growers on 4/20…such originality. JCSO went through the Harte’s trash on three occasions, eventually finding what officers believed was cannabis clippings soaked in THC extract. Because everyone throws away their weed, right?\n\nBut the “marijuana” was actually discarded tea leaves.\n\nDespite a lab technician saying the tea leaves looked nothing like cannabis leaves or stems, deputies Edward Blake and Mark Burns used notoriously faulty field drug test kits which showed the presence of THC. These supposed field drug tests were the basis for planning the raid, but the deputies never photographed or documented the tests — leading Judge Carlos Lucero to note that these circumstances gave the deputies strong motive to lie.\n\n“The deputies did not photograph any of the substances, nor did they send them to a crime lab for testing,” Judge Joel Carson notes in this month’s 10th Circuit decision. “If the deputies would have sent the wet vegetation to a crime lab for testing, they would have discovered that the wet vegetation was not marijuana but instead was Addie’s loose-leaf tea. Rather than conducting further investigation, the deputies prepared a search warrant affidavit relying solely on the loose-leaf tea found in the garbage and Bob’s shopping trip to a garden store eight months earlier.”\n\nThey had to find something on the Hartes, because the JCSO had already scheduled the raid on the Harte’s home. Several routine investigatory steps were ignored, making their search warrant “based on nothing more than gardening supplies and a bag and wet tea leaves in the garbage.”\n\nThe list of sheer incompetence goes on. In his written decision in 2017, Lucero used extraordinary language to characterize just how reckless these drug warriors were.\n\nDuring the two and a half hour raid – where heavily armed SWAT team broke in during early morning hours while the children were home – officers frantically searched for anything to justify their debacle, but found only tomato plants and gardening supplies. Knowing the history of no-knock SWAT raids, someone could have easily gotten killed.\n\nThe cops had picked the wrong target this time, as both Mr. and Mrs. Harte are former CIA employees and knew a thing or two about research. After the traumatic experience, the Hartes set out to find out why this happened to them. Spending thousands of dollars in legal costs, they were able to procure a probable-cause affidavit.\n\nIt was easy to see that the “probable cause” was full of holes, and thankfully the 10th Circuit court actually studied the facts. The reinstated lawsuit includes unlawful search-and-seizure claims against 10 deputies, the sheriff who started the fiasco and the Johnson County Board of Commissioners.\n\nThe Hartes can also move forward with trying to prove that the cops lied about the field tests, and other claims under state law including trespass, assault and false imprisonment.\n\nAccording to Reason, in its new decision, the 10th Circuit says the district court erred in limiting the Hartes to that one federal claim two years ago. The court has again remanded the case, saying the Hartes should be allowed to pursue three other claims: “(1) whether Defendants properly executed the warrant; (2) whether the deputies exceeded the scope of the warrant by searching for evidence of general criminal activity; and (3) whether the deputies prolonged Plaintiffs’ detention, thus subjecting them to an illegal arrest.”\n\n“There was no probable cause at any step of the investigation,” wrote Lucero in 2017. “Not at the garden shop, not at the gathering of the tea leaves, and certainly not at the analytical stage when the officers willfully ignored directions to submit any presumed results to a laboratory for analysis.”",
    "author": "Matt Agorist",
    "url": "https://thewashingtonstandard.com/kansas-taypayers-to-be-held-liable-after-swat-raids-innocent-family-over-growing-tomato-plants/",
    "published": "Fri, 01 Nov 2019 16:14:25 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}