{
    "data_id": "1045655",
    "id": "trueactivist--2019-01-22--Man Wrongfully Convicted Gets Parole Thanks To Podcast",
    "date": "1/22/2019",
    "source": "trueactivist",
    "title": "Man Wrongfully Convicted Gets Parole Thanks To Podcast",
    "content": "In 1998, Edward Ates was wrongfully convicted for the murder of Elnora Griffin. After being in prison for the last two decades, he was finally released on parole thanks to the Truth & Justice podcast and it’s loyal listeners. These listeners who believed his cry for help raised over $30,000 which Ates’ lawyers used for DNA tests to fully exonerate him.\n\nOn the eve of July 22, 1993, Griffin had been brutally murdered inside her trailer which was located near Ates’ home. Although none of Ates’ DNA was found at the crime scene, their common neighbor, Cubia Jackson, contacted the police putting Ates at the scene on the night of the murder.  When the police investigated his whereabouts, his alibi didn’t check out. The most important piece of evidence was the human feces of the victim found in the crime scene, which they tied up to the ‘supposed’ fecal material the detectives scraped off Ates’ shoe during an interview. Although tests failed to prove that the substance scraped off from Ates’ shoe was faces, this false evidence was used during the 1998 trial, when prosecutors wrongfully told the jury that it was feces; which put the final seal in the coffin and aided his conviction.\n\nBetween 1994 – 1998, when Ates was being tried for the murder, he met his future wife, Kim, and had two children.  He has spent the first part of his children’s lives in prison. In March 2018, when Ates became eligible for parole, the Truth & Justice listeners sent numerous letters to the Board of Padrons and Paroles to release him.  This proved to be a success as Ates was eventually released from the Hunstville State Prison on September 5, 2018. Alison Clayton from the Innocence Project of Texas has been assigned to Ates’ case and is now working hard to fully exonerate him and help him adjust back to re-entering society.",
    "author": "True Activist",
    "url": "http://www.trueactivist.com/man-wrongfully-convicted-gets-parole-thanks-to-podcast-t1/",
    "published": "2019-01-22 01:29:54+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "Street Crime Harmful",
    "": ""
}