{
    "data_id": "10607",
    "id": "aljazeera--2019-03-11--Trial of prominent Saudi woman activist to start this week",
    "date": "3/11/2019",
    "source": "aljazeera",
    "title": "Trial of prominent Saudi woman activist to start this week",
    "content": "The trial of Loujain al-Hathloul, one of nearly a dozen prominent Saudi Arabian women's rights activists jailed since last year, will begin on Wednesday, her family has said.\n\nDozens of other activists, intellectuals and clerics have been arrested separately in the past two years in an apparent bid to stamp out opposition to Crown Prince Mohammed bin Salman, who has consolidated power, including through a sweeping anti-corruption campaign.\n\n\"My sister @LoujainHathloul will be having her first trial session next Wednesday at 8am at the specialised court in Riyadh. This is the court [that] deals with terrorism cases,\" her brother Walid wrote on Sunday on Twitter.\n\nHe said she was not allowed to have a lawyer and had not been provided with a list of indictments.\n\nThe public prosecutor said last June that five men and four women had been arrested and held on suspicion of harming the country's interests and offering support to hostile elements abroad. Saudi media widely denounced them as traitors.\n\nIt was unclear if the other detainees will also stand trial this week.\n\nActivists claim some detainees, including 29-year-old Hathloul, were held in solitary confinement and subjected to mistreatment and torture, including electric shocks, flogging, and sexual assault. Saudi officials have denied those allegations as \"false\".\n\nThe arrests have intensified international criticism of Saudi Arabia after the murder of journalist Jamal Khashoggi last October in the Saudi consulate in Istanbul sparked global outrage.\n\nThree dozen countries, including all 28 European Union members, called on Riyadh last week to release the activists, the first rebuke of the kingdom at the United Nations Human Rights Council (UNHRC) since it was set up in 2006.\n\nUS Secretary of State Mike Pompeo and his British counterpart have also said they raised the issue with the Saudi authorities during recent visits.\n\nThe Saudi government communications office did not immediately respond to a request for comment, but the public prosecutor's office said earlier this month it had completed its investigations of the detainees and was preparing their trials.\n\nHathloul, who advocated an end to a ban on women driving and the kingdom's male guardianship system, was previously jailed for 73 days in 2014 after she attempted to drive into Saudi Arabia from the United Arab Emirates.\n\nThe driving ban was lifted in June, weeks after she was rearrested. The guardianship system, which requires women to obtain the consent of a male relative for major decisions, remains intact.",
    "author": "",
    "url": "https://www.aljazeera.com/news/2019/03/trial-prominent-saudi-woman-activist-start-week-190311063636258.html",
    "published": "2019-03-11 06:47:36+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}