{
    "data_id": "1110495",
    "id": "wnd--2019-12-10--On death row for a murder he did not commit",
    "date": "12/10/2019",
    "source": "wnd",
    "title": "On death row for a murder he did not commit",
    "content": "We often hear about inmates on death row who are exonerated after years behind bars, usually because the prosecution made procedural errors, or there wasn't any DNA evidence to convincingly prove the person committed the crime. But what if it was made clear at the trial that someone else committed the murder, not the guy sentenced to death row?\n\nPatrick Bearup has been sitting behind bars for almost 17 years, sentenced to death for a murder he did not commit. He fell in with some bad people in his 20s. They told him to accompany them to the house of Mark Mathes, who his roommate Jessica Nelson said had stolen $200 from her. Nelson set up the visit. They told the owners of the house, the brother and sister-in-law of Mathes, that they were going to confront him. The brother asked them to get his ring back, which Mathes was wearing. Jeremy Johnson carried a baseball bat over there. Sean Gaines carried a shotgun. Bearup, the son of a police officer in Arizona, was terrified; he thought they were going to kill him. He only had his folding knife on him, which he regularly carried. Instead, Johnson beat Mathes to death with his baseball bat.\n\nAfter Mathes was murdered, Nelson tried to cut the ring off his finger. She was having difficulty, so Bearup helped her and used wire cutters to cut the ring to get it off. They never reported the murder, and Mathes's body was not discovered until a year later.\n\nAfter they were caught, the prosecution offered plea bargains to Johnson, Nelson and Gaines. Johnson, the killer, accepted a deal of 14 years in prison. He is now out. Nelson accepted the same deal and is also now out. Gaines took a plea deal of 25 years; it was longer since he had a criminal history. He is still serving that term.\n\nThe prosecution did not offer Bearup a plea bargain. They claimed that Bearup had cut Mathes's finger off, not the ring – but the body had decomposed after a year so they produced no evidence of this. However, both Johnson and Nelson testified that Bearup did not kill Mathes. They also said he wasn't one of them; they didn't like him because he was a cop's kid. Bearup was convicted of felony-murder by a jury and given the death penalty.\n\nWhy wasn't Bearup given a plea bargain like the others? The Bearups think it is because his father, Tom Bearup, ran against the county sheriff for office. They think the sheriff and county attorney retaliated against them.\n\nJudge Warren Granville, a former prosecutor, was so horrified he wrote in his opinion that justice was not served in this case. He said Bearup's behavior did not rise to the level of a capital punishment crime. He said even if Bearup had cut Mathes's finger off, he still didn't kill Mathes. Mathes's brother tellingly had the ring repaired.\n\nBearup had 2-week-old twins when he was arrested. They have grown up without him. Meanwhile, he has been an exemplary prisoner. He has not gotten into trouble. He has obtained advanced degrees in prison and is currently working on his Ph.D. (which he paid for himself, not the taxpayers). When he was told by a woman on the staff to stop holding Bible studies, he sued and won the right to have them. He makes stuffed animals from prison T-shirts and sells them to raise funds. Some of them are decked out as Trump supporters. The staff tells his family that he is a wonderful guy, not the type you'd find on death row.\n\nBearup is still going through the appeals process. It takes on average of 20 years for inmates on death row to go through the process and get exonerated. He is also trying to get a pardon. Since it's a state crime, President Trump probably can't pardon him. But the governor of Arizona, Doug Ducey, can commute his sentence. Bearup has also asked for clemency from the state clemency board. Nancy Barto, a respected Republican state legislator, provided a letter to the board on Bearup's behalf. Unfortunately, members of the board did not grant it.\n\nHis father asks, \"Why do they want to kill someone who didn't kill someone? While they let the real murderer out on the street? I'm as pro-death penalty as they come. If he had murdered someone I would not be defending him.\" Bearup is now 42. His father says all he wants is for his son to come home before he dies.\n\nI am very skeptical of inmates on death row who are \"exonerated,\" because usually it's not because they were actually innocent. This isn't one of those cases. It's black and white that Bearup did not commit the murder. Hopefully, he will receive justice through the appeal or Gov. Ducey will commute his sentence.",
    "author": "Rachel Alexander",
    "url": "https://www.wnd.com/2019/12/death-row-murder-not-commit/",
    "published": "Tue, 10 Dec 2019 00:04:10 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "Street Crime Harmful",
    "": ""
}