{
    "data_id": "125315",
    "id": "dailybeast--2019-10-18--Convicted Killer Now Charged in Estranged Wife’s Cold-Case Murder: Prosecutors",
    "date": "10/18/2019",
    "source": "dailybeast",
    "title": "Convicted Killer Now Charged in Estranged Wife’s Cold-Case Murder: Prosecutors",
    "content": "A Virginia man who is behind bars for killing his girlfriend has now been charged with the murder of his wife three decades ago, prosecutors announced Friday.\n\nJose Rodriguez-Cruz, 53, was indicted by a Stafford County grand jury for the May 1989 murder of 28-year-old Marta Haydee Rodriguez. Rodriguez-Cruz is currently serving a 12-year prison sentence for the 2009 murder of his girlfriend, Pamela Butler, who was a federal worker in Washington, D.C.\n\nDuring a Friday press conference, Stafford County Commonwealth’s Attorney Eric Olsen announced that the former military police officer, who was discharged after threatening to harm his female superior twice, has been charged with first-degree murder and the unlawful concealment of his wife’s body, finally bringing a 30-year investigation to a close.\n\n“This is the ultimate act of domestic violence and it’s noteworthy that in the month of October justice is going to be delivered for Marta Rodriguez,” Olson said, pointing out that October is Domestic Violence Awareness Month.\n\nRodriguez was last seen on May 1, 1989, as she walked to a bus stop after leaving her job as a nurse’s aide. Prosecutors allege Rodriguez-Cruz murdered his first wife shortly after she told police he had assaulted and kidnapped her—but before she could testify against him in court.\n\n“If I can’t have her, no one will,” Rodriguez-Cruz once said, according to 2017 court documents.\n\nThe 28-year-old’s body was found in 1991 on an Interstate 95 median but was not positively identified until last year.\n\nTwenty years after his wife’s 1989 disappearance, Rodriguez-Cruz fatally strangled Butler, an Environmental Protection Agency analyst and his girlfriend of seven months, during a heated argument before hiding her body. He pleaded guilty to second-degree murder in 2017, at which point he confessed to killing the 47-year-old in her basement in 2009 before slipping her body out of a first-floor window.\n\nOne of Rodriguez-Cruz’s friends told authorities that he once said it was “easy” to get rid of a body because “if you dig a hole deep enough, no one will find it,” according to testimony at his plea hearing. As part of his plea deal, Rodriguez-Cruz told police he buried Butler in 2009 along Interstate 95—where Rodriguez was found—but her remains were never discovered.\n\nDerrick Butler, Pamela’s brother, also attended Friday’s news conference and told reporters he was relieved to hear news of Rodriguez-Cruz’s latest charge.\n\nAuthorities believe his pattern of abuse stretches beyond the death of his two former lovers. In 2017, investigators testified that the 53-year-old told his second wife he knew how to make sure a body was never found. Another woman, a security guard at a federal office, also told detectives that Rodriguez-Cruz allegedly duct-taped her wrists, held a gun to her head, and sexually assaulted her in 2004.\n\n“This man doesn’t impulsively kill. He abducts women, duct-tapes them, sexually assaults them, and then holds them captive,” said Assistant U.S. Attorney Glenn Kirschner said at the 2017 hearing. “Duct tape and a gun are his weapon of choice.”",
    "author": "Pilar Melendez",
    "url": "http://feedproxy.google.com/~r/thedailybeast/articles/~3/yETBrQQaDYM/jose-rodriguez-cruz-va-man-who-killed-his-girlfriend-now-charged-in-estranged-wifes-murder-prosecutors",
    "published": "Fri, 18 Oct 2019 17:18:31 GMT",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}