{
    "data_id": "126051",
    "id": "dailybeast--2019-11-26--UIC Student’s Alleged Killer Was ‘Angry’ She Ignored His Catcalls: Prosecutors",
    "date": "11/26/2019",
    "source": "dailybeast",
    "title": "UIC Student’s Alleged Killer Was ‘Angry’ She Ignored His Catcalls: Prosecutors",
    "content": "A man who sexually assaulted and strangled a University of Illinois at Chicago student to death over the weekend became “angry” at the young woman when she “ignored” his catcalls, prosecutors said in court Tuesday.\n\nDonald Thurman, 26, was charged on Monday with first-degree murder and criminal sexual assault for the grisly Saturday night slaying of 19-year-old Ruth George. George, a sophomore kinesiology major, was found “unresponsive” in the backseat of her family’s car on Saturday morning after her family reported her missing to campus police.\n\nIn Cook County court on Tuesday, prosecutors alleged Thurman saw George across the street and started catcalling her. The student didn’t respond and kept walking—which made the 26-year-old “angry he was being ignored,” Assistant State’s Attorney James Murphy said.\n\nOnce inside the parking lot, prosecutors said Thurman grabbed George and placed her in a chokehold before throwing her into the backseat of her family’s car. He then allegedly sexually assaulted the teenager with a condom on while she was unconscious.\n\nPolice say Thurman, who lived near campus but has no affiliation with the university or the victim, confessed to killing the student just hours after he was arrested. In 2016, he was sentenced to six years in state prison for an armed robbery after allegedly stealing a woman’s iPhone and fleeing in a stolen vehicle. He was released last year and is currently on parole, jail records show.\n\nGeorge’s family members said Tuesday that they hold “no hatred” toward their loved one’s alleged killer as they “grieve with hope.”\n\n“Our hope is no other girl would be harmed in this way and for a mother to never experience this type of heartache,” the family said in a statement. “Ruth lived out her deep faith in Jesus by loving and serving others, leaving a legacy of Christ-centered kindness and sacrifice. She was the beloved baby of our family.”\n\nAccording to university surveillance cameras, Thurman was walking behind George as she entered the garage around 1:35 a.m. on Saturday. About 35 minutes later, he can be seen running south on Halsted Street, away from the scene.\n\nGeorge’s family contacted campus police at around 11 a.m. on Saturday after they had not heard from her in two days. Police said the teenager’s cell phone “pinged” off a Halsted Street garage on campus—where they found her dead in the backseat of the family-owned car.\n\nAt around 2 a.m. on Sunday, detectives picked up Thurman at the Halsted and Harrison station and took him into custody. After about 12 hours of police questioning, he “gave a full confession to this horrific crime,” authorities said.\n\nThurman’s attorney argued to Judge Charles Beach on Tuesday that his client is homeless with a history of childhood abuse and suicidal ideations. Despite her request for protective custody—noting death threats he has received since his arrest—Beach ordered Thurman to be held in Cook County jail without bail.\n\nHundreds of UIC students gathered Monday night to mourn the young woman who dreamed of becoming a physical therapist, hanging dozens of yellow ribbons around campus in her memory. George was a 2018 graduate of Naperville Central High School, where she was a member of the school’s gymnastics team.\n\n“It is very difficult to find words that can express the sadness our entire community experiences today following the news of the tragic death of a 19-year-old undergraduate student,” UIC Chancellor Michael Amiridis said in a statement. “We offer our sincere condolences to the student’s family and friends and I know that all of us have them in our hearts as they struggle with this devastating loss.”\n\nIn several social media posts, George’s family and friends recalled the teenager as “the sweetest person” with the “brightest smile.”\n\n“She was the light of our family and the best of all of us,” Esther George, her older sister, wrote on Facebook. “She was wise beyond her years and now she is gone [too] soon. God give us peace.”\n\nThe teenager’s former teammates said people were “drawn to her” ability to make everyone feel welcome.\n\n“For the girls who were new on the team each season, she was always one to help make everyone feel welcome, and the girls were drawn to her because of that,” Mary Grace Maxwell, a former teammate and friend told The Chicago Tribune on Tuesday. “It’s incredibly heartbreaking to know someone took this beautiful girl away from us.”",
    "author": "Pilar Melendez",
    "url": "http://feedproxy.google.com/~r/thedailybeast/articles/~3/0CyvnC6X-us/donald-thurman-ruth-georges-alleged-killer-was-angry-uic-student-ignored-his-catcalls-prosecutors",
    "published": "Tue, 26 Nov 2019 19:19:32 GMT",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}