{
    "data_id": "128654",
    "id": "dailyheraldchicago--2019-08-23--The Latest Serial killer who preyed on gay men executed",
    "date": "8/23/2019",
    "source": "dailyheraldchicago",
    "title": "The Latest: Serial killer who preyed on gay men executed",
    "content": "A serial killer who preyed on older gay men during a rampage 25 years ago around the U.S. East Coast has been put to death.\n\nThe office of Gov. Ron DeSantis says 57-year-old Gary Ray Bowles was pronounced dead at 10:58 p.m. Thursday after receiving a lethal injection at Florida State Prison in Starke.\n\nHe was condemned to die for his murder conviction in the 1994 slaying of Walter Hinton in Jacksonville Beach. That was one of the six known killings that terrorized the Interstate 95 corridor that year and earned him the nickname of the \"I-95 killer.\"\n\nHinton was Bowles' sixth victim in the killing spree that began in Daytona Beach with the slaying of John Hardy Roberts. In between, there were victims in Maryland, Georgia and Florida. In each case, Bowles stuffed the victims' throats.\n\nThe U.S. Supreme Court has cleared the way for the execution of a Florida serial killer who targeted older gay men in a spree a quarter-century ago.\n\nThe justices denied the last-ditch appeal Thursday of 57-year-old Gary Ray Bowles, whose lawyers had claimed he is too intellectually disabled to be executed. Bowles was to die by lethal injection late Thursday at the Florida State Prison in Starke.\n\nBowles was condemned for the murder of Walter Hinton in Jacksonville Beach - one of the killings that terrorized the East Coast's Interstate 95 corridor in 1994.\n\nHinton was Bowles' sixth and final known victim in a spree that began in Daytona Beach with the slaying of John Hardy Roberts. In between, there were victims in Maryland, Georgia and Florida.\n\nIn each case, Bowles stuffed the victims' throats with objects.\n\nThe scheduled execution of a Florida serial killer who targeted older gay men awaited a ruling from the U.S. Supreme Court on his final appeals.\n\nThe high court was mulling a last-ditch appeal Thursday from 57-year-old Gary Ray Bowles, whose lawyers contended he is too intellectually disabled to be executed. Bowles was set to die by lethal injection at the Florida State prison in Starke.\n\nThe execution was scheduled for 6 p.m. Thursday but was delayed while the Supreme Court considered his case.\n\nBowles was condemned for the murder of Walter Hinton in Jacksonville Beach - one of the killings that terrorized the East Coast's Interstate 95 corridor in an eight-month span in 1994.\n\nHinton was Bowles' sixth and final known victim in a spree that began in Daytona Beach with the slaying of John Hardy Roberts. In between, there were victims in Rockville, Maryland; Savannah, Georgia; Atlanta and Nassau County, Florida.\n\nA serial killer who preyed on older gay men during a rampage that left six dead a quarter century ago received no visitors in the hours before his planned execution.\n\nOfficials at Florida State Prison in Starke say 57-year-old Gary Ray Bowles did eat a meal of three cheeseburgers, French fries and bacon as execution preparations were being made. He's set to receive a lethal injection for the murder of Walter Hinton in Jacksonville Beach - one of the killings that terrorized the Interstate 95 corridor in an eight-month span in 1994.\n\nThe execution plan awaits a ruling by the U.S. Supreme Court on his final appeals.\n\nHinton was Bowles' sixth and final known victim in a spree that began in Daytona Beach with the slaying of John Hardy Roberts. In between, there were victims in Rockville, Maryland; Savannah, Georgia; Atlanta and Nassau County, Florida.\n\nA serial killer who preyed on older, gay men during a spree that left six dead on or near the U.S. East Coast 25 years ago is set to be executed at a Florida prison.\n\nFifty-seven-year-old Gary Ray Bowles is set to receive a lethal injection Thursday evening, convicted of the November 1994 murder of Walter Hinton in Jacksonville Beach - one of the killings that terrorized the Interstate 95 corridor in eight-month span.\n\nHinton was Bowles' sixth and final known victim in a rampage that began in Daytona Beach with the slaying of John Hardy Roberts. In between, there were victims in Rockville, Maryland; Savannah, Georgia; Atlanta and Nassau County, Florida.\n\nIn each case, Bowles stuffed the victims' throats with objects such as rags toilet paper, dirt and leaves. Investigators say if he hadn't been caught, Bowles would have kept on killing.",
    "author": "",
    "url": "http://www.dailyherald.com/article/20190822/news/308229763/",
    "published": "2019-08-23 03:10:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}