{
    "data_id": "139806",
    "id": "democracynow--2019-11-06--Is Texas About to Execute an Innocent Man? Rodney Reed's Family Demands Retrial Amid New Evidence",
    "date": "11/6/2019",
    "source": "democracynow",
    "title": "Is Texas About to Execute an Innocent Man? Rodney Reed's Family Demands Retrial Amid New Evidence",
    "content": "This is a rush transcript. Copy may not be in its final form.\n\nAMY GOODMAN: The state of Texas is facing growing calls to halt the execution of Rodney Reed, an African-American man who spent over 20 years in prison for a rape and murder he says he did not commit. A group of 26 Texas lawmakers, including both Democrats and Republicans, penned a letter this week asking Governor Greg Abbott to stop the execution planned for November 20th. More than a 1.4 million people have signed an online petition to save Reed’s life. Supporters include celebrities Kim Kardashian West, Rihanna and Meek Mill.\n\nRodney Reed was sentenced to die after being convicted by an all-white jury for the 1996 murder of Stacey Stites, a 19-year-old white woman. The two were having an affair at the time. But substantial evidence has since emerged implicating Stites’ fiancé, a white police officer named Jimmy Fennell, who was later jailed on kidnapping and rape charges in another case. In a major development, a man who spent time in jail with Fennell signed an affidavit last month asserting that Fennell had admitted in prison he killed his fiancée because she was having an affair with a black man.\n\nLater in the show, we’ll be joined by Rodney Reed’s brother and sister-in-law. But first, let’s turn to the documentary A Plea for Justice, made by Filmmakers for Justice.\n\nAMY GOODMAN: An excerpt from A Plea for Justice about the Rodney Reed case. Last month, the popular daytime TV host Dr. Phil aired an interview he did with Rodney Reed on death row.\n\nAMY GOODMAN: Rodney Reed, speaking on the Dr. Phil show ahead of his execution scheduled for November 20th.\n\nWell, I recently sat down with Rodney Reed’s brother and sister-in-law, who we’ll hear from later in the show. They recently came to our studio along with Bryce Benjet, a senior attorney at the Innocence Project. I began by asking Bryce Benjet to lay out the story.\n\nAMY GOODMAN: Bryce Benjet, senior attorney at the Innocence Project. His client Rodney Reed is scheduled to be executed by the state of Texas November 20th. When we come back, we’ll be joined by Rodney Reed’s brother and sister-in-law. Stay with us.\n\nAMY GOODMAN: “Mercy, Mercy Me” by Marvin Gaye. This is Democracy Now! I’m Amy Goodman, as we continue to look at the case of Rodney Reed, the African-American man scheduled to be executed November 20th by the state of Texas for a murder and rape he says he did not commit. Growing evidence shows Reed was framed as part of a cover-up to protect a white police officer, Jimmy Fennell, who killed his own fiancée, Stacey Stites. More than 1.4 million people have signed an online petition to save Reed’s life. I recently sat down with two members of Rodney Reed’s family: his brother Rodrick Reed and his sister-in-law Uwana Akpan, as well as Rodney Reed’s attorney, Bryce Benjet of the Innocence Project. I asked Rodrick Reed how it felt to have his brother face the death penalty all these years.\n\nAMY GOODMAN: That’s Rodney Reed’s brother Rodrick Reed, Rodney’s sister-in-law Uwana Akpan and his attorney Bryce Benjet of the Innocence Project. Rodney Reed is scheduled to be executed by the state of Texas November 20th for the murder of Stacey Stites in 1996. In late October, Reed’s legal team filed an application for clemency with the Texas Board of Pardons and Paroles after a man revealed that Stacey Stites’ fiancé, Jimmy Fennell, a white ex-police officer, had admitted to the murder while he was in prison for another crime. I want to end with the words of Rodney Reed speaking recently from death row to Dr. Phil.\n\nAMY GOODMAN: That’s Rodney Reed speaking to Dr. Phil on death row in Texas. Rodney Reed is scheduled to be executed by the state of Texas November 20th.\n\nWhen we come back, we look at election results from around the United States with John Nichols of The Nation. Stay with us.",
    "author": "mail@democracynow.org (Democracy Now!)",
    "url": "http://www.democracynow.org/2019/11/6/rodney_reed_calls_to_stop_execution",
    "published": "Wed, 06 Nov 2019 08:10:38 -0500",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}