{
    "data_id": "146361",
    "id": "drudgereport--2019-04-06--OJ Prosecutor Darden Defending Suspected Nipsey Hussle Killer",
    "date": "4/6/2019",
    "source": "drudgereport",
    "title": "OJ Prosecutor Darden Defending Suspected Nipsey Hussle Killer...",
    "content": "— An aspiring rapper plead not guilty Thursday in the murder of hip hop artist Nipsey Hussle in South Los Angeles.\n\nEric Ronald Holder Jr., 29, was arraigned in a downtown Los Angeles courtroom on one count of murder, two counts of attempted murder and one count of possession of a firearm by a felon.\n\nIf convicted as charged, he faces a possible maximum sentence of life in state prison.\n\nHolder is represented by Christopher Darden, the former city prosecutor from the O.J. Simpson murder trial in the mid-1990s, according to CBSLA’s Dave Lopez.\n\nHolder could face a potential life prison sentence if convicted as charged, according to the Los Angeles County District Attorney’s Office.\n\nHussle, whose real name is Ermias Joseph Asghedom, was fatally shot Sunday in the 3400 block of West Slauson Avenue.\n\nThe Grammy-nominated rapper was gunned down outside The Marathon Clothing, a store he opened in 2017, in the Hyde Park neighborhood just south of the Crenshaw area where he was born and grew up. Two other men were also wounded in the attack, although only one of them was hospitalized.\n\nAccording to LAPD Chief Michel Moore, Holder and Hussle became involved in some sort of dispute outside the store before Holder left and returned with a handgun. Hussle was shot in the head and body and died at a hospital, officials said.\n\n“We believe this to be a dispute between Mr. Hussle and Mr. Holder,” Moore said. “I’m not going to go into the conversations, but it appears to be a personal matter between the two of them.”\n\nHolder is being held on $5 million bail.",
    "author": "",
    "url": "http://feedproxy.google.com/~r/DrudgeReportFeed/~3/5RfFzGUyVqs/",
    "published": "2019-04-06 10:37:37+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}