{
    "data_id": "14998",
    "id": "aljazeera--2019-08-06--Trial begins for priests accused of abusing Argentine students",
    "date": "8/6/2019",
    "source": "aljazeera",
    "title": "Trial begins for priests accused of abusing Argentine students",
    "content": "Two priests and a gardener have appeared in court to face charges of sexually abusing deaf children in their care, in a case that has sent shockwaves through Argentina's Catholic church.\n\nPriests Nicola Corradi, an 83-year-old Italian, and 59-year-old Argentine Horacio Corbacho, as well as former gardener Armando Gomez, 63, are accused of sexual abuse, corruption of children and mistreatment at a Catholic school for deaf children.\n\nThey face prison sentences of up to 20 years in some cases, up to 50 years in others.\n\nThe case relates to the abuse of around 20 children from the Provolo Institute in the western town of Mendoza. Corradi headed the institute, founded in 1995, until his arrest in November 2016.\n\nAs the three accused - Corbacho and Gomez in handcuffs - were led down a long corridor in Mendoza's Palace of Justice on Monday to a court where three judges awaited them, alleged victims and their relatives protested outside, with one sign saying \"With Our Hands And Our Voices We Break The Silence,\" a reference to sign language.\n\n\"I am super-nervous, anxious and I hope for justice; that this ends soon so my son can move on to a new stage because this is very hard,\" said Natalia Villalonga, whose 18-year-old son Ezequiel was one of the students abused at the Provolo Institute.\n\nThe alleged abuse took place between 2004 and 2016, and the case gained world attention when it emerged that Corradi had faced similar accusations at the Antonio Provolo Institute in Verona, Italy, and Pope Francis had been notified the Italian priest was running a similar centre in Argentina.\n\nCorbacho has pleaded not guilty to the sexual abuse charges, while Corradi and Gomez have not entered pleas.\n\nThe closed-doors trial, expected to last two months, will hear testimony from 13 victims who suffered abuse between the ages of four and 17.\n\nIt is the first in a series of trials involving other former members of the now-closed school.\n\nOthers implicated include two nuns who allegedly participated or knew about the abuses, as well as former directors and employees who are accused of knowing about the abuse but taking no action.\n\nJorge Bordon, an institute employee, was sentenced to 10 years in prison in 2018 in a case of rape, sexual touching and corrupting minors.\n\nCorradi moved to Argentina in 1970 from the original Provolo Institute in Verona - which has also been shaken by a paedophilia scandal in recent years - to run the Provolo in La Plata, before transferring to the Mendoza institute in 1998.\n\nHis name appeared in a letter addressed to the pope in 2014 in which the Italian accusers mentioned several allegedly abusive priests who continued to exercise the ministry and said that Corradi and three other priests were in Argentina.\n\nThe Verona diocese sanctioned four of the 24 defendants, but not Corradi.\n\nThere was no criminal case because of the elapsed time.",
    "author": "",
    "url": "https://www.aljazeera.com/news/2019/08/priests-accused-sexually-abusing-argentine-students-trial-190806084805091.html",
    "published": "2019-08-06 13:34:48+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}