{
    "data_id": "151854",
    "id": "drudgereport--2019-10-06--Hunt on for killer",
    "date": "10/6/2019",
    "source": "drudgereport",
    "title": "Hunt on for killer...",
    "content": "KANSAS CITY, Kan. — Four people were killed and five others were injured in an overnight shooting at a bar in Kansas City, Kansas, according to police.\n\nAround 1:30 a.m Sunday., officers responded to a shooting at Tequila KC Bar at 10th Street and Central Avenue. In a news release, police said that an earlier dispute inside the bar may have led to the shooting. Police said the suspects were armed with handguns and fled the scene after the shooting.\n\nPolice did not release any additional information about the suspects or a possible motive.\n\nKansas City, Kansas, Mayor David Alvey said his prayers are with both the victims' families and the assailants.\n\n\"The businesses and the families who live in these neighborhoods are growing in our community and they deserve to feel safe in their neighborhoods,\" Alvey said. \"Their businesses deserve to be protected and our police department really has done an outstanding job of working with the community to identify the problems and to come up with solutions.\"\n\nFour people inside the bar were killed. Police did not release their names but said the four victims were all Hispanic men. One was in his late 50s, one in his mid-30s and two were in their mid-20s, KCK police spokesman Officer Thomas Tomasic said.\n\nInjuries to the other five victims were not life-threatening. Later Sunday morning, two of the victims had been treated and released from the hospital.\n\nToni Maciel, who knows the victims, said he wants to know why the shooting happened.\n\n\"Just think once or twice about your actions,\" Maciel said. \"Think 10 times about your actions -- who you are going to affect, mothers, fathers, daughters, wives, fiances, friends, because you took a good chunk away from this bar.\"\n\nREAD MORE: Here is what we know about the Tequila KC Bar.\n\nOn Sunday morning, police remained at the scene, collecting evidence and surveillance video from the bar.\n\n\"Detectives are here and are looking at any surveillance,\" Tomasic told 41 Action News. \"This is definitely one of those that we’re going to do everything very slowly, very methodically and correctly.\"\n\nPolice estimated there were around 40 people inside the bar at the time of the shooting.\n\nIn brief remarks to the media, Kansas City, Kansas, Mayor David Alvey said the shooting was \"sad for all involved.\"\n\nOther area political leaders took to social media to offer their condolences to the victims of the shooting. Rep. Sharice Davids, D-Kansas 3rd District, represents the area where the shooting took place. She tweeted that her \"heart breaks for everyone impacted by the senseless shooting.\"\n\nKansas Gov. Laura Kelly tweeted that her thoughts were with the victims and their families.\n\nSenator Jerry Moran, R-Kansas, Earlier in the morning, Sen. Pat Roberts, R-Kansas, also took to Twitter to talk about the shooting,\n\nAgents with the Bureau of Alcohol, Tobacco, Firearms and Explosives in Kansas City also responded to the shooting.\n\nThis a developing story. We'll post updates as they become available.",
    "author": "",
    "url": "http://feedproxy.google.com/~r/DrudgeReportFeed/~3/v-cDGVy34G0/four-people-killed-in-kck-bar-shooting",
    "published": "2019-10-06 20:19:36+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}