{
    "data_id": "1562",
    "id": "abcnews--2019-03-11--2 Department of Justice officials dispute double standard over Mueller documents",
    "date": "3/11/2019",
    "source": "abcnews",
    "title": "2 Department of Justice officials dispute 'double standard' over Mueller documents",
    "content": "Two senior Justice Department officials are privately dismissing claims by House Democrats that refusing to share special counsel Robert Mueller's final report and other investigative materials with Congress would amount to a \"double standard.\"\n\nThe circumstances that led the Justice Department to disclose investigative information in other recent, high-profile cases now being cited by Democrats are \"just not the same\" as the circumstances surrounding the Mueller probe, one senior department official insisted to ABC News, speaking on the condition of anonymity because he was not authorized to speak publicly about it.\n\nThat official and another high-ranking Justice Department insider both pointed to what they see as one big difference: former FBI director James Comey.\n\nIn past cases, the officials alleged, Comey's public statements undercut the Justice Department's ability to argue that certain investigative materials should remain private. And, they said, the department only shared documents when investigations were finished or couldn't be impacted by the release of those documents.\n\nLong-standing department policy prohibits the disclosure of information that could influence ongoing probes or harm people who haven't been charged.\n\nBut powerful Democrats in Congress worry the Trump administration could stretch that policy to execute \"a cover up,\" as the chairman of the House Judiciary Committee, Rep. Jerrold Nadler, D-N.Y., recently put it. And two weeks ago, the chairman of the House Intelligence Committee, Rep. Adam Schiff, D-Calif., accused the Justice Department of a \"double standard\" for turning over \"substantial amounts of investigative material\" when Republicans were in control of Congress last year and the year before.\n\nIn fact, the Justice Department gave lawmakers access to 880,000 pages of documents related to the FBI investigation of Hillary Clinton's use of a private email server while she served as secretary of State. And the Justice Department offered lawmakers access to a wide array of documents from the FBI's investigation of Russian meddling in the 2016 presidential campaign, including information related to Americans targeted in the probe.\n\nIn a letter to Attorney General Bill Barr three weeks ago, Nadler, Schiff and the Democratic chairs of four other House committees insisted that \"precedent\" leads them to \"expect\" access to Mueller's report and other investigative material. On Friday, they introduced a congressional resolution reiterating their stance.\n\nDemocrats fear that even if Mueller fails to find evidence of criminal wrongdoing, he could find evidence of misconduct that the public might never see.\n\n\"People are entitled to know it, and Congress is entitled to know it,\" Nadler told ABC News last week. \"It's our job to hold the president accountable.\"\n\nBut two weeks ago, Deputy Attorney General Rod Rosenstein assailed what he called the \"knee-jerk reaction\" calling on the government to share its secrets.\n\n\"If we aren't prepared to prove our case beyond a reasonable doubt in court, then we have no business making allegations against American citizens,\" Rosenstein said.\n\nIn May 2017, just days before Comey's firing, Rosenstein wrote a letter to Trump blasting Comey for publicly airing criticisms of Clinton a year earlier.\n\nOn July 5, 2016, inside FBI headquarters, Comey announced that — even though Clinton and her aides shouldn’t be charged — they were \"extremely careless\" in handling classified information. For 15 minutes, Comey detailed what his team found and contemplated.\n\nWithout those public comments, the Justice Department could have withheld documents on the basis that they reflected internal deliberations. But \"from the get-go we had a very, very weak litigating position because\" Comey had in effect waived that privilege, one senior Justice Department official said.\n\nIn addition, the Clinton email probe was \"over and closed\" when lawmakers were granted access to materials, the other official noted.\n\nAsked whether the Justice Department would share what Mueller found about allegations of obstruction of justice — since that inquiry would likely be closed when Mueller issues his report — the officials declined to answer.\n\nNevertheless, in Mueller's case there are ongoing investigations and prosecutions to still protect, the officials said.\n\n\"The tentacles of [Mueller's probe] are going to continue being investigated for some unforeseen period of time in the future,\" according to one official. \"[And] we do not give over to the Hill any material that could negatively impact an ongoing investigation.\"\n\nThat didn’t stop the Justice Department, however, from disclosing pivotal materials from the FBI’s Russia probe while Mueller’s investigation was underway.\n\nWhen Republicans were accusing the FBI of abusing the Foreign Intelligence Surveillance Act to target President Donald Trump's associates, dozens of lawmakers were eventually granted access to four top-secret FISA applications, which after being approved by a federal court allowed the FBI to intercept the communications of former Trump adviser Carter Page, who at the time was suspected of being a Russian spy.\n\nKey lawmakers were also able to review thousands of pages of internal emails and other classified materials.\n\nThose accommodations \"potentially\" provide Democrats with their best argument to gain access to Mueller’s findings, the two Justice Department officials acknowledged to ABC News.\n\nBut — once again — the officials blamed Comey for opening the door for Congress, saying his public statements on the Russia probe had \"a lot\" to do with their decisions.\n\nIn early 2017, Comey took the rare step of publicly confirming the FBI launched an investigation into Trump's associates and reviewed the so-called \"dossier,\" which by then had been published online by news outlets and detailed allegations against Page that were ultimately included in the FISA applications.\n\nThen, in coordination with the White House, the chairman of the House Intelligence Committee, Rep. Devin Nunes, R-Calif., drafted and released a memo citing substantial portions of the FISA applications.\n\nSo two months later, based on what had already become public, the Justice Department made what it called the \"extraordinary\" decision to let the entire House and Senate intelligence committees review the FISA applications.\n\n\"[But] we really didn't give them the keys to the kingdom,\" one of the officials said.\n\nIn fact, the Justice Department did refuse to comply with several Russia-related requests. And in a letter to Congress at the time, Rosenstein said the \"voluminous\" production of documents was done \"in a manner that does not harm the integrity of any ongoing investigation.\"\n\nIn Mueller's probe, the department will similarly \"protect the integrity of ongoing investigations\" and \"apply\" privileges when appropriate, the two Justice Department officials told ABC News.\n\n\"We have to actually pick our battles, which we're going to do,\" one of them said.\n\nMueller could send his final report to Barr in the coming days. It is not expected to detail the findings of spin-off investigations that Mueller referred to prosecutors around the country to pursue separately.\n\nBarr has publicly promised lawmakers that he will then send his own \"report\" on Mueller's probe to Congress. It's unclear how extensive that document will be.\n\nNadler and Schiff have said they will sue the Trump administration for Mueller’s evidence if necessary.\n\nSpokespeople for Nadler and Schiff did not respond to requests seeking comments for this article.",
    "author": "Mike Levine",
    "url": "https://abcnews.go.com/Politics/department-justice-officials-dispute-double-standard-mueller-documents/story?id=61544902",
    "published": "2019-03-11 18:41:18+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}