{
    "data_id": "157756",
    "id": "eveningstandard--2019-01-04--Speedboat killer Jack Shepherd could be aposanywhere in the worldapos Scotland Yard admits",
    "date": "1/4/2019",
    "source": "eveningstandard",
    "title": "Speedboat killer Jack Shepherd could be &apos;anywhere in the world,&apos; Scotland Yard admits",
    "content": "Police have conceded they have no idea of the whereabouts of speedboat fugitive Jack Shepherd, who disappeared part way through his trial over the death of his date Charlotte Brown.\n\nThe web designer has been at large since being convicted in his absence of manslaughter by gross negligence in July last year.\n\nShepherd, 31, was sentenced to six years in jail after being found culpable over the death of Miss Brown, 24, in a speedboat accident on the Thames in December 2015.\n\nDetectives say he may be using secret bank accounts belonging to friends or relatives to finance his life on the run.\n\nShepherd was given permission to challenge his conviction by a judge at the Court of Appeal on December 19.\n\nShepherd’s passport was not confiscated before the trial.\n\nDetective Chief Inspector Mick Norman, from the Met, told the Daily Mail that “Shepherd is subject to an international arrest warrant. However since he failed to appear in court for his trial there has been no tangible trace of him.”\n\nMr Norman added that despite being in touch with his London solicitors, there had been “no tangible trace” of Shepherd.\n\nHis lawyers, who are funded through legal aid, insist they do not know where he his.\n\n“There have been a number of rumours that he is being harboured abroad by friends but we have no evidence this is the case,” Mr Norman said.\n\n“There has been no movement on his bank accounts or phone. However this is only in respect of the accounts we are aware of.”\n\nHe added: “He may well be using the accounts of friends or family associates to evade arrest and extradition.\n\n“We would also appeal to Mr Shepherds friends and associates who may be assisting him to do the right thing and share any information.”\n\nA Metropolitan Police spokesman told the Daily Mail: “Shepherd’s passport was not seized by the police or the court as he was on court bail and fully complying with bail conditions up to the time of the trial when he failed to appear.”\n\nMs Brown's parents, Graham Brown and Roz Wickens, told the BBC they did not want to comment on the appeal until after 22 January, when they will meet Home Secretary Sajid Javid to discuss efforts to trace Shepherd.\n\nThey have previously said it was \"not fair\" Shepherd had not faced justice.\n\nThe Daily Mail is offering a £25,000 reward for information that leads to him being flushed out of his hiding place.",
    "author": "Bonnie Christian",
    "url": "https://www.standard.co.uk/news/crime/speedboat-killer-could-be-anywhere-in-the-world-scotland-yard-admits-a4030351.html",
    "published": "2019-01-04 10:46:58+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}