{
    "data_id": "159359",
    "id": "eveningstandard--2019-01-14--Mother of murder victim says sheaposll never be free of pain as killers are jailed",
    "date": "1/14/2019",
    "source": "eveningstandard",
    "title": "Mother of murder victim says she&apos;ll never be free of pain as killers are jailed",
    "content": "The mother of a student who was shot and stabbed to death at random by roving gang members said she will “never be free from pain” as she saw her son’s killers jailed.\n\nRussell Jordan Jones, 23, was standing on a street corner talking to friends when he was ambushed by four masked men brandishing knives and a 12-bore shotgun.\n\nMr Jones fled for his life but stumbled and was shot and then stabbed 12 times in a “merciless” attack. One of his friends was also knifed in the back but survived.\n\nOn Friday Judge Mark Dennis QC jailed two of the killers, Bilkan Bilkaner, 20, and Duke Quainoo, 21, for life and ordered that they both serve at least 29 years behind bars.\n\nHe said Mr Jones and his friends were not associated with gangs and had been “picked on at random” by the killers who wrongly believed they were rivals simply because they were standing together on a street corner.\n\nAt the sentencing hearing Mr Jones’s mother, Stephanie Saunders, said she believes unanswered questions about her son’s murder will “haunt me forever”.\n\n“I would give my life in a heartbeat for Russell to have his back. Every day is pure torture”, she told the Old Bailey. “This is just the beginning of a life-long sentence, I will never be free from the pain and grief.”\n\nShe told the court her son was months away from completing a business management degree at the University of Hertfordshire and it was awarded posthumously following his murder.\n\nMr Jones had been out for dinner with friends on March 16 last year and was in South Street in Edmonton just after midnight when he was attacked.\n\nBilkaner, Quainoo, and two other men — who have not been caught — had spent an hour driving around the area looking for potential targets.\n\nJudge Dennis said: “This was a shocking and brutal attack without a motive beyond the desire to cause death and serious injury to others.”\n\nBilkaner, from Edmonton, and Quainoo, from Enfield, both denied but were convicted at trial of murder, causing grievous bodily harm with intent and possession of a firearm with intent to endanger life.\n\nWhen the jury returned its verdicts last month and cleared a co-defendant of the attack, Bilkaner and Quainoo violently attacked the third man in the dock. However, they both showed no emotion as they were sentenced over videolink from prison on Friday.",
    "author": "Tristan Kirk",
    "url": "https://www.standard.co.uk/news/crime/mother-of-victim-says-she-ll-never-be-free-of-pain-as-killers-are-jailed-a4038291.html",
    "published": "2019-01-14 12:16:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}