{
    "data_id": "160981",
    "id": "eveningstandard--2019-01-23--Jack Shepherd arrested Charlotte Brownaposs family say speedboat killer is aposa crass reckles",
    "date": "1/23/2019",
    "source": "eveningstandard",
    "title": "Jack Shepherd arrested: Charlotte Brown&apos;s family say speedboat killer is &apos;a crass, reckless man&apos; after he hands himself in",
    "content": "Charlotte Brown's father said his daughter's killer is a \"crass, reckless man\" after he handed himself into police in Georgia in front of the country's media.\n\nGraham Brown spokes of his overwhelming emotion after speedboat killer Jack Shepherd, 31, was arrested in Georgia after months as a fugitive.\n\nMs Brown died after going on a date with Shepherd where they went out on his boat during a date in December 2015.\n\nHer father welcomed the news of Shepherd's arrest and called on him to \"atone\" for what happened.\n\nHe said: \"My opinions towards Jack Shepherd is that he's a very crass, reckless man, who managed to abscond and stick two fingers up at the judiciary.\n\n\"He's got to come back to atone for all that and I think that he's done the right thing and thank goodness he's realised that now and handed himself in.\n\n\"It's been quite hard over the last three years.\"\n\nShepherd had been on the run since before his trial and conviction for the manslaughter of Charlotte Brown\n\nHis trial started last July and he was eventually convicted for manslaughter by gross negligence of 24-year-old Ms Brown who was killed after he took her on a date on his speedboat.\n\nHe disappeared before his trial started in July and was sentenced to six years in jail in his absence at the Old Bailey having skipped bail and fled the UK.\n\nShepherd had denied manslaughter ahead of his trial.\n\nImages from Georgian broadcaster Rustavi 2 appear to show a heavily-bearded Shepherd smiling and calmly handing himself in.\n\nHe was also interviewed on screen as he did so.\n\nOn Wednesday, Shepherd's legal representative in the former Soviet Republic of Georgia said Shephered had handed himself in because \"he was ready to prove he was innocent\".\n\nShepherd told reporters from the Georgian broadcaster that he was \"in a tragic accident.\"\n\nHe married his childhood sweetheart following Ms Brown's death and had a child but he is now estranged from his wife.\n\nKatie Brown, Charlotte's sister, voiced surprise over Shepherd's \"smug\" appearance on clips aired by a Georgian TV channel.\n\nShe told BBC News: \"I feel very surprised at how smug he looks to be honest.\n\n\"It just shows a very arrogant man.\n\n\"I don't understand how someone can go on the run for two crimes and be found guilty and still then just walk straight in with a very smug look on his face and claim innocence. It's unbelievable.\"\n\nWearing a long coat, jeans and a checked scarf, he smiled and waved for cameras as he walked into a police station on Wednesday.\n\nA spokesman for the country's embassy in London said that Shepherd had surrendered to the police.\n\nHome Secretary Sajid Javid, who a day earlier warned \"there can be no hiding place\" for Shepherd, celebrated his arrest.\n\n\"We will seek to swiftly extradite him to Britain. It is vital Charlotte Brown's family see justice done,\" he added.\n\nGeorgian law states that extradition is granted over convicted individuals if they have been sentenced to at least four months' imprisonment.\n\nWhile Shepherd was on the run from the law, his lawyers have been working to appeal against the conviction.\n\nSolicitor Richard Egan: \"In the light of today's developments I don't think it would be appropriate to comment further until Mr Shepherd is back in the jurisdiction.\"\n\nMs Brown died in December 2015 after being thrown from Shepherd's speeding boat.\n\nThis happened during a champagne-fuelled late-night jaunt past the Houses of Parliament and Shepherd's Old Bailey trial heard that he had met Ms Brown on a dating website.\n\nThe court was told he had been trying to impress her at the end of their first date at the Shard.\n\nAfter handing her the controls, the boat hit a submerged log and capsized, sending Ms Brown into the cold water.\n\nShepherd was rescued, having been found clinging to the upturned hull, while his date was recovered unconscious.",
    "author": "Jacob Jarvis",
    "url": "https://www.standard.co.uk/news/crime/speedboat-killer-latest-family-of-charlotte-brown-speak-of-overwhelming-emotion-as-they-react-to-a4047211.html",
    "published": "2019-01-23 19:39:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}