{
    "data_id": "165784",
    "id": "eveningstandard--2019-02-22--Aaron Campbell 16 named for first time as Alesha MacPhailaposs killer as judge lifts anonymity",
    "date": "2/22/2019",
    "source": "eveningstandard",
    "title": "Aaron Campbell, 16, named for first time as Alesha MacPhail&apos;s killer, as judge lifts anonymity on boy who carried out &apos;bestial&apos; murder",
    "content": "The “evil” 16-year-old boy who raped and murdered young Alesha MacPhail in a crime that shocked the nation has been unmasked as Aaron Campbell.\n\nThe teenager is facing life behind bars for brutally killing the six-year-old girl after snatching her from her bed during a holiday to her grandparents' on the Scottish isle of Bute.\n\nCampbell was found guilty of murder yesterday, and will be sentenced next month for the \"bestial\" crime which is believed to have been inspired by the Slender Man horror character.\n\nToday Judge Lord Matthews agreed that Campbell’s name and picture could be published for the first time, after an appeal by media organisations to end his anonymity.\n\nHe said: \"I can't think of a case in recent times that has attracted such revulsion.\n\n\"I intend to grant the application. The press may name the accused and publish images of him.\"\n\nFollowing yesterday’s guilty verdict, the judge said Campbell had committed “some of the most wicked and evil crimes this court has ever heard of in decades of dealing with depravity”.\n\nThe judge added that he still has “no idea” of the motive for the murder, which prosecutor Iain McSporran QC has described as “bestial”.\n\nAlesha was snatched by Campbell as she slept on July 2 last year, inflicting horrific injuries, raping the young girl, and then dumping her lifeless body in woodland.\n\nDuring the trial, Campbell cruelly tried to pin the blame on Alesha’s father’s girlfriend, who was forced to deny in court having anything to do with the shocking crime.\n\nUltimately jurors took just three hours at High Court in Glasgow to find Campbell unanimously guilty.\n\nIn a statement issued by Police Scotland, Alesha's family said: \"We can't believe that we will never see our wee angel Alesha again. We miss her so much.\n\n\"We hope that the boy who took her from us is jailed for a long time because of what he has done to our family.\"\n\nCampbell has been warned he may never again be free from prison, and he will be sentenced on March 21.",
    "author": "Tristan Kirk",
    "url": "https://www.standard.co.uk/news/crime/judge-lifts-ban-on-naming-killer-of-sixyearold-alesha-macphail-a4074116.html",
    "published": "2019-02-22 13:24:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}