{
    "data_id": "169190",
    "id": "eveningstandard--2019-03-23--Nashon Esbrand murder Brother of Islington stab victim calls for London communities to apostake r",
    "date": "3/23/2019",
    "source": "eveningstandard",
    "title": "Nashon Esbrand murder: Brother of Islington stab victim calls for London communities to &apos;take responsibility&apos; for knife crime &apos;disease&apos; as killer is jailed",
    "content": "A gangs co-ordinator whose brother was hunted and stabbed to death in north London today called for communities to \"take responsibility\" for the capital's knife crime \"disease\" after one of his killers was jailed for life.\n\nMark Barton made the plea after Jack Stevens, 19, was sentenced to life with a minimum 23 years after he was found guilty of murdering new father Nashon Esbrand in Islington in August 2017.\n\nStevens was the ringleader of a gang which was captured on CCTV chasing Mr Esbrand, 27, on bicycles. Mr Esbrand was eventually cornered just yards from his parents' house when another teen stabbed him to death with a machete-style blade.\n\nStevens fled the country after the murder but was extradited from Spain last summer and brought to justice at the Old Bailey. Three of his accomplices have already been jailed over the murder.\n\nGangs co-ordinator Mr Barton told the Standard after the sentencing: \"It’s pure relief. It took a year to find him and nearly a year to convict. It’s satisfying as he was the ringleader. He showed no remorse at all.\n\n\"There was a lot of family in court. This brought the sadness back again. But we will keep fighting for Nashon by doing something positive. We are going to do a ‘happy Nash day’ community event every August 25, the day of his death.\"\n\nBut Mr Barton added: \"It’s still raw. I wish I was there to protect him.\n\n\"And there have been so many murders and stabbings since that day.\n\n“These people have no appreciation for life, and no appreciation for themselves. It’s a disease in our communities that needs to be sorted. It’s not just on the police: communities need to get together and take responsibility.\n\n“I will continue to support young people. I don’t want to see families go through what we went through with Nashon.\"\n\nOn August 24, 2017, Mr Esbrand and his girlfriend were walking down Essex Road with their baby, Milla, who was born nine days before.\n\nMinutes after they parted company, Mr Esbrand was spotted by Stevens and Dillon Zambon, then aged 18 and 19. They targeted him because Mr Esbrand had previously spoken to police about another incident.\n\nStevens and Zambon chased Mr Esbrand back up Essex Road and enlisted the help of three other youths: Jhon Berhane, then aged 17, a 15-year-old boy who cannot be named and another male who has not been indentified.\n\nThey cornered Mr Esbrand in Mitchison Road before the 15-year-old stabbed him in the legs, causing fatal blood loss. One of the wounds was 17.5cm in depth and he died the following day. It happened in a doorway a few doors down from his parents’ house.\n\nIn June last year, Zambon and Berhane were both sentenced to life, with the 15-year-old given 12 years. All three were convicted of murder.\n\nThree to four weeks after the murder, Stevens fled the UK in the boot of a car travelling to Belgium, from which he travelled to Spain. He was extradited to the UK in August last year after the Met obtained a European Arrest Warrant.\n\nA jury found Stevens guilty of murder earlier this month and he was sentenced on Friday.\n\nJudge Anuja Dhir said Stevens showed a \"chilling lack of remorse\" and told him: \"Without you this senseless murder would not have taken place.\"",
    "author": "James Morris",
    "url": "https://www.standard.co.uk/news/crime/nashon-esbrand-murder-brother-of-islington-stab-victim-calls-for-london-communities-to-take-a4097786.html",
    "published": "2019-03-23 07:45:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}