{
    "data_id": "1696",
    "id": "abcnews--2019-10-18--Charges: Cemetery killer booby-trapped home to target police",
    "date": "10/18/2019",
    "source": "abcnews",
    "title": "Charges: Cemetery killer booby-trapped home to target police",
    "content": "A Wisconsin man charged with killing one person and wounding two others at a cemetery where he once worked rigged his apartment and a house next door with explosives that could have killed police and neighbors, prosecutors said Friday.\n\nHenry West, of Schofield, appeared Friday in court, where his cash bond was set at $10 million.\n\nWest, 64, is charged with one count of first-degree intentional homicide, 11 counts of attempted first-degree intentional homicide, one count of arson, three counts of attempted arson and resisting or obstructing an officer, the Wausau Daily Herald reported.\n\nAuthorities say he opened fire Oct. 3 at Pine Grove Cemetery in Wausau. Patty Grimm, the 52-year-old cemetery manager, was killed and two other people were wounded.\n\nPolice say West was fired from the cemetery in 2012.\n\nTwo days before the shooting and fire, a judge ordered West evicted from his apartment, according to court records.\n\nAccording to the criminal complaint, when police entered West's apartment after the attack, they found a toaster plugged into a timer sitting next to a container of what appeared to be oil. Another toaster in the apartment was stationed next to a container of gasoline, the complaint said. Police also found two other 1 gallon (3.79 liter) jugs of gasoline and several other containers of incendiary liquids in the home.\n\nAccording to prosecutors, West also set an explosive trap in a house next to his apartment building that could have killed as many as 100 people if it had detonated.\n\nAbout 15 minutes before the shootings, a fire broke out in a garage at West's apartment complex, which was less than 2 miles (3.2 kilometers) from the cemetery.\n\nWhile emergency crews were investigating the garage fire, they responded to a gas leak at a vacant home next door. Police said they also found primitive explosive devices there while ventilating the house.\n\nHad it ignited, the gas leak would have been enough to kill up to 100 people, including police, nearby residents and anyone at neighboring businesses, according to the complaint.\n\nWest is due back in court Nov. 21. His public defender did not immediately reply to a phone message from The Associated Press on Friday seeking comment on West's behalf.",
    "author": "",
    "url": "https://abcnews.go.com/US/wireStory/charges-cemetery-killer-booby-trapped-home-target-police-66378352",
    "published": "Fri, 18 Oct 2019 17:56:27 -0400",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}