{
    "data_id": "169943",
    "id": "eveningstandard--2019-04-02--Nipsey Hussle murder Suspected killer Eric Holder arrested in LA days after rapper is fatally shot",
    "date": "4/2/2019",
    "source": "eveningstandard",
    "title": "Nipsey Hussle murder: Suspected killer Eric Holder arrested in LA days after rapper is fatally shot",
    "content": "Nipsey Hussle’s suspected killer has been arrested after a days-long manhunt following the fatal shooting of the rapper.\n\nEric Holder, 29, had been on the run for two days before he was arrested in Bellflower, Los Angeles, about 20 miles from where the musician was killed.\n\nHe was detained first by sheriff's deputies until LA Police arrived and confirmed he was wanted over Hussle's killing.\n\nIt was not immediately clear how authorities located the suspect, but a statement posted on LAPD HQ's social media thanked the \"community for the heightened awareness/vigilance\".\n\nIt read: \"Eric Holder, the suspected killer of Nipsey Hussle, has been arrested and is in police custody. Thank you to both our community for the heightened awareness/vigilance, and our partners at @LASDHQ.\"\n\nOfficers had released Holder's name and photo on Monday and asked for the public's help in finding him.\n\nPolice Chief Michel Moore told the Associated Press Hussle and Holder knew each other and are thought to have had some kind of personal dispute in the hours before the rapper was killed.\n\nThe 33-year-old musician was shot and killed outside his clothing shop on Sunday. Two other people were shot but survived, the Los Angeles Police Department said.\n\nA post-mortem examination found Hussle was killed by gunshots to the head and torso, according to the Los Angeles County Department Medical Examiner-Coroner.\n\nThe death was certified as a homicide, the coroner added.\n\nBeyonce was among those to pay tribute to Hussle, who was nominated for the best rap album Grammy earlier this year for Victory Lap.\n\nShe shared a childhood picture of Hussle to Instagram, along with the caption: \"I'm praying with every ounce of my heart for your family. Rest In Peace, Nipsey.\"",
    "author": "Sean Morrison",
    "url": "https://www.standard.co.uk/news/world/nipsey-hussle-murder-suspected-killer-eric-holder-arrested-in-la-days-after-rapper-is-fatally-shot-a4107736.html",
    "published": "2019-04-02 22:29:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}