{
    "data_id": "171047",
    "id": "eveningstandard--2019-04-09--Crossbow killer plotted murder of ex-wife for more than a year Old Bailey hears",
    "date": "4/9/2019",
    "source": "eveningstandard",
    "title": "Crossbow killer plotted murder of ex-wife for more than a year, Old Bailey hears",
    "content": "A man shot dead his heavily pregnant ex-wife with a crossbow in a “violent revenge” murder he had been plotting for more than a year, the Old Bailey was told today.\n\nRamanodge Unmathallegadoo, 51, was armed with two crossbows, a hammer and a knife, as well as cable ties and duct tape when he burst out of the garden shed at the home of his 35-year-old ex-wife Sana Muhammad, it was said.\n\nHe wanted to kill both his ex-wife and her new husband Imtiaz Muhammad, it is alleged, but was disturbed as he lay in wait for the perfect time to strike.\n\nThe jury was told Unmathallegadoo went for the “principal target” of Ms Muhammad, who was eight months pregnant, allegedly waiting until he had her “in his sights” before firing the crossbow bolt into her chest and piercing her heart. She was killed but her unborn son was saved by doctors.\n\nProsecutor Peter Wright QC said Unmathallegadoo had been plotting the attack on November 12 last year for more than a year, carrying out surveillance on his ex-wife’s new home in Ilford and identifying the shed as the ideal place to hide.\n\nHe said Unmathallegadoo had stashed a “cache of weaponry”, including two crossbows near to the house prior to March last year, but they were accidentally stumbled upon by a neighbour and he had to replenish his stock before carrying out the killing.\n\nMr Wright told the court Unmathallegadoo had wed Ms Muhammad, also known as Devi, in an arranged marriage when she was 16, but the union had broken down by 2012.\n\nHe said: “This was a deliberate and quite calculated act of revenge on his part, intended to cause at the very least the death of Devi and the extinction of the child she carried.”\n\nHe went on: “For at least a year he had been making preparations for an attack upon Devi and Imtiaz. The attack that took place on the morning of November 12, 2018 was the culmination of a series of acts carried out by him, all of which were calculated to ensure a successful outcome to what was to be a devastating and murderous attack as an act of revenge on his former wife and her new partner.” He added: “The disintegration of his marriage had had a profound effect upon him and his life which eventually led to a deeply held desire for a most violent revenge.”\n\nThe jury heard that on the morning of the shooting, Unmathallegadoo, a former site manager at Newham General Hospital, had taken up an “ideal vantage point” in the garden shed where he could watch the house.\n\nHowever Unmathallegadoo was disturbed in the shed at about 7.30am by Mr Muhammad and “had to seek to execute his plan as best he could”, running past him in search of his ex-wife, it was said.\n\n“Imtiaz then ran through the back door which led to the kitchen, shouting for Devi to run,” said Mr Wright. “The two ran from the kitchen into the corridor which led to the front door, with the defendant in close pursuit. Devi turned and ran up the stairs, whereas Imtiaz ran out of the front door.\n\n“Imtiaz saw the defendant, who was at the bottom of the stairs, shoot Devi who was halfway up the stairs. The effect on her was immediate and she fell to the floor.”\n\nMr Wright said Unmathallegadoo later told a police officer he had shot his ex-wife by accident while aiming at Mr Muhammad.\n\nBut Mr Wright said: “If he wasted his first bolt on Imtiaz he may not succeed with his one remaining loaded crossbow to kill his principal target Devi. That, we say, is the reason why he did not shoot at Imtiaz in advance of the successful attack upon Devi.”\n\nUnmathallegadoo, of no fixed address, denies murder and attempted child destruction. The trial continues.",
    "author": "Tristan Kirk",
    "url": "https://www.standard.co.uk/news/crime/crossbow-killer-plotted-murder-of-exwife-for-more-than-a-year-old-bailey-hears-a4113101.html",
    "published": "2019-04-09 11:16:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}