{
    "data_id": "177686",
    "id": "eveningstandard--2019-06-24--Cyprusaposs aposfirst serial killerapos admits three-year murder spree",
    "date": "6/24/2019",
    "source": "eveningstandard",
    "title": "Cyprus&apos;s &apos;first serial killer&apos; admits three-year murder spree",
    "content": "An army captain today pleaded guilty to killing five women and two children during a three-year murder spree which the authorities stumbled across by accident.\n\nNikos Metaxas, 35, was led into a Nicosia court under heavy security and stared at the ground as a prosecutor read out a string of charges, including kidnapping and the killings of five women and two of their daughters, age six and eight, from the Philippines, Romania and Nepal.\n\nMetazas, who is believed to be Cyprus’s first serial killer, broke down in tears as the indictment was read.\n\n“Cypriot society will be wondering how one of its members reached this point. I have also asked myself why; I have not yet managed to find an answer,” he said.\n\nPolice say Metaxas met the women online. The victims were mostly employed as housekeepers on the island and disappeared between September 2016 and August 2018.\n\nThe case triggered outrage and horror on an island where serious crime is relatively rare.\n\nThe police chief was sacked and the justice minister resigned following accounts of bungled investigations by police who did not take the disappearances seriously because the women were foreign.\n\nThe first victim was found dead by tourists shooting pictures at a mining shaft in late April, unravelling the macabre killing spree. The last victim discovered, the six-year-old child, was found in a lake on June 12. Sentence was expected to be passed later today with Metaxas facing seven life terms.",
    "author": "MIchael Howie",
    "url": "https://www.standard.co.uk/news/world/cypruss-first-serial-killer-admits-threeyear-murder-spree-a4174531.html",
    "published": "2019-06-24 10:30:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}