{
    "data_id": "183968",
    "id": "eveningstandard--2019-09-06--Killer who fled to Cyprus after frenzied attack in south London gym is found guilty of murder",
    "date": "9/6/2019",
    "source": "eveningstandard",
    "title": "Killer who fled to Cyprus after frenzied attack in south London gym is found guilty of murder",
    "content": "A killer who stabbed a new father to death before fleeing the country and living under a false name in northern Cyprus was today facing life in jail.\n\nCharles Riddington, 37, was arrested on the island last August, nearly two years after the frenzied attack on George Barker, 24, at a gym in Bexley.\n\nRiddington, who was said to be friends with ex-footballer Jamie Redknapp, had accused Mr Barker of “going behind his back” over a drugs debt before punching him and stabbing him 17 times, as people with Riddington warned terrified onlookers “not to get involved”. At the Old Bailey yesterday he was found guilty of murder, after admitting possession of a stun gun and CS spray at the start of the trial. He was found not guilty of possession of an offensive weapon.\n\nThe day after the killing, on November 14, 2016, Riddington had flown from Manchester airport to Dusseldorf, the court heard. A European Arrest Warrant was issued, but police discovered he had been living under the alias Barry Ryan for 10 years and found the stun gun and CS spray at addresses he had used.\n\nWhen he was arrested in northern Cyprus following a local investigation he was found with a Namibian passport under the name Ricky de Bruin. He was deported to southern Cyprus and later returned to the UK.\n\nWitnesses told police that Riddington and Mr Barker, whose partner had given birth to their daughter five days before his death, had previously trained together at the Double K gym.\n\nOn the day of the killing Riddington had been talking with the gym owner about a possible TV collaboration with Mr Redknapp. During the trial, Riddington said he spent the day before the stabbing at Mr Redknapp’s house, as they celebrated the Sky Sports pundit’s son’s birthday.\n\nRiddington, formerly of Orpington, will be sentenced on September 20.",
    "author": "Liam Coleman",
    "url": "https://www.standard.co.uk/news/crime/killer-who-fled-to-cyprus-after-frenzied-attack-in-south-london-gym-is-found-guilty-of-murder-a4230761.html",
    "published": "2019-09-06 10:21:02+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}