{
    "data_id": "1839",
    "id": "abcnews--2019-11-01--St. Louis, KC seek tougher gun laws amid violence uptick",
    "date": "11/1/2019",
    "source": "abcnews",
    "title": "St. Louis, KC seek tougher gun laws amid violence uptick",
    "content": "A bill requiring St. Louis gun dealers to alert police when a firearms purchase is denied because of a criminal background check is the latest step in addressing violence in a city beset by gun crimes.\n\nSt. Louis aldermen unanimously gave final approval to the bill Friday. Supporters say 30% of criminals who try to purchase guns but fail to do so because of background checks are arrested within five years. The bill awaits Democratic Mayor Lyda Krewson's signature.\n\nMissouri's big cities, St. Louis and Kansas City, have among the highest homicide rates in the nation. Both are seeking to address the problem through tougher local gun laws since statewide legislation is unlikely in the conservative-led state, where Republican Gov. Mike Parson has pledged \"to protect the rights of the Second Amendment for law-abiding citizens.\"\n\nA message left with Parson's office was not immediately returned Friday.\n\nIn St. Louis, where Parson assigned highway patrol officers to help fight crime in September, the situation is made more tragic by the fact that 13 of those killed in shootings this year were children, all of them black.\n\nSt. Louis aldermanic President Lewis Reed said the city law will help alert police to people with criminal records who are seeking guns.\n\n\"This is one more piece to the puzzle, and it's an important piece,\" Reed said. \"We're no longer going to wait for the state to do the right thing, or the federal government to do the right thing.\"\n\nIt wasn't immediately clear if the attorney general's office in Missouri would challenge the law on grounds that it conflicts with state law. A spokesman for Attorney General Eric Schmitt declined comment, saying the office had not seen details.\n\nAnother St. Louis measure under consideration would designate the city's parks as child care facilities so they're exempt from a Missouri law allowing people to carry concealed firearms without permits and training. Signs explaining the gun prohibition would be posted at park entrances, parking areas, playgrounds and sports fields. Several St. Louis killings have happened at parks or near them.\n\nChild cares, churches, hospitals and some other places can ban the carrying of guns under state law. But parks are not on the list.\n\nIn Kansas City, the City Council approved two laws aimed at keeping guns away from children. One of the laws, passed in August, makes it a local offense for minors to have handguns. The other prohibits adults from recklessly giving minors guns without their parents' permission.\n\nLast week, Democratic Kansas City Mayor Quinton Lucas proposed an ordinance that would allow police to take firearms from domestic violence offenders or those who are the subject of restraining orders. A similar federal law exists but backers say a local law would help police and prosecutors pursue the cases.\n\nSt. Louis has had 165 homicides in 2019 and is on pace to top last year's total of 186. In Kansas City, 122 homicides have occurred this year, and the city is on pace to top last year's 138 killings.",
    "author": "",
    "url": "https://abcnews.go.com/US/wireStory/st-louis-kc-seek-tougher-gun-laws-amid-66694945",
    "published": "Fri, 01 Nov 2019 17:11:56 -0400",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}