{
    "data_id": "185174",
    "id": "eveningstandard--2019-09-23--Joshua Boadu murder Family shares anguish after killers convicted following Bermondsey stabbing",
    "date": "9/23/2019",
    "source": "eveningstandard",
    "title": "Joshua Boadu murder: Family shares anguish after killers convicted following Bermondsey stabbing",
    "content": "A devastated family has spoken of its “heartache and emotional anguish” after their son’s two killers were today convicted of murder at the Old Bailey.\n\nJoshua Boadu, 23, also known as SJ, was killed last year after a brutal stabbing.\n\nHe was attacked in broad daylight in Bermondsey, south London, on the evening of June 11.\n\nMr Boadu managed to flee from his assailants to a nearby home, where emergency services were called.\n\nBut the 23-year-old suffered a heart attack on the way to hospital and his life support was turned off 10 days later.\n\nDenilson Davis, 21, and a 16-year-old boy - who cannot be named because of his age - will be sentenced next week.\n\nMr Boadu's family released a statement following the conviction. It read: \"Words cannot begin to describe how life has been since Josh's passing and he will be forever in our hearts.\n\n“Words cannot describe the heartache and emotional anguish this senseless killing has caused and the impact on the family has been astronomical.\n\n\"Josh had his whole life ahead of him and he was full of so much untapped potential but his life was cut short due to a vicious and senseless murder.\"\n\nIt went on: \"Things will never be the same for us and we have to live with this for the rest of our lives.\n\n\"Knowing Josh cannot celebrate another birthday or Christmas brings all the emotion back to us.\n\n“Things that ‘could have been’ are amongst the hardest of things to forget and move forward when you lose a child, brother, uncle and friend like Josh.\"\n\nThe killers drove to the site of the murder in a Peugeot with a third person who police are still hunting.\n\nWitnesses described how Mr Boadu was ambushed by the trio and tried to defend himself before running away.\n\nAfter the attack, the murderers fled in the car, and Davis and the boy later tried to call Mr Boadu on the phone.\n\nPolice later obtained footage of the killers in a \"celebratory mood\" in a Lewisham recording studio later the same evening.\n\nLess than a week after the attack, police officers noticed the Peugeot and saw the driver running away.\n\nDavis was arrested nearby, and his fingerprints - plus the DNA of the 16-year-old and Mr Boadu's blood - were all found in the car.\n\nA hunting knife and a mobile phone were recovered from the car, and Davis admitted they belonged to him.\n\nDet Insp Ian Titterrell said: “SJ was attacked in broad daylight on a Bermondsey estate, succumbing to his injuries several days later.\n\n“We have never been able to establish a motive for this senseless killing.\n\n\"A thorough police investigation by my team, not to mention some great work from borough officers who proactively stopped two cars which yielded vital evidence, has led to today's convictions.\n\n“While of course SJ's family remain devastated, I hope today's result brings them some comfort.\"",
    "author": "Tim Baker",
    "url": "https://www.standard.co.uk/news/crime/joshua-boadu-murder-family-shares-anguish-after-killers-convicted-following-bermondsey-stabbing-a4244461.html",
    "published": "2019-09-23 18:42:11+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}