{
    "data_id": "186222",
    "id": "eveningstandard--2019-10-09--Jodie Chesney murder trial: Girl scout stabbed by mistake after killer targeted &apos;wrong people&a",
    "date": "10/9/2019",
    "source": "eveningstandard",
    "title": "Jodie Chesney murder trial: Girl scout stabbed by mistake after killer targeted &apos;wrong people&apos;, court told",
    "content": "Jodie Chesney was stabbed in the back by mistake after her killer \"rid out on the wrong people\", according to the alleged getaway driver.\n\nManuel Petrovic, 20, is one of four youths jointly accused over the death of the popular 17-year-old Girl Scout in Amy's Park in Harold Hill on March 1.\n\nWhile on remand over the killing, Petrovic protested his innocence, saying he was only asked to drive to Harold Hill, and not told why.\n\nDuring a covertly recorded prison visit by two female friends on May 24, he said: \"I'm going to say I'm a drug dealer, I broke the law with my driving and s***. I'm not into murder. I ain't going to go guilty for something I have not done. I'm no murderer.\"\n\nDuring a second visit on August 3, Petrovic allegedly said to a friend that Jodie was stabbed after his co-defendant Svenson Ong-a-Kwie was \"cheffed\".\n\nAccording to a transcript of the conversation read out in court, Petrovic said: \"They went to bang out on their ops and banged out the wrong people.\"\n\nAsked how he knew that, Petrovic replied: \"Uh? Because I know that ... It was to do with Svenson's op - they cheffed him up a couple of month or something, a couple of months before.\n\n\"Someone give him the drop, he went to ride out and rid out on the wrong people in the park and they thought it was them because they chill in that area.\n\n\"That's why she got it from behind.\"\n\nAsked where the tip-off came from, Petrovic replied: \"They got their drop their self bruv. Because they were in a cab in Harold Hill when they text me saying 'ring me, ring me asap, need to come and see you asap'.\"\n\nDuring the conversations in prison, Petrovic also talked of his hope to \"bust the case\".\n\nHis friend told him he should \"take this opportunity\" if he got off the charge and take a \"nine to five job\".\n\nPetrovic denies murder along with Ong-a-Kwie and two youths aged 16 and 17, from east London.\n\nJurors were told of an incident before Jodie's death in which Ong-a-Kwie was found with a makeshift bandage around his left thigh.\n\nThe defendant was said to have been vague about it, saying: \"Basically, this is what happened. They pulled up here in a car, jumped out and stabbed me in the leg.\"\n\nThe court heard Petrovic had convictions dating back to 2013 including for possession of cannabis and handling stolen goods.\n\nOng-a-Kwie had pleaded guilty to possession of class A and B drugs when he was 16 years old.\n\nHe also had a conviction for the supply of cocaine and having stolen goods, jurors were told.\n\nAccording to agreed facts read to court, the 17-year-old defendant, then aged 14, had been involved in an incident in a shop in which a member of staff was attacked with a screwdriver.\n\nThe youth went on to plead guilty to assault occasioning actual bodily harm and possessing a pointed article.\n\nThe trial was adjourned until Friday when the defence is due to start.\n\nNew: Daily podcast from the Evening Standard\n\nListen and subscribe to The Leader on Apple Podcasts, Spotify, Acast or your chosen podcast provider. New episodes every weekday from 4pm.",
    "author": "Bonnie Christian",
    "url": "https://www.standard.co.uk/news/crime/jodie-chesney-murder-trial-girl-scout-stabbed-by-mistake-after-killer-targeted-wrong-people-court-a4257836.html",
    "published": "Wed, 09 Oct 2019 18:23:23 GMT",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}