{
    "data_id": "188484",
    "id": "eveningstandard--2019-11-08--Sister of murdered schoolgirl Jodie Chesney tells killers: &apos;Hang your heads in shame&apos;",
    "date": "11/8/2019",
    "source": "eveningstandard",
    "title": "Sister of murdered schoolgirl Jodie Chesney tells killers: &apos;Hang your heads in shame&apos;",
    "content": "The sister of murdered schoolgirl Jodie Chesney told the killers who now face life in prison to “hang their heads in shame” for stealing the 17-year-old’s bright future.\n\nLucy Chesney, 20, broke down in tears at the Old Bailey yesterday as Svenson Ong-a-Kwie, 19, and a 17-year-old boy were found guilty of murdering her younger sister.\n\nThe pair had stabbed Jodie in the back as she sat with friends at Amy’s Park, Harold Hill.\n\nFollowing the verdicts, Lucy said: “Jodie will be greatly missed and the people who caused such tragedy ... should hang their head in shame.”\n\nShe added: “You have ripped away a bright future that was destined to make a change to many lives.”\n\nJodie, an A-Level student and Girl Scout, died on March 1 shortly after being stabbed. Her boyfriend, who witnessed the murder, said he saw the taller man — said to be Ong-a-Kwie — reach upwards and then stab Jodie.\n\nThe killers fled, leaving Jodie’s friends to desperately call for help.\n\nBoth teenagers were drug dealers and detectives have suggested the stabbing may have been a botched attack on a rival drug operation, mistaking Jodie for another dealer.\n\nCo-defendants Manuel Petrovic, 20, and a 16-year-old boy, were also accused of murder and were acquitted by the jury yesterday, after almost six hours of deliberations.\n\nJudge Wendy Joseph QC will sentence the killers on November 18, but has warned them they will be handed life sentences.",
    "author": "Tristan Kirk",
    "url": "https://www.standard.co.uk/news/crime/sister-of-murdered-schoolgirl-jodie-chesney-tells-killers-hang-your-heads-in-shame-a4282071.html",
    "published": "Fri, 08 Nov 2019 10:11:00 GMT",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}