{
    "data_id": "189604",
    "id": "eveningstandard--2019-11-18--Jodie Chesney: Dramatic moment police swoop on east London house and arrest teen&apos;s killers",
    "date": "11/18/2019",
    "source": "eveningstandard",
    "title": "Jodie Chesney: Dramatic moment police swoop on east London house and arrest teen&apos;s killers",
    "content": "Video footage shows the dramatic moment Jodie Chesney's killers were arrested in a Dagenham garden after one of them fell through a roof.\n\nDrug dealer Svenson Ong-a-Kwie, 19, and his 17-year-old runner Arron Isaacs were involved in a \"tit-for-tat vendetta\" with rivals when they killed Jodie by mistake.\n\nThe popular 17-year-old student had been relaxing with friends in Amy's Park in Harold Hill, east London, on the evening of March 1 when two shadowy figures emerged from the dark and one knifed her in the back.\n\nShe screamed and collapsed in the arms of her boyfriend, Eddie Coyle, 18, as her attackers made off in a fellow drug dealer's car.\n\nSvenson Ong-a-Kwie, 19, burnt his clothes and disposed of the knife he used to stab the Girl Scout immediately after the attack.\n\nHe had been lying low at the home of 17-year-old Arron Isaacs' uncle in Dagenham, east London, when police swooped to arrest them both on the evening of March 10.\n\nWhen police arrived, they heard a commotion outside and an officer shouted: \"Around the back.\"\n\nIn police body-worn video, Ong-a-Kwie can be seen clambering over a rear flat roof and crashing into the conservatory below.\n\nAn officer shouted: \"Stay where you are. Show me your hands now. Get over here now.\"\n\nAs he was handcuffed, an officer confirmed to colleagues that he was \"detained\".\n\nWhen told he was arrested on suspicion of murder, Ong-a-Kwie said: \"What? Murder? I killed no-one.\"​\n\nMeanwhile, Isaacs had escaped through a window but was apprehended in the back garden with a rucksack containing a deadly Rambo-style knife.\n\nHe was initially arrested on suspicion of assisting an offender but later also charged with Jodie's murder.\n\nThe footage was released by the Metropolitan Police as Ong-a-Kwie was jailed for at least 26 years and Isaacs was locked up for at least 18 years for their part in Jodie's death.​",
    "author": "Luke O'Reilly",
    "url": "https://www.standard.co.uk/news/crime/dramatic-moment-police-swoop-on-east-london-house-and-arrest-jodie-chesneys-killers-a4290051.html",
    "published": "Mon, 18 Nov 2019 17:49:00 GMT",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}