{
    "data_id": "189602",
    "id": "eveningstandard--2019-11-18--Jodie Chesney killers jailed: Teenagers sentenced to total of 44 years for murdering schoolgirl in e",
    "date": "11/18/2019",
    "source": "eveningstandard",
    "title": "Jodie Chesney killers jailed: Teenagers sentenced to total of 44 years for murdering schoolgirl in east London",
    "content": "The two teenagers convicted of killing schoolgirl Jodie Chesney in east London have been jailed for a total of 44 years.\n\nDrug dealer Svenson Ong-a-Kwie, 19, from Romford ​has been jailed at the Old Bailey for life with a minimum term of 26 years.\n\nWhile 17-year-old Arron Isaacs from Barking was locked up for at least 18 years for his part in Jodie’s murder.\n\nIsaacs was previously not named however, the reporting restrictions have now been lifted by the court.\n\nBoth were sentenced today after being found guilty of murder at the Old Bailey on November 7.\n\nIn her sentencing, Judge Wendy Joseph QC told the court Jodie’s death, which led to a “world of anguish” for her family, came amid “tit for tat” incidents.\n\nShe said Jodie was the victim of “callous, casual and irresponsible violence” which had shocked the community “to the core”.\n\nThe defendants had gone to Amy’s Park for a “planned attack on a rival group” and mistook their target.\n\nJudge Joseph told the court that Jodie was a “bright, warm and loving girl” who “should have led a happy and fulfilled life\".\n\n“Above all those who loved Jodie will never get over her death,\" she said.\n\nAddressing the defendants the judge added: “I’ve heard from them no word of true remorse and no true explanation.”\n\nOn the evidence, she found Ong-a-Kwie was the stabber and the 17-year-old his “enthusiastic supporter”.\n\nThe judge lamented the impact of criminals that had “carved up areas of the capital of this country”.\n\n“The dangers this brings to decent law-abiding members of the public is graphically spelled out in this case,\" she added.\n\nJudge Joseph said she \"entirely rejected\" the suggestion Jodie was mistaken for a rival drug dealer called Jade.\n\n\"The killing is far more sinister and dangerous than that,\" she added.\n\nJodie, 17, was attacked on the evening of March 1 as she sat with friends in Amy's Park in Harold Hill, east London.\n\nThe court heard how Ong-a-Kwie had convictions for possessing and supplying drugs.\n\nHe admitted being in breach of a six-week suspended sentence for handling stolen jewellery dating back to October last year.\n\nThe 17-year-old defendant had previous convictions for possessing a screwdriver, actual bodily harm, possession of cannabis as well as aggravated vehicle taking.\n\nTwo others, Manuel Petrovic, 20, and a 16-year-old, both from Romford, were cleared by the jury.\n\n'This nightmare will never leave me'\n\nDuring the hearing Crispin Aylett QC read out victim impact statements from a number of Jodie's family.\n\nJodie's nan Christine Chesney wrote: \"Since the evening of 1 March, my life has been turned upside down, and it will never be the same again. When I got the phone call to say what had happened to Jodie, I could not believe what I was hearing and it still feels like a dream. However, this nightmare is unfortunately real.\n\n\"Jodie was my youngest granddaughter, but she was more like a daughter to me. Since Jodie was very young, I helped her dad Peter in raising her and I would see her every day. Jodie would also ring me multiple times a day about anything and everything, so we were always in touch.\n\n\"Not seeing Jodie and hearing her voice on a daily basis has broken my heart. I struggle to sleep; I struggle to eat and my health has deteriorated. For the rest of my life, that night will not leave my mind. I will play that night over in my mind repeatedly, why didn’t Jodie come home that evening, why didn’t Jodie have an extra shift at work?\n\n\"I will feel guilt that she wasn’t with me that evening and I couldn’t do anything to help her.\n\n\"Jodie was murdered in March but this nightmare will never leave me. I will miss her every single day for the rest of my life and my life will never be the same again.\"\n\nJodie’s father Peter Chesney told how he had just got a job in the City as a salesman when his life was “destroyed”.\n\nFrom being ready to “take on the world” with a promising career, he was instead sitting in a cabin in his garden, writing a victim impact statement.\n\nMr Chesney said: “I have lost the most precious human being I will ever know. I have no idea how I’m going to continue my life or come to terms with the loss.\n\n“I have a fantastic daughter Lucy and we are leaning on each other throughout this tragedy.”\n\nboyfriend Eddy Coyle also had his victim impact statement read out on his behalf in which he called he \"funny\" and \"silly\".\n\nHe wrote: “I’ve never lost anyone before and for the first funeral I’ve gone to, to be my own girlfriend’s is incredibly hard. I loved her.”\n\nJodie’s sister Lucy Chesney added in a statement: “Losing her is like losing half of myself. We went through everything together and she was always there for me and always putting everyone before herself. She gave me a type of love I will never feel again.\n\n“Jodie will be greatly missed and the people who caused such tragedy to a whole family should hang their head in shame. You have ripped away a bright future that was destined to make a change to many lives.”",
    "author": "Bronwen Weatherby",
    "url": "https://www.standard.co.uk/news/crime/jodie-chesney-teenagers-convicted-of-murdering-schoolgirl-jailed-for-xx-a4289351.html",
    "published": "Mon, 18 Nov 2019 15:47:00 GMT",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}