{
    "data_id": "189603",
    "id": "eveningstandard--2019-11-18--Jodie Chesney&apos;s close family pay heartbreaking tribute to murdered teen as killers are jailed: ",
    "date": "11/18/2019",
    "source": "eveningstandard",
    "title": "Jodie Chesney&apos;s close family pay heartbreaking tribute to murdered teen as killers are jailed: &apos;Losing her is like losing half myself&apos;",
    "content": "Jodie Chesney’s close family paid heartbreaking tribute today as the 17-year-old's killers were jailed for life following convictions for murder.\n\nHer sister Lucy said in a statement that losing Jodie \"is life losing half of myself\", adding: \"I am dreading my life rather than looking forward to it.\"\n\nJodie’s cousin Kirsty revealed that the teenager’s nephew was born on the same day as the funeral. She said \"one of the happiest days of my life... was also one of the saddest.\"\n\nJodie's father Peter Chesney said: “The murder of my beloved daughter has destroyed my life and the full extent as to how this has affected my family and me cannot possibly be explained simply in words.\n\n“I have no idea how I am going to continue with my life or even come to terms with the loss.”\n\nHer sister Lucy added in an impact statement: “I am only 20 and already I am dreading my life rather than looking forward to it.\n\n“Jodie was not only my sister she was my best friend. Losing her is like losing half of myself. We went through everything together and she was always there for me and always putting everyone before herself.\n\n“She gave me a type of love I will never feel again.\"\n\nKirsty, Jodie’s cousin, said: “Jodie’s murder has affected my family and me in so many different ways. When she was killed, I was heavily pregnant with my son. This was meant to be a really happy time of my life but wasn’t.\n\n“I ended up giving birth on the day of Jodie’s funeral, so I didn’t get chance to say goodbye. One of happiest days of my life, giving birth to my son, was also one of the saddest, as it was the day we had to say goodbye to Jodie.\n\n“And every year on his birthday will be a reminder of another year since her funeral.\n\n“How are any of us supposed to get over something like this? The answer is we never will but we just have to learn to deal with it. Jodie will never be forgotten.”\n\nSpeaking outside the Old Bailey following the sentencing hearing, detective chief inspector Dave Whellams, from the Metropolitan Police, said the force was \"pleased and proud of these convictions\".\n\nHe paid tribute to Jodie's family who he said had been through a \"great ordeal\" and expressed hope they would now be able to find \"some form of closure\".\n\nSurrounded by Jodie's family members, detective inspector Perry Benton said the \"moving\" statements read in court had left \"a lot of people in tears\".\n\nSvenson Ong-a-Kwie was given a minimum of 26 years in prison, while Arron Isaacs was told he would spend at least 18 years behind bars.",
    "author": "Tim Baker",
    "url": "https://www.standard.co.uk/news/crime/jodie-chesneys-close-family-pay-heartbreaking-tribute-to-murdered-teen-as-killers-are-jailed-losing-a4290031.html",
    "published": "Mon, 18 Nov 2019 17:42:10 GMT",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}