{
    "data_id": "190202",
    "id": "eveningstandard--2019-11-22--Grace Millane killer found guilty of murdering British backpacker in New Zealand",
    "date": "11/22/2019",
    "source": "eveningstandard",
    "title": "Grace Millane killer found guilty of murdering British backpacker in New Zealand",
    "content": "A man has been found guilty of murdering British backpacker Grace Millane in New Zealand.\n\nThe killer stuffed her body in a suitcase, which was later found buried in bushland near Auckland.\n\nThe 27-year-old had claimed Ms Millane, from Wickford in Essex, died accidentally during \"rough sex\" after their Tinder date in December last year.\n\nBut jurors at Auckland's High Court on Friday found the defendant guilty of her murder following the two-week trial at Auckland High Court.\n\nThe decision, which came after about five hours of deliberation, was unanimous.\n\nThe killer stood emotionless, flanked by two corrections officers, as the verdict was read out.\n\nHe was remanded to custody until his sentencing on February 21.\n\nMs Millane's father, David Millane, and mother, Gillian Millane, wept after the verdict was delivered.\n\nThe couple have sat in the public gallery since the trial began on November 4, during which time they have been accompanied by Detective Scott Beard, who led the search for their daughter.\n\nMr Millane wept as he told reporters: \"The verdict of murder today will be welcomed by every member of the Millane family and friends of Grace.\n\n\"It will not reduce the pain and suffering we have had to endure over the past year.\n\n\"Grace was taken in the most brutal fashion a year ago and our lives have been ripped apart.\n\n\"Grace was our sunshine and she will be missed forever.\"\n\nAfter the date on December 1 last year, Ms Millane returned to the killer's hotel apartment and he strangled her to death either that night or in the early hours of the next morning - the date of her 22nd birthday.\n\nThe jury of seven women and five men returned a unanimous verdict after just five hours deliberation at Auckland High Court.\n\nThe Crown successfully argued the man, whose name is subject to a suppression order, strangled Ms Millane and shoved her body inside a suitcase before burying her in a forested area outside Auckland.\n\nMs Millane had been assumed missing and her father flew to New Zealand as local authorities spent a week searching until her body was found by police.\n\nJustice Simon Moore told jury members before they delivered their verdict that they had to be certain the man had murderous intent when he put his hands on Ms Millane's neck during sexual intercourse to convict him of murder.\n\nMr Moore asked: \"Are you sure that when he applied pressure to Ms Millane's neck... Did he intend to cause injury?\"\n\nHe further asked them to consider if the accused was willing to take the chance of Ms Millane dying due to his actions.\n\n\"If yes, then (the defendant) is guilty of murder,\" the judge said.\n\n\"In other words, (he) must have appreciated Ms Millane's death was a likely consequence... but was willing to run that risk.\"\n\nThe killer had claimed the death was accidental and occurred during rough sexual intercourse.\n\nHis defence told the court Ms Millane had an interest in BDSM, with a previous sexual partner testifying they had used safe words and physical tapping to indicate when physical pressure became overwhelming.\n\nDuring the trial, the jurors heard from forensic experts who examined the accused's apartment for blood stains as well as Ms Millane's body after her death.\n\nThey were also shown footage of the woman and the defendant drinking at various bars throughout Auckland and kissing before they returned to his apartment.\n\nVideo footage from the elevator of her exiting on the third floor marked the last recorded time Ms Millane was seen alive.\n\nPolice officers said phone data showed the killer had used Google to browse websites for large duffel bags, suitcases and car hire after Ms Millane died.\n\nThe defendant's phone was also used to search for \"flesh-eating birds\" and \"are there vultures in New Zealand?\".\n\nRecords showed the defendant had searched online for \"the hottest fire\", \"large bags near me\" and \"Waitakere Ranges\".\n\nMs Millane's killer faces life in prison with a minimum of 10 years without parole, though the judge can increase the latter period.​\n\nSpeaking after the guilty verdict was delivered, Ms Millane's father said: \"She did not deserve to be murdered in such a barbaric way during her gap year.\"\n\nHe acknowledged the efforts of New Zealand's police, Det Insp Beard and thanked the prosecution team and the media.\n\n\"Finally we want to thank the people of New Zealand. I can't thank you enough for our your kindness and for opening your hearts to us,\" Mr Millane said.",
    "author": "Sean Morrison",
    "url": "https://www.standard.co.uk/news/world/grace-millane-murder-trial-verdict-man-found-guilty-of-murdering-british-backpacker-while-on-tinder-a4293451.html",
    "published": "Fri, 22 Nov 2019 09:47:00 GMT",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}