{
    "data_id": "191380",
    "id": "eveningstandard--2019-12-04--London Bridge killer Usman Khan completed two untested counter-terror programmes before attack",
    "date": "12/4/2019",
    "source": "eveningstandard",
    "title": "London Bridge killer Usman Khan completed two untested counter-terror programmes before attack",
    "content": "London Bridge killer Usman Khan attended two counter-terror rehabilitation courses which had not been fully tested for their effectiveness, it emerged today.\n\nKhan, who was convicted of a terror offence in 2012, killed Jack Merritt, 25, and Saskia Jones, 23, during a conference on prisoner rehabilitation in Fishmongers’ Hall on Friday.\n\nKhan, 28, had completed two rehabilitation schemes during the eight years he spent in prison and following his release.\n\nThe first, the Healthy Identity Intervention programme, was piloted from 2010. A study last year found it was “viewed positively” but the Ministry of Justice had not tested whether it prevents reoffending.\n\nAfter his release last year, he took part in the Desistance and Disengagement scheme to help convicts “reintegrate safely” into society.\n\nThis was launched in 2016 and Government officials say neither programme has been operating long enough for their results to be assessed, the BBC reported.\n\nA spokesman said: “All our offender behaviour programmes are monitored, evaluated and kept under constant review to ensure that they are effective in reducing reoffending and protecting the public.”\n\nKhan injured three other people before being tackled by members of the public and shot dead by police.\n\nInquests into the deaths of Mr Merritt and Ms Jones were being opened at the Old Bailey today.",
    "author": "BENEDICT MOORE-BRIDGER",
    "url": "https://www.standard.co.uk/news/crime/london-bridge-killer-completed-two-untested-counterterror-programmes-before-attack-a4304286.html",
    "published": "Wed, 04 Dec 2019 11:24:00 GMT",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}