{
    "data_id": "193271",
    "id": "eveningstandard--2019-12-17--Prime suspect seized in hunt for killer of British tycoon Matthew Gibbard",
    "date": "12/17/2019",
    "source": "eveningstandard",
    "title": "Prime suspect seized in hunt for killer of British tycoon Matthew Gibbard",
    "content": "The suspected killer of British millionaire businessman Matthew Gibbard in Argentina was arrested as he tried to leave the country, police in the country said today.\n\nMr Gibbard, 50, was shot in the chest after being followed from the airport to his five-star hotel in Buenos Aires by motorcycle gangsters who are thought to have targeted him for his expensive watch.\n\nHis stepson, Stefan Zone, 28, reportedly a product manager at JP Morgan in London, was shot in the leg and is in a stable condition in hospital.\n\nFriends today told of their shock over Saturday’s attack. One told the Evening Standard: “It has just been traumatic. The family are devastated.”\n\nPolice apprehended the Venezuelan suspect, named locally as Angel Eduardo Lozano Azuaje, 21, in Salta, about 1,000 miles from the scene, on a coach bound for Bolivia.\n\nOfficers are understood to have been tipped off by his girlfriend during an interrogation.\n\nHe is the fifth person to be arrested over the robbery outside the £350-a-night Faena Arts Hotel. They include three Argentinians accused of supplying vehicles and the Venezuelan owner of a red Ford Fiesta which was said to have acted as a support vehicle.\n\nPolice said the gang would target wealthy holidaymakers wearing expensive watches at Ezeiza International Airport and follow their taxis to the city centre before carrying out robberies.\n\nChief of security for Buenos Aires, Marcelo D’Alessandro said: “This gang works in the arrivals hall of the airport, where they look for tourists coming from Europe and the United States. From there they begin their pursuit.”\n\nHe added: “They had a kind of placard, they would pretend to work for Uber.”\n\nMr Gibbard, from the village of Lowick, Northamptonshire, ran multimillion-pound holiday and retirement home firm Tingdene.\n\nHe is said to have been in Argentina for a Christmas break with his mother and wife Suzanne, 52, as well as Mr Zone and his stepson’s wife and brother. He was described by friends as a “softly spoken gentleman” who collected Ferraris and flew his own helicopter.",
    "author": "Gerard Couzens, BENEDICT MOORE-BRIDGER",
    "url": "https://www.standard.co.uk/news/crime/matthew-gibbard-shot-argentina-buenos-aires-a4315441.html",
    "published": "Tue, 17 Dec 2019 10:02:00 GMT",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}