{
    "data_id": "218",
    "id": "21stcenturywire--2019-03-29--Lawyers tasked with derailing internal Syrian peace process and the failure of international justic",
    "date": "3/29/2019",
    "source": "21stcenturywire",
    "title": "Lawyers tasked with derailing internal Syrian peace process and the failure of ‘international justice’",
    "content": "Historian John Laughland explains why the International Criminal Court’s attempt to indict President Assad of Syria reveals its dictatorial and warmongering tendencies.\n\nThe announcement that “a group of Syrian refugees and their London lawyers” have found “a neat legal trick” to press for an indictment against Syrian President Bashar Assad by the International Criminal Court demonstrates, yet again, the dangerous corruption of international justice, against which I have been warning for over a decade.\n\nThe Syrian war is nearly over, thanks to the military successes of the Syrian army and its Russian and Iranian allies. Exhaustion on both sides has probably helped. Diplomatic overtures have started to re-integrate Syria into the international system, starting at the regional level: the United Arab Emirates have re-opened their embassy in Damascus; the Sudanese president, Assad’s near namesake, Omar Al-Bashir, has visited Syria, as have senior Egyptian officials; Syrian officials have attended pan-Arab summits; even Israel is maintaining its dialogue with Russia over Syria. In short, the situation is being slowly normalised as Syria herself embarks on the painful search for internal peace.\n\nThe attempt to get Assad prosecuted is an attempt to stamp out these seedlings of peace before they take root. Any prosecution against Assad would scupper, or at least severely damage, this slow acceptance that the Syrian president is part of the solution. When even the British government has accepted that Assad is here to stay, and that peace must be made with him, his implacable enemies fear that their prize is about to slip out of their grasp. They do not want peace, if that means keeping Assad.\n\nWe know that the goal is to sabotage any peace process because this kind of indictment is old hat in international criminal law. At the end of the Bosnian Civil War in 1995, indictments were issued against the Bosnian Serb leaders, especially Radovan Karadzic, specifically in order to remove them from the Dayton peace talks. Antonio Cassese, then president of the International Criminal Tribunal for the former Yugoslavia, said in 1995, just after the indictment was issued against Karadzic, that it had been issued for that reason: “The indictment means that these gentlemen will not be able to participate in peace negotiations” (quoted in the Italian daily L’Unità, 26 July 1995). Incidentally, Cassese had himself encouraged the prosecutor to bring these prosecutions even though he, as a judge and president of the tribunal, was supposed to be neutral.\n\nThe “legal trick” is designed to overcome the fact that Syria is not a state party to the Rome statute of the International Criminal Court and therefore not subject to its jurisdiction. Assad’s enemies are seeking to sidestep the fact that Syria is beyond the ICC’s reach by seeking to apply to Syria a principle which, unfortunately, the ICC itself applied to Burma last year. In September, the ICC judges agreed that a case could be brought against Myanmar (Burma), even though that country is not a state party to the Rome statute, because the crimes it had allegedly committed – deportation – had caused people to flee into Bangladesh, which is a state party. By analogy, Syria’s enemies hope that the presence of Syrian refugees in Jordan, a state party to the ICC statute, will enable them to go after Assad. They seem not to care that this is the first time anyone has ever mentioned “deportation” in Syria, although Damascus has been accused of all manner of other crimes.\n\nThe ruling on Myanmar and Bangladesh illustrates everything that is wrong with international justice. Not only did the decision to apply jurisdiction to the Burmese authorities break the fundamental principles of international law, as expressed in the “treaty on treaties,” the 1969 Vienna Convention, which says that the principle of free consent is “universally recognized” and whose Article 34 says, “A treaty does not create either obligations or rights for a third state without its consent,” it also broke an even more fundamental principle by specifically claiming the right to define its own powers (referred to, in English texts, with the French and German expressions la compétence de la compétence and Kompetenz-Kompetenz). The Court described this as “a well-established principle of international law according to which any international tribunal has the power to determine the extent of its own jurisdiction.” In reality, it is no such thing.\n\nOn the contrary, the powers of all organisations are determined by law. Even sovereign governments are restricted by national laws in their powers. The idea that an international organisation has the legal right to determine its own powers, and to extend its jurisdiction to states that have not accepted it, is about as blatant a violation of the rule of law as one can imagine. In the past, such claims were equivalent to declarations of war, because a claim like this can only be settled by force. For example, on July 23 1914, Austria demanded the right for its police to carry out investigations inside Serbia for the assassination of the Archduke Franz-Ferdinand in Sarajevo on June 29. It sent an ultimatum to Belgrade to this effect, which Serbia refused. The result was the First World War, launched by Vienna in the name of the right to punish the perpetrators of that crime.\n\nThe ICC has already discredited itself massively after the Laurent Gbagbo fiasco. Having collaborated in the politically-motivated indictment of the president of Côte d’Ivoire in 2011 – a collaboration which gave legitimacy to the French military operation to oust him, just as it gave legitimacy to the NATO attack on Libya by also indicting Colonel Gaddafi at the same time – the Court was forced to acquit Laurent Gbagbo eight years later, in January of this year.\n\nBy seeking to extend its lamentable rule to Syria, and thereby to disrupt a barely embryonic peace there, the ICC risks destroying its reputation even further. For the rules limiting the jurisdiction of international organisations to states which have consented to accept them are not some arcane technicality of international law. Instead, they reflect the most basic principle of politics, which is that those who wield power need to be constitutionally linked to those over whom they wield it. International organisations which are not based on such consent violate that very basic principle flagrantly, and therefore start to resemble the very dictatorships they pretend to combat.",
    "author": "21wire",
    "url": "https://21stcenturywire.com/2019/03/29/lawyers-tasked-with-derailing-internal-syrian-peace-process-and-the-failure-of-international-justice/",
    "published": "2019-03-29 09:45:45+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}