{
    "data_id": "219140",
    "id": "freedombunker--2019-01-17--Watch a Florida Cop Botch a Drug Field Test on Video Then Arrest an Innocent Man",
    "date": "1/17/2019",
    "source": "freedombunker",
    "title": "Watch a Florida Cop Botch a Drug Field Test on Video, Then Arrest an Innocent Man",
    "content": "Body camera footage obtained by Reason appears to show a now-fired Florida sheriff's deputy blatantly lying about the results of a roadside drug test during a traffic stop last year.\n\nThe video shows the April 17, 2018, traffic stop of Florida resident Steve Vann by former Jackson County Sheriff's deputy Zachary Wester. Vann was subsequently charged with possession of methamphetamines and paraphernalia as a result of the traffic stop, but state prosecutors later dropped those charges as part of a review of more than 250 cases that Wester was involved in since his hiring in 2016.\n\nState prosecutors have dropped criminal charges in more than 100 cases involving Wester after body cam footage released last September showed the officer allegedly planting drugs in a car during another traffic stop. A Florida judge also vacated the sentences of eight people whose convictions were based on evidence and testimony by Wester. The Florida Department of Law Enforcement launched an investigation into Wester, and several people have filed federal lawsuits against him.\n\nIn the body cam footage obtained by Reason of Vann's arrest last year, Wester searches Vann's truck after pulling him over for a traffic violation and appears to find a small plastic baggie in the vehicle's center console.\n\n\"Honesty is going to go a long way with me,\" Wester tells Vann, holding up the baggie. \"Have you ever seen this before?\"\n\n\"No, no what is that?\" Vann says. \"Where'd you get that?\"\n\n\"The center console,\" Wester says as he walks back to his cruiser to perform a roadside test of the baggie for methamphetamines.\n\n\"There ain't no way, man,\" a distraught Vann says. \"Oh my god, you gotta be fucking kidding me.\"\n\nWester then uses a Nark II field test for methamphetamines and MDMA. According to the manufacturer, the field test \"will develop an IMMEDIATE (within 2 seconds) Dark Blue color as a positive reaction after breakage and agitation of the 3rd ampoule. If the color development is an immediate Pink slowly transforming to Lavender, you DO NOT have either Methamphetamine or MDMA.\"\n\nWester shakes the field test for about 10 seconds, checking it several times, but it remains red. Looking right at the small bag of pinkish red liquid, Wester then says \"blue\" and returns to Vann to tell him the substance tested presumptively positive for methamphetamines. The field test occurs at roughly the 3:45 mark in the video above.\n\nThe Jackson County Sheriff's Office confirmed to Reason that it uses the Nark II field test and that a positive result for methamphetamines should turn the solution blue.\n\nWester presses Vann to admit that he knew the meth was in his car, but Vann, breaking into tears at several points, continues to deny knowing where it came from. He appears confused and devastated throughout the exchange.\n\n\"I'm going to have to take your vehicle, too,\" Wester tells Vann. \"Listen buddy, I don't think you're a bad guy.\"\n\nAt one point, at around 11 minutes 50 seconds into the footage, Wester drops some of Vann's personal effects into the trunk of his police cruiser, at which point he picks up the field test and looks at it again. It's still clearly red.\n\nThe Tallahassee Democrat first reported last September that local prosecutors were dropping dozens of cases involving Wester after body cam footage appeared to show him planting a small baggie of meth in a woman's car during a traffic stop.\n\nThe Democrat later published accounts by several other people who claimed they were framed by Wester during traffic stops. Before joining the Jackson County Sheriff's Office, Wester was fired from his previous job at the Liberty County Sheriff's Office for for inappropriate relations with women, the newspaper reported.\n\nIn 2016, The New York Times reported that the $2 roadside field tests that Wester and countless other police officers around the country use to establish probable cause to arrest someone for drug possession are unreliable and easy to misinterpret:\n\nThere are no established error rates for the field tests, in part because their accuracy varies so widely depending on who is using them and how. Data from the Florida Department of Law Enforcement lab system show that 21 percent of evidence that the police listed as methamphetamine after identifying it was not methamphetamine, and half of those false positives were not any kind of illegal drug at all. In one notable Florida episode, Hillsborough County sheriff's deputies produced 15 false positives for methamphetamine in the first seven months of 2014. When we examined the department's records, they showed that officers, faced with somewhat ambiguous directions on the pouches, had simply misunderstood which colors indicated a positive result.\n\nSuch tests are not admissible evidence in court in most jurisdictions in the U.S. Instead, samples are sent to state forensic labs for verification.\n\nMany of Wester's victims had prior criminal records for things like drug possession. They were, in other words, easy targets. No one would believe their word against a police officer's. If Wester hadn't been wearing a body cam, and if he hadn't of been sloppy enough to film his amateur sleight-of-hand attempts and lies, all of their charges would likely stand, and he would still be patrolling the streets.",
    "author": "Ed Krayewski",
    "url": "http://freedombunker.com/2019/01/17/watch-a-florida-cop-botch-a-drug-field-test-on-video-then-arrest-an-innocent-man/",
    "published": "2019-01-17 20:30:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}