{
    "data_id": "219544",
    "id": "freedombunker--2019-02-06--Alabama Cop Justified in Killing Innocent Man Says State Attorney General",
    "date": "2/6/2019",
    "source": "freedombunker",
    "title": "Alabama Cop ‘Justified’ in Killing Innocent Man, Says State Attorney General",
    "content": "The Hoover, Alabama, police officer who killed the wrong man in a mall on Thanksgiving Day won't face criminal charges for his actions. Alabama Attorney General Steve Marshall's office says the officer was \"justified\" in shooting 21-year-old Emantic \"E.J.\" Bradford, Jr.\n\nIn the immediate aftermath of the incident, police had a difficult time getting their story straight. There had been a shooting at the mall that injured 18-year-old Brian Wilson and a 12-year-old bystander, Molly Davis. Bradford was not involved in that shooting, but at some point, he took his gun out. Other shoppers may have done the same, Al.com reported in late November. Bejmanin Crump, an attorney for Bradford's family, has suggested Bradford was trying to help people in the midst of the chaos following the shooting.\n\nBradford ended up being shot and killed by a Hoover Police officer who was on duty at the mall. Police initially claimed Bradford was the suspected shooter, and then said less than two days later that he probably wasn't. Police eventually arrested a different suspect, Erron Martez Dequan Brown, who claims he shot Brian Wilson in self-defense, according to a report Marshall's office released yesterday.\n\nThat 24-page report explains why the unidentified cop who killed Bradford, referred to as \"Officer 1,\" won't face charges. \"Officer 1 reasonably exercised his official duties, powers, or functions when he shot,\" the report reads. \"Accordingly, Alabama law declares his action 'justified and not criminal.'\"\n\nThe report includes testimony from multiple witnesses and police. Marshall's office also released partial surveillance footage of both shootings taken from two nearby stores. In describing the footage, the report reads:\n\nIt's difficult to see the first shooting. However, the footage does show the scene turning chaotic in its aftermath. Brown appears to move away from the scene before starting to go the other way. Bradford only makes it a few steps before he drops to the ground, and a small black object appears to fall from his grasp. The footage can be seen below:\n\n\"I observed two males who were not running away, but, instead, were standing near the railing in front of FootAction,\" Officer 1 said in a written statement. \"Next, I observed an armed suspect quickly moving towards the two males standing near the railing. The suspect was advancing on the two males and had a black handgun in his right hand. I fired my duty weapon at the armed suspect to stop him.\" After shooting Bradford, Officer 1 said he \"asked the uninjured male…if the suspect was the only shooter. I understood an affirmative response to my last question.\"\n\nIn spoken testimony, Officer 1 said he thought Bradford \"was going to murder Brian Wilson and AC,\" according to the report. His body camera was in standby mode until after he shot Bradford.\n\nOfficer 1's partner at the time, identified as \"Officer 2,\" backed up Officer 1's testimony. \"Officer 2 stated that, at the time, he believed E.J. Bradford had shot Brian Wilson,\" the report reads.\n\nThe report also cited three civilian witnesses. Two of those witnesses said they believed Bradford to be the shooter, though neither witnessed the original shooting. (They simply heard gunshots.) Both of those witnesses said they heard Officer 1 tell Bradford to drop his weapon three times before shooting him. But according to the report, \"Officer 1 stated that he did not give any commands due to the imminent nature of the threat.\" The report said it's \"unclear\" whether he actually warned Bradford to put his gun on the ground or not. A third witness, meanwhile, simply \"stated that she saw a police officer shoot E.J. Bradford three times.\"\n\nAn official autopsy from the Jefferson County Coroner Medical Examiner's Office did indeed say Bradford was hit three times, seemingly confirming much of what an independent autopsy had previously concluded. Bradford was shot once in the back of the head, once in the neck, and once above his right buttock, the official autopsy found.\n\nThe report said Officer 1 was ultimately justified in shooting Bradford because he \"acted as a reasonable officer would have under the circumstances\" and because he \"acted in accordance with nationally-accepted standards for 'active shooter' scenarios.\"\n\nBut Bradford's family isn't buying it. \"I'm outraged,\" Bradford's mother, April Pipkins, told The New York Times. \"In no way was justice served,\" she added. Another witness, Ashlyn McMillan, told the Times that Bradford was helping get shoppers to safety in the first shooting's aftermath.\n\n\"It is outrageous and beyond comprehension that the Alabama Attorney General has concluded that it was reasonable for a trained law enforcement officer to fatally shoot an innocent civilian, one whose only action was an attempt to help protect the public and whose only 'crime' was being black,\" Crump said in a statement emailed to media outlets. Crump claims the footage released by Marshall's office does not tell the whole story, and he's calling for the \"full, unedited video\" to be \"released immediately.\"\n\nAt a preliminary court hearing earlier this month, Special Agent Pete Acosta of the Alabama Law Enforcement Agency, which investigated the case, testified that Wilson had hit Brown, prompting Brown to shoot him. It's not clear if Bradford knew Brown, but they appear to have been connected by a mutual friend, Robert Poole, who also testified at the hearing, according to Al.com. Poole said he was with Brown and another friend at the mall when Bradford asked about his whereabouts over Facebook. Bradford and Wilson, who attended the same high school as Poole, then showed up at the mall prior to the shooting.\n\nClearly, there are still may questions left unanswered about what led to that first shooting. Bradford, however, does not appear to have done anything wrong. And clearly, he was not responsible for the original shooting. According to Marshall's report, \"there is no evidence that\" Bradford's gun \"was fired at the incident scene,\" though he did chamber a round prior to being shot.\n\nIt's also worth noting that the attorney general's report suggests Officer 1 was partly justified because of the supposed threat Bradford posed, even though there's no evidence he had or was about to engage in any wrongdoing. The report reads:\n\nIn other words, Officer 1 was justified in killing Bradford for exercising his Second Amendment right to carry a firearm. (Alabama is an open-carry state, and Bradford's father has claimed Bradford has a permit for his gun.) The report suggests that even if Officer 1 did not think Bradford was the shooter, he was right to take him down because he was carrying a weapon. The attorney general's office is operating under the assumption that citizens should not take action to protect themselves and/or others in situations like these.\n\nWe saw this type of thinking play out in Chicago last November. An armed security guard returned fire on an active shooter and eventually pinned him to the ground. But the guard was shot and killed when police arrived on the scene and thought he was the bad guy.\n\nAs I've previously written, neither man deserved to die, and both actually appear to have been the proverbial \"good guy with a gun.\" The fact that police shot first and asked questions later just makes their deaths all the more tragic.",
    "author": "Ed Krayewski",
    "url": "http://freedombunker.com/2019/02/06/alabama-cop-justified-in-killing-innocent-man-says-state-attorney-general/",
    "published": "2019-02-06 18:45:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}