{
    "data_id": "220656",
    "id": "freedombunker--2019-04-11--He Was Tased Arrested and Totally Innocent Now Hes Suing",
    "date": "4/11/2019",
    "source": "freedombunker",
    "title": "He Was Tased, Arrested and Totally Innocent. Now He’s Suing.",
    "content": "Nate Carter is bringing a $3 million lawsuit against the city of Chattanooga, Tennessee, its police department, and the officer responsible for his tasing and wrongful arrest.\n\nAccording to the complaint, the April 2018 incident began when police responded to a 911 call about a man threatening the caller with a gun. The caller described the suspect as a black man with short hair, who was heavy-set and wearing green and black pants.\n\nThe suspect had fled by the time police arrived. Instead, they saw Carter, who was wearing a purple t-shirt and black shorts. Officer Cody Thomas asked Carter to identify himself. Carter, who said he was checking his mail outside, responded that Thomas was not welcome to come to his house. The situation escalated with Thomas telling Carter, \"How about you watch your mouth before your ass gets thrown in the back of my car.\"\n\nThomas pulled out a Taser and threatened to shoot Carter's \"fucking dog,\" which was barking in the front yard. Carter attempted to go into his house, at which point Thomas shot Carter in the back with his taser, causing him to fall on his front porch. Carter managed to make his way inside, and Thomas called for backup. Carter then re-emerged from his home with his family while several officers, including Thomas, pointed guns and tasers toward Carter, his family, and his dog. After the family was out of the way, the officers moved to arrest Carter.\n\nThomas later claimed that Carter was standing in the street and \"bolted\" prior to the incident. He charged Carter with disorderly conduct and resisting arrest. Those charges were thrown out by a judge in November and Carter is now suing.\n\nThis is not the first incident involving Officer Thomas. In February 2018, Thomas and other officers entered the home of Dale Edmonds after a neighbor told emergency services that someone was sitting in a black vehicle in Edmonds' driveway. The person in the vehicle was a Department of Child Services agent who was waiting while a second agent was meeting with Edmonds inside of the house. Though the agent explained to officers the purpose of their trip, Thomas and others entered the house through the backdoor without a warrant. The officers led Edmonds, his housemate, and the agent outside of the house at gunpoint, but not before Thomas \"manhandled\" Edmonds, who was recovering from a gunshot wound.\n\nRobin Flores, an attorney and former police officer who works on police brutality cases, is representing Carter. Their suit argues that the city \"has long-established patterns of overlooking or providing excuses and reasons to justify the misconduct of its officers.\" Flores told Reason that the complaint highlights how the city fails to \"discipline and supervise\" officers. The complaint lists other reports of bad policing by Chattanooga police dating back to 2003, including excessive force, lingering investigations, domestic abuse, and sexual harassment.\n\nFlores told Reason that the Supreme Court has ruled that the language Carter used during his arrest is a form of protected speech. In 1974, the court ruled against a Louisiana statute that criminalized the use of obscene language while an officer is performing their duties. Justices argued that the law was too broad to fit within the legal definition of \"fighting words\" and had the potential to be abused in instances lacking a valid reason for an arrest.\n\nThough Thomas' body camera was rolling during the incident, he turned his cruiser's dash camera off in violation of the department's policy. At one point, Thomas' hand covers his body camera. The complaint argues that this was done either in an attempt to turn it off or conceal his interaction with Carter.\n\nFlores says that the footage available in both Carter's case and in the Edmonds case is \"critical enough to bring a claim\" against Thomas, the department, and the city. In other instances, footage has been enough to drop charges and reopen the cases of offending officers. He also mentions another case where he dismissed a suit after his client's version of events did not match the camera footage. This, he says, also protects police officers.",
    "author": "Ed Krayewski",
    "url": "http://freedombunker.com/2019/04/11/he-was-tased-arrested-and-totally-innocent-now-hes-suing/",
    "published": "2019-04-11 18:35:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}