{
    "data_id": "222433",
    "id": "freedombunker--2019-08-21--Texas Is Executing a Man Tonight for a Murder and Rape Experts Say He Didnt Commit",
    "date": "8/21/2019",
    "source": "freedombunker",
    "title": "Texas Is Executing a Man Tonight for a Murder and Rape Experts Say He Didn’t Commit",
    "content": "A little after 6 p.m., the state of Texas will execute Larry Swearingen for a crime experts believe he was unable to commit.\n\nJournalist Andrew Purcell detailed the events leading to Swearingen's impending death in a thorough investigation.\n\nA 19-year-old college student named Melissa Trotter disappeared from her Montgomery College campus, north of Houston, in December 1998. Police set their sights on Swearingen, an electrician who was witnessed having a conversation with Trotter in the college library. Montgomery County law enforcement also found a scrap of paper with the name \"Larry\" and his phone number in one of Trotter's books.\n\nAfter a few days went by, officers tailed Swearingen in an unmarked car and eventually arrested him at his mother's house over unpaid speeding and parking tickets. His bail was set high. Though Swearingen was questioned about Trotter's whereabouts, he maintained that he saw her last on campus.\n\nThree weeks later in January 1999, while Swearingen was sitting behind bars, Trotter's body was discovered in Sam Houston National Forest. Trotter had seemingly been strangled to death by one leg of pantyhose. With the discovery of the body, Swearingen was charged with murder.\n\nA number of errors in Swearingen's trial doomed him to death row. At least two involving DNA sealed his fate.\n\nThe Washington Post reports that the second leg of pantyhose was discovered in Swearingen's trailer by a landlord, even though it was searched twice before by law enforcement. A Texas Department of Public Safety lab technician testified in court that it was \"a unique physical match\" to the pantyhose leg found on Trotter's body.\n\nSince that time, the legs have been retested. Two experts have reported that the pantyhose don't match. A third expert has refuted the original technician's testimony.\n\nThe second major piece of convicting evidence was the timeline offered by medical examiner Joye Carter. When Carter performed Trotter's autopsy, she was able to cut samples of Trotter's internal organs. Carter later told the court that she estimated Trotter's death to be on the day she disappeared, about 25 days before her body was discovered. However, medical experts note that if Carter's assumption were true, a number of the organs she was able to cut would have already been liquified by the time the body was discovered. Pictures of the crime scene also show Trotter's body intact, not heavily decomposed.\n\nSince Carter gave her testimony, seven different forensic pathologists have offered a new timeline. Trotter was missing for several weeks, and likely died within two weeks of her body being found—not the same day she disappeared.\n\nThe new timeline gives Swearingen a flawless alibi: he was behind bars at the time of death.\n\nDetermined to pin the case on him, the prosecution accused Swearingen of raping Trotter before she died, despite the absence of semen, defensive wounds, or any other indication that she was involved in a physical struggle. Lacking in the forensic evidence to tie Swearingen to the murder, the prosecution painted his odd behavior as the result of his obvious guilt.\n\nThe prosecution was not the only party at fault. The Innocence Project, which has spent years trying to save Swearingen from facing capital punishment, has spent years pushing for DNA testing that should have been performed by investigators. As The Intercept reported in 2017, the state didn't perform DNA testing on Trotter's clothes, swabs from her rape kit, cigarette butts found near her body, or even the pantyhose identified as the murder weapon.\n\nRather than grant Swearingen and the Innocence Project the DNA tests that could shed additional light on the case, Texas responded by scheduling his execution.\n\n\"They are going to execute someone that the legitimate forensic science has proven innocent,\" James Rytting, Swearingen's attorney, told The Texas Tribune on Tuesday. \"And the execution is going through on the basis of other forensic science that is borderline quackery—in fact it is quackery.\"\n\nKristin Houle, executive director of the Texas Coalition to Abolish the Death Penalty, tells Reason \"It is a sad day for justice in Texas. If his execution proceeds, Larry Swearingen will join several other individuals who were put to death by the state despite credible evidence of innocence.\"",
    "author": "Ed Krayewski",
    "url": "http://freedombunker.com/2019/08/21/texas-is-executing-a-man-tonight-for-a-murder-and-rape-experts-say-he-didnt-commit/",
    "published": "2019-08-21 22:30:24+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}