{
    "data_id": "223246",
    "id": "freedombunker--2019-11-01--Federal Court Rules there is no Taking if the Police Destroy an Innocent Person’s House During a Law",
    "date": "11/1/2019",
    "source": "freedombunker",
    "title": "Federal Court Rules there is no Taking if the Police Destroy an Innocent Person’s House During a Law Enforcement Operation",
    "content": "Earlier this week, the US Court of Appeals for the Tenth Circuit ruled that the Takings Clause of the Fifth Amendment does not require the government to compensate an innocent man for the destruction of his house during a police operation:\n\nThe Takings Clause of the Fifth Amendment requires the government to pay \"just compensation\" to property owners any time their land or other property is \"taken\" by the state. That includes many situations where the government destroys or damages the property in question, rather than appropriates it for its own use. For example, in 2013, the Supreme Court unanimously held that a taking can occur as a result of the government deliberately flooding land. As far back as 1872, the Court ruled that \"where real estate is actually invaded by superinduced additions of water, earth, sand, or other material . . . so as to effectually destroy or impair its usefulness, it is a taking, within the meaning of the Constitution.\" It seems pretty obvious that the Lech home was \"effectually destroy[ed]\" by the grenades and other \"material\" that the Greenwood Village police fired at it.\n\nWhy then, did the court rule that no taking had occurred, thereby denying the Lech family any right to compensation? Because the destruction of the house occurred in the course of a law enforcement operation intended to promote \"the safety of the public\":\n\n[A]s the [Supreme] Court explained in Mugler, when the state acts to preserve the \"safety of the public,\" the state \"is not, and, consistent[] with the existence and safety of organized society, cannot be, burdened with the condition that the state must compensate [affected property owners] for pecuniary losses they may sustain\" in the process…. [W]hen the state acts pursuant to its police power, rather than the power of eminent domain, its actions do not constitute a taking for purposes of the Takings Clause. And we further hold that this distinction remains dispositive in cases that, like this one, involve the direct physical appropriation or invasion of private property….\n\nThe court is right to point out that this distinction between the \"police power\" and eminent domain has been adopted in many of previous takings decisions immunizing law enforcement agents from liability. The main relatively new aspect of this case is applying the distinction to the physical invasion or destruction of property, as well as to \"regulatory takings\" where the government merely restricts the owner's ability to use his or her land. But the rule still makes no sense, and should be done away with.\n\nThe distinction between \"police power\" and \"eminent domain\"—with only the latter leading to a taking—is a false dichotomy. In many situations, courts have ruled that a taking has occurred even if the government did not try to use eminent domain—its authority to formally condemn private property for public use. That includes numerous cases involving both regulatory takings and physical invasions.\n\nThe fact that the \"police power\" may have been involved does not normally immunize the government from takings liability. As the Lech decision notes, the police power extends to government actions \"for the protection of public health, safety, and welfare.\" Modern jurisprudence defines these concepts very broadly. Yet, in many contexts, courts nonetheless routinely rule that takings have occurred even though the purpose of the law at issue was to protect health or safety. For example, in the classic 1922 case of Pennsylvania Coal v. Mahon, the Supreme Court ruled that a prohibition on mining can qualify as a taking, even though its purpose was to protect the safety of people and property on the surface. Similarly, environmental regulations can sometimes qualify as takings if they destroy enough of the value of a property, even though their purpose is often to promote health or safety.\n\nCases where the government does go through the formal process of eminent domain often also involve the protection of health or safety. For example, the condemnation of property to build a road can increase health and safety if the new road is safer than the old, and thereby reduces the rate of traffic accidents. Yet, the government could not use that fact to seize the property and build on it without paying compensation.\n\nEven if the government has a good reason to seize or destroy private property, the Takings Clause requires payment of compensation. As the Supreme Court famously stated in Armstrong v. United States (1960), \"[t]he Fifth Amendment's guarantee that private property shall not be taken for a public use without just compensation was designed to bar Government from forcing some people alone to bear public burdens which, in all fairness and justice, should be borne by the public as a whole.\" The history and original meaning of the Takings Clause also supports the notion that exercises of the \"police power\" can be takings.\n\nOutside the context of law-enforcement operations, the fact that the government was trying to promote public safety does not create blanket immunity from having to compensate innocent owners whose property is taken or destroyed in the process. There is no good reason to exempt law-enforcement operations from takings liability of the same kind that applies to other government actions that might enhance public safety.\n\nIndeed, as the Supreme Court recognized in the 2015 Horne case, the Takings Clause was inspired in the first place in part by revulsion at both British and American forces' seizure of property during the colonial era and the Revolutionary War. Many of these British actions were, of course, undertaken for the purpose of enforcing British law against recalcitrant colonists.\n\nOne possible distinction between police operations and other government actions is that the former may require quick decisions in order to ensure the capture of suspects. Thus, it might be unnecessarily burdensome to require police officers to consider potential takings liability at such moment. But the need for rapid decision-making is by no means a universal trait of police actions that damage or destroy private property. As Radley Balko shows in his important book, The Rise of the Warrior Cop, law enforcement operations using destructive military-style tactics are actually often planned in advance. Even when quick decision-making is needed, line officers do not have to weigh takings issues on the spot. Such matters could be considered in advance by their superiors in formulating general tactical guidelines for their subordinates.\n\nIf the use of various destructive tactics pays large dividends for public safety, then the government can continue using them, secure in the knowledge that the compensation paid was well worth the price. And it is only proper that the costs be borne by the general public whose safety these operations protect, not by innocent owners who had the misfortune of having their property destroyed because it was in the wrong place at the wrong time.\n\nIf, on the other hand, authorities find that they routinely end up paying compensation that far exceeds any plausible benefit arising from the use of such aggressive tactics, then they would be well-advised to issue stricter guidelines for the use of force by their officers. Perhaps they shouldn't seize and destroy as much property as they currently do.\n\nIn this way, Takings Clause liability not only promotes fairness for innocent property owners, but also can help increase the efficiency of law enforcement. The government will have an incentive to prevent them from undertaking destructive operations that harm the public more than they protect it.\n\nThe Supreme Court would do well to overrule this case and make clear that the Takings Clause protects innocent owners whose property is destroyed during the course of law enforcement operations. Unfortunately, I am far from optimistic that will actually happen.\n\nIn commenting on this case, Clark Neily of the Cato Institute points out that \"With an honorable and ethical gov[ernment], the constitutional question never comes up because they [would] just compensate the owner as a matter of common decency.\" But, as Clark also notes, when it comes to government policy, honor, ethics, and common decency are often in short supply. Thomas Jefferson put it well: \"in questions of power then, let no more be heard of confidence in man, but bind him down from mischief by the chains of the constitution.\" Though Jefferson didn't always live up to this principle himself, it is valid all the same. The chains of the Takings Clause should bind law enforcement no less than other agents of the state.",
    "author": "Ed Krayewski",
    "url": "http://freedombunker.com/2019/10/31/federal-court-rules-there-is-no-taking-if-the-police-destroy-an-innocent-persons-house-during-a-law-enforcement-operation/",
    "published": "Fri, 01 Nov 2019 03:22:32 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}