{
    "data_id": "235329",
    "id": "hitandrun--2019-07-18--Corey Atchison Freed After Serving 28 Years for a Murder He Didnt Commit",
    "date": "7/18/2019",
    "source": "hitandrun",
    "title": "Corey Atchison Freed After Serving 28 Years for a Murder He Didn't Commit",
    "content": "After 28 years in prison, Corey Atchison is finally a free man.\n\nConvicted of murder in 1991, the Oklahoma native spent nearly three decades behind bars before a private investigator, Eric Cullen, took up his case. Cullen's work had previously helped to free Atchison's younger brother, Malcolm Scott, who was wrongfully convicted of murder in 1994. In Scott's case, another man who had testified against Scott eventually confessed to the murder before being executed for another crime. In Atchison's, evidence emerged that the authorities had bullied witnesses into offering false testimony.\n\nDistrict Judge Sharon Holmes found that his case was marred by a \"fundamental miscarriage of justice,\" according to people who were in the courtroom and local reports…. \"Corey was arrested three months before his daughter was born; this is the first time he's been able to have some real contact with her and the same with his 10-year-old grandson,\" his lawyer Joseph Norwood told The Washington Post. \"I'm very proud to have vindicated them and reunited them.\"\n\nOne might have expected Atchison to express bitterness. (If I had been wrongly imprisoned for nearly 30 years of my life, I would be plotting some kind of elaborate revenge, Count of Monte Cristo–style.) But Atchison told the press that he felt \"blessed\" and held no grudges. \"Life's too short,\" he said.\n\nIndeed, life is too short. And Atchison's life is 30 years shorter, because overzealous authorities stole that time from him.\n\nI can't help but think about this travesty of justice in the context of the current national freakout many on the right are having with respect to \"Big Tech,\" globalization, automation, and the supposed sins of the free market. To grapple with these issues, these conservatives are racing to embrace nationalism and \"declare independence from neoliberalism, from libertarianism, from what they call classical liberalism…from the set of ideas that sees the atomic individual, the free and equal individual, as the only thing that matters in politics.\" That's how author Yoram Hazony explained it during his remarks at the National Conservatism Conference in Washington, D.C., this week. (See my colleague Stephanie Slade's excellent writeup of the event.) Other speakers at the conference explicitly singled out private companies like Google, Amazon, and Facebook as bigger threats to individual liberty than big government. Libertarians, the new nationalists say, are fools for caring more about the latter threat than the former.\n\nFor the likes of Steven Crowder and Dennis Prager, perhaps the threat of YouTube censorship really is the most serious tyranny they face. Many other Americans have different problems. Neither Google nor Amazon nor any social media company even existed when the government sent Atchison to prison for for 28 years. Who knows if one day Twitter would have shadowbanned Eric Garner, killed by the cops because he was selling loose cigarettes? On Tuesday, the Justice Department announced that none of the officers responsible would face charges. The only person who went to prison in the Garner case was Ramsey Orta—a friend of Garner's who managed to record his final moments.\n\nGiving more power to the government is probably not an appealing agenda for the family of Daniel Shaver, whose killer—Officer Philip Mitchell Brailsford—will receive $2,500 a month because he allegedly got PTSD for shooting the unarmed man in a hotel hallway. Nor would it please the Lowthers, who spent $300,000 trying to stop Child Protective Services from abducting their children based on a mendacious lie.\n\nOur critics—be they nationalist conservatives or progressive liberals—say we libertarians are monomaniacally focused on reducing the size of government. But that's because we recognize that government has more power than any other institution to kill people, deport their relatives, kidnap their children, and destroy their livelihoods. If you're not at serious risk of suffering one of those calamities, you possess a level of privilege many of your fellow Americans do not.\n\nThat doesn't mean you are forbidden from complaining about bias or mistreatment at the hands of private organizations such as tech companies and the mainstream media. I'm frequently critical of both myself. But you should be really, really wary of supporting robust federal intervention into these problems, when the likely result will be to give government authorities more resources for oppressing everyone.\n\nThe next time someone says that there's no bigger threat to Americans' liberties than Big Tech, remember Corey Atchison.",
    "author": "Robby Soave (robby.soave@reason.com)",
    "url": "http://feedproxy.google.com/~r/reason/HitandRun/~3/1ZfAIQ5aK80/",
    "published": "2019-07-18 15:35:02+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}