{
    "data_id": "235424",
    "id": "hitandrun--2019-07-24--How Confirmation Bias Sends Innocent People to Prison",
    "date": "7/24/2019",
    "source": "hitandrun",
    "title": "How Confirmation Bias Sends Innocent People to Prison",
    "content": "Last week an Oklahoma judge freed Corey Atchison, who had spent 28 years in prison for a murder he has always said he did not commit, after concluding that he had been convicted based on the false testimony of \"purported eyewitnesses\" who had been \"coerced\" by prosecutors. The next day, an Idaho judge exonerated Christopher Tapp, who had served more than two decades for rape and murder, after DNA evidence implicated another man, who confessed to the crimes.\n\nWhile cases like these often feature wrongdoing by individual prosecutors and police officers, a new study suggests the problem is deeper. After analyzing 50 wrongful convictions and other investigative failures, Texas State criminologists Kim Rossmo and Joycelyn Pollock found that confirmation bias, reinforced by groupthink and strong incentives to quickly identify the perpetrators of highly publicized crimes, figures prominently in the mistakes that send innocent people to prison.\n\nOnce police decide they have the right suspect, Rossmo and Pollock report in the Northeastern University Law Review, they tend to develop \"tunnel vision\" that obscures other possibilities. They become focused on building a case against the person they've decided is guilty, ignore or minimize countervailing evidence, and interpret ambiguous evidence in a way that supports their initial conclusions.\n\nAfter Angela Correa, a 15-year-old high school student in Peekskill, New York, was raped and strangled to death in 1989, for example, police quickly settled on one of her classmates, Jeffrey Deskovic, as their sole suspect. \"Suffering from tunnel vision, detectives pursued a single-minded course of action designed to get Deskovic to confess,\" Rossmo and Pollock write. \"Police did not look for other suspects despite the presence of exculpatory physical evidence. In a classic confirmation bias pattern, detectives changed their theory of the case when the DNA test results came back excluding Deskovic.\"\n\nDeskovic was convicted in 1990 based on a false confession he later retracted. For years the Westchester County district attorney, Jeanine Pirro, now a Fox News host who opines on justice, rejected Deskovic's requests to compare the DNA evidence against a criminal database. Deskovic was not exonerated until 2006, after he had served 16 years in prison, when a new D.A. approved testing that identified the actual perpetrator.\n\nChristopher Tapp's conviction also was based on a false confession that was contradicted by DNA evidence, the pattern in about a third of the 367 cases in which the Innocence Project has used such evidence to clear people who were wrongly convicted. \"Interrogations are not a quest for information,\" observes the Innocence Project's Vanessa Potkin. \"The purpose is to get an admission.\"\n\nIn another case that Rossmo and Pollock examined, Bruce Lisker was wrongly convicted in 1985 of stabbing his mother to death at their home in Sherman Oaks, California. He was not released until 2009, at which point he had served 26 years, after a judge determined that he had been convicted based on false evidence, including the testimony of a jailhouse snitch police knew was unreliable.\n\n\"Investigators coerced a confession (quickly recanted) from the 17-year-old teenager through the offer of a plea bargain,\" Rossmo and Pollock write. \"A rush to judgment followed by tunnel vision led to confirmation bias. Exculpatory evidence was ignored, while the alibi of an alternative and viable suspect was never checked despite inconsistencies in his story.\"\n\nConfirmation bias is common and hard to root out. Rossmo and Pollock recommend training in \"cognitive de-biasing,\" better evidence procedures, closer supervision, and a general awareness of cognitive biases and the factors that let them run riot.\n\nRossmo and Pollock also note that the \"probable cause\" standard for arresting someone, which creates momentum toward a conviction, is a low bar that does not require showing the suspect is more likely than not to be guilty. \"A probable cause that is not probable is inconsistent with both language and mathematics,\" they write. \"The most certain way to prevent a wrongful conviction is to minimize wrongful arrests of innocent people.\"",
    "author": "Jacob Sullum (jsullum@reason.com)",
    "url": "http://feedproxy.google.com/~r/reason/HitandRun/~3/kPMlEX0iksk/",
    "published": "2019-07-24 04:01:15+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}