{
    "data_id": "235521",
    "id": "hitandrun--2019-07-30--Police Faked Evidence and the Real Killers Confessed But Missouri Still Imprisoned an Innocent Man",
    "date": "7/30/2019",
    "source": "hitandrun",
    "title": "Police Faked Evidence and the Real Killers Confessed. But Missouri Still Imprisoned an Innocent Man for 24 Years.",
    "content": "The St. Louis Circuit Attorney's Office will give a new trial to Lamar Johnson, who was convicted of capital murder in 1995 after the lead detective falsified witness statements and bribed a man to identify Johnson as the killer.\n\nFor Johnson to have been guilty, he would have had to leave an apartment party, travel three miles, kill the victim, and return on foot to the same party within a matter of five minutes. St. Louis Circuit Attorney Kim Gardner has now filed a 67-page motion to vacate the conviction. It and an accompanying investigative report say that Johnson was only convicted after police and prosecutors relied on \"perjured testimony, suppression of exculpatory and material impeachment evidence of secret payments to the sole eyewitness, and undisclosed Brady material related to a jailhouse informant with a history of incentivized cooperation with the State.\"\n\nJoseph Nickerson, the lead detective at the time, was found to have fabricated parts of his investigation, including falsifying four witness statements and bribing a man $4,000 to identify Johnson as the shooter at trial. Johnson continued to sit in prison even after the actual killers confessed to their crime, and absolved Johnson of any involvement, in 1996 and 2002.\n\nThe Midwest Innocence Project (MIP), which has long represented Johnson, praised Gardner in a press release for filing a motion for a new trial. \"We don't expect prosecutors or law enforcement officers to be perfect—but we should expect that once overwhelming evidence of innocence and government misconduct come to light, that prosecutors fulfill their duty to administer justice by correcting those injustices,\" said MIP attorney Lindsay Runnels.",
    "author": "Zuri Davis (zuri.davis@reason.com)",
    "url": "http://feedproxy.google.com/~r/reason/HitandRun/~3/UhD91WU7ZcY/",
    "published": "2019-07-30 16:00:46+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}