{
    "data_id": "235746",
    "id": "hitandrun--2019-08-15--After Spending 23 Years in Prison for a Murder He Didnt Commit Ricky Kidd Is Going Home",
    "date": "8/15/2019",
    "source": "hitandrun",
    "title": "After Spending 23 Years in Prison for a Murder He Didn't Commit, Ricky Kidd Is Going Home",
    "content": "Ricky Kidd was charged in 1996 for a double murder that he did not commit. Eyewitness testimony and other evidence pointed to a different killer, but the murders were pinned on Kidd regardless and he was sentenced to life in prison without the possibility of parole. On Wednesday, Judge Daren L. Adkins of Missouri's 43rd Judicial Circuit granted Kidd habeas corpus relief.\n\nAfter 23 years behind bars, Kidd will finally get to go home a free man, unless state prosecutors opt to retry him within 30 days of the Adkins' ruling.\n\n\"Our obligation here, as with every case, is to seek the truth,\" Jackson County Prosecutor Jean Peters Baker said in a statement to the Associated Press. But how much does the truth matter if prosecutors and police ignored it for more than two decades?\n\nPolice in Kansas City, Missouri, received a call in 1996 after neighbors believed they heard gunshots. Upon investigation, the lifeless bodies of George Bryant and Oscar Bridges were discovered at Bryant's property. An anonymous tip, which was likely called in by those connected to the crime, named Kidd as a suspect. That tip—and a number of Brady violations committed by the prosecutor—sealed Kidd's fate.\n\nMultiple witnesses attested that around the time of the shooting, Kidd was driving to the Jackson County Sheriff's Office at Lake Jacomo, Missouri, to apply for a gun permit in order to purchase a .357 revolver. Kidd filled out the paperwork at the sheriff's office. Not only did Kidd have a solid alibi, but his actions seemed weirdly timed for someone said to have recently committed a double homicide.\n\nKidd's alibi was not enough to save him from a sloppy police investigation. Nor did it convince the Jackson County lead prosecutor, who relied on out-of-context DNA evidence and a misleading witness identification to paint Kidd as a killer. In fact, the prosecutor, Amy McGowan, acknowledged in a 2017 deposition that \"there is no physical evidence tying [Kidd] to the crime scene that I recall.\"\n\nKidd's defense team also previously revealed to Reason that McGowan did not disclose the depositions of Gary Goodspeed Sr. and Gary Goodspeed Jr., both of whom are now considered \"viable alternative suspects\" in the murders of Bryant and Bridges, according to Adkins' ruling. Kidd's lawyers have spent years arguing that this was a Brady violation that ultimately helped doom Kidd.\n\nWith the system stacked against him, Kidd was sentenced to life without the possibility of parole.\n\nThough Kidd was sentenced to die alone in a cell, he had the Midwest Innocence Project (MIP) in his corner. Thanks to that group's years-long effort, Kidd received a Rule 91 hearing in April, which allowed him one final shot at habeas corpus relief. As Sean O'Brien, Kidd's lawyer and law professor at the University of Missouri–Kansas City, told Reason in April, this was Kidd's \"best last bite at the apple.\"\n\nOn Wednesday, Adkins ordered the state of Missouri to release Kidd from prison.\n\n\"Based on a careful consideration of the record and these proceedings, this Court finds that the evidence is clear and convincing that Kidd is innocent of the murders of George Bryant and Oscar Bridges,\" Adkins wrote in his 107-page decision.\n\nAdkins also concluded that the prosecution committed a Brady violation by not disclosing \"exculpatory evidence\" about the Godspeeds' depositions.\n\nIt's certainly good news that Kidd has finally been exonerated. But it's also bittersweet.\n\n\"If anything, Ricky's case shows just how hard it is to correct an injustice,\" Tricia Bushnell, executive director or the MIP and a member of Kidd's legal team, told the AP. \"It shouldn't take 20 years to bring a man home. Ricky's case is solved. We know who committed this crime,\" she added.\n\nKidd's case exposed a number of serious problems within the Missouri criminal justice system, which Reason detailed earlier this year. A combination of factors, including an inadequate public defense system, alleged prosecutorial misconduct, and a court system where innocence isn't always enough, has contributed to what Kidd has described to Reason as a \"horrible nightmare.\"\n\nAnd even if he does get to come home, which seems likely, there's no getting back the 23 years Kidd lost while incarcerated.\n\n\"Those are a lot of years,\" he said earlier this year of his long incarceration. \"And I don't get a chance to get those back.\"\n\n\"There's no money that can replace 22 years of what he's lost,\" Monica Gray, Kidd's ex-girlfriend and a key part of his alibi, told Reason in an interview earlier this year.\n\nKay Lincoln, whose father, Rodney, spent 36 years wrongly incarcerated before his release last year, expressed similar sentiments. \"Unfortunately, there is no making up for the lost time,\" she told Reason in an interview. \"There's nothing we can do to make up for that. However, when you do get out, you can refuse to be bitter. You can embrace life and embrace your family.\"\n\nKidd's ordeal, which you can read more about here, was summed up well by Monica Gray: \"People work so hard to put people behind bars that are criminals. They need to work just as hard to free the innocent.\"",
    "author": "Joe Setyon (joe.setyon@reason.com)",
    "url": "http://feedproxy.google.com/~r/reason/HitandRun/~3/EtH-TxuUfZg/",
    "published": "2019-08-15 13:55:03+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}