{
    "data_id": "237058",
    "id": "hitandrun--2019-11-21--With This Forfeiture Trick, Innocent Owners Lose Even When They Win",
    "date": "11/21/2019",
    "source": "hitandrun",
    "title": "With This Forfeiture Trick, Innocent Owners Lose Even When They Win",
    "content": "Critics of civil forfeiture, the system of legalized theft that allows law enforcement agencies to seize people's property by alleging it is connected to criminal activity, often focus on the burden of proof the government faces when owners try to recover their assets. While those standards are obviously important, nearly nine out of 10 federal forfeiture cases never make it to court, largely because mounting a challenge often costs more than the property is worth. And while the Civil Asset Forfeiture Reform Act (CAFRA) allows owners who win in court to recover \"reasonable attorney fees and other litigation costs,\" prosecutors can defeat that safeguard by dragging out cases and then dropping them before a judge decides whether forfeiture is legally justified.\n\nIn the meantime, desperate owners may decide to let the government keep some of their property, even when they are completely innocent. From the government's perspective, there is no downside. \"By gaming the system and denying property owners a 'win' in court,\" says Institute for Justice (I.J.) senior attorney Dan Alban, \"federal prosecutors have found a way to short-circuit judicial oversight of their activities, while at the same time preserving their ability to continue to abuse Americans' property rights.\"\n\nI.J. is asking the U.S. Supreme Court to consider a case that takes aim at such sneaky tactics, arguing that an owner can \"substantially prevail\" in a forfeiture battle, as required by the CAFRA provision dealing with attorney fees, even if the government returns the property before it officially loses in court. \"The threat of paying attorneys' fees is a critical check on government abuse,\" observes Justin Pearson, another I.J. senior attorney. \"Otherwise, there is no disincentive to stop prosecutors from filing frivolous civil forfeitures against property belonging to innocent owners.\"\n\nThe I.J. case involves Miladis Salgado, a Florida woman whose home was searched in 2015 based on a tip that her estranged husband was a drug dealer. Although that tip proved to be unfounded, Drug Enforcement Administration (DEA) agents found $15,000 in cash that belonged to Salgado, which they seized. Salgado hired a lawyer to challenge the forfeiture on a contingency fee basis, agreeing to pay a third of any money she recovered.\n\nThe case dragged on for two years, and the government dropped it just as a federal judge was about to rule on Salgado's motion for summary judgment. Since the DEA admitted it had no evidence implicating Salgado in criminal activity, it seems likely that she would have prevailed, which explains why the government suddenly agreed to return her money. But now instead of her original $15,000, she had only $10,000, since she had to pay her lawyer.\n\nWhen Salgado asked the court to make the government cover that cost, U.S. District Judge Darrin Gayles ruled that she was not entitled to attorney fees under CAFRA, since the case had been dismissed without prejudice, meaning it theoretically could be refiled. \"A dismissal without prejudice cannot trigger the statutory entitlement,\" he concluded, \"because such a dismissal lacks the necessary 'material alteration of the legal relationship of the parties' with a corresponding 'judicial imprimatur on the change.'\" Last July the U.S. Court of Appeals for the 11th Circuit upheld that decision.\n\nThe Institute for Justice is now asking the Supreme Court to resolve two questions: When does an owner \"substantially prevail\" in a forfeiture challenge, triggering an award of attorney fees, and does a judge have the discretion to dismiss forfeiture claims without prejudice when \"the court has ordered the United States to return the seized money and the lawsuit will never be refiled\"?\n\nThe institute's petition argues that the 11th Circuit erred by reading the word substantially out of CAFRA, limiting its analysis to the question of whether Salgado was the \"prevailing party.\" I.J. notes that the district court not only ordered the government to return Salgado's money but said the government would be on the hook for her legal fees if it decided to refile the case. \"Ms. Salgado substantially prevailed,\" I.J. says. \"She obtained the full return of her money, and she even obtained a court order inhibiting the United States from refiling the civil forfeiture lawsuit.\"\n\nTo conclude otherwise, the petition says, would deprive innocent owners of the protection CAFRA was supposed to provide. According to the House report on the bill, Congress wanted to \"give owners innocent of any wrongdoing the means to recover their property and make themselves whole after wrongful government seizures.\" An innocent owner who loses a third of her property to legal fees imposed on her by a wrongful forfeiture action plainly has not been \"made whole.\"\n\nThe House report on CAFRA also noted that \"many civil seizures are not challenged\" because of the costs owners must pay on \"the arduous path one must journey\" to contest them, \"often without the benefit of counsel, and perhaps without any money left after the seizure with which to fight the battle.\" If owners are forced to pay those costs even when the government effectively concedes their innocence, the remedy provided by CAFRA has been nullified.\n\nI.J. also wants the Supreme Court to resolve a circuit split on the question of whether judges may dismiss forfeiture claims without prejudice in cases like this. Disagreement on that point among federal appeals courts, it says, has \"resulted in widely divergent outcomes in district courts across the country.\" The position endorsed by the 11th Circuit in Salgado's case \"presents a catch-22\" for victims of forfeiture abuse, the petition says: \"In order for an innocent owner to be awarded attorneys' fees under CAFRA, the government's case against the money or property cannot be dismissed without prejudice. But the innocent owner cannot prevent the case from being dismissed without prejudice because, in these circuits, their right to be awarded attorneys' fees has not yet vested.\"\n\nIn this case, as in its many other challenges to forfeiture abuse, I.J. is calling attention to the way the system works in practice, showing that even well-intended safeguards can be defeated by coercive tactics that deprive innocent people of their property. \"Seizing someone's property and forcing them to hire an attorney for two years to get it back has real costs,\" Pearson says. \"The government can't take your property, keep it for years, and then suddenly give it back and pretend like nothing happened.\"\n\nSo far, of course, the government can do exactly that. The Supreme Court can put a stop to it by taking up this case.",
    "author": "Jacob Sullum (jsullum@reason.com)",
    "url": "http://feedproxy.google.com/~r/reason/HitandRun/~3/Yd46Ioe6qYI/",
    "published": "2019-11-21T17:55:50Z",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}