{
    "data_id": "237350",
    "id": "hitandrun--2019-12-12--An Unreliable Jailhouse Informant May Have Sent an Innocent Florida Man to Death Row",
    "date": "12/12/2019",
    "source": "hitandrun",
    "title": "An Unreliable Jailhouse Informant May Have Sent an Innocent Florida Man to Death Row",
    "content": "James Dailey has long maintained that he didn't murder Shelly Boggio in 1985. No physical evidence ties him to the case, and there's good reason to think the man who originally pointed the finger at Dailey is the actual killer. A story by Pamela Colloff, published by ProPublica and The New York Times, shows how an unreliable jailhouse informant may have doomed an innocent man to the execution chamber in Florida.\n\nOn May 6, 1985, Boggio's nude body was found floating in a Pinellas County waterway; she had been stabbed several times. Dailey and his roommate, Jack Pearcy, became subjects of interest in the case. Pearcy has a history of violence against women. On the last day of her life, Pearcy took Boggio to a bar near the Intracoastal Waterway after spending an afternoon drinking and smoking weed at his apartment.\n\nThough he admitted to stabbing Boggio at least once and provided intimate details of the crime, Pearcy insisted that Dailey was the actual murderer. Pearcy claimed that Dailey joined the pair before they reached the water that night.\n\nPearcy, who is serving life in prison, has since confessed four times that he was solely responsible for Boggio's death. He also told two other inmates that Dailey was innocent. Pearcy owned a knife consistent with the stab wounds, knew where investigators could find its sheath, and was the only person who eyewitnesses saw with Boggio the night she was murdered.\n\nYet Dailey's fate was sealed by three jailhouse informants, including one Paul Skalnik. Skalnik was one of the county's most prolific jailhouse informants, testifying in at least 37 cases. Many of those trials ended in convictions or plea deals; four ended with death sentences. Though he spent his days in protective custody, he told investigators that he managed to obtain a confession from Dailey while passing by his cell.\n\nPearcy refused to testify against Dailey in court, so Skalnik took the stand, testifying that Dailey had confessed to the murder while asking for legal advice. Detective John Halliday vouched for Skalnik because they had worked together before.\n\nJailhouse informants have an incentive to tell prosecutors what they want to hear, since their cooperation could help with their own cases. After the two other inmates claimed that they heard Dailey admit to the murder, a third later said that they concocted their stories in an effort to get their own sentences reduced. (They succeeded.) The third inmate also said police showed him news clippings of the crime in hopes that he would testify against Dailey. He refused.\n\nThough Skalnik assured the jury that he was receiving nothing for his testimony, he was released five days after Dailey was sentenced to death.\n\nAfter serving a sentence for grand theft, Skalnik was paroled in March 1985. He quickly violated his parole with various financial cons and returned to jail. Though he was identified as a flight risk, a parole violator, and was called a \"danger to society\" by his parole officer, a Florida Parole and Probation Commission memo said he was released due to his \"cooperation with the State Attorney's Office in the first-degree murder trial.\" Public records show several other instances where Skalnik received benefits for his help in other trials despite assessments that he was a \"con artist of the highest degree.\" Prosecutors once dismissed a 1982 charge for lewd and lascivious conduct involving a 12-year-old girl. Neither those charges nor their dismissals were mentioned to the jury in Dailey's case.\n\nThere are other reasons to question Skalnik's honesty. When Colloff interviewed him, he claimed that he'd been shot down in Laos during the Vietnam War. After obtaining his military records, Colloff found that Skalnik was not on combat duty during Vietnam, and did not serve overseas at all.\n\nDailey was set to die on November 7, but U.S. District Judge William Jung temporarily stayed his execution in October to give lawyers more time to present their case. Yesterday Jung rejected the new appeals.\n\nDailey's attorney, Josh Dubin, tells Reason he is asking Gov. Ron DeSantis to grant a clemency hearing to argue the prisoner's innocence. A coalition of local supporters—including the Innocence Project of Florida, the Catholic Diocese of St. Augustine, a former prosecutor, and a collection of Florida death row exonerees—is also asking the state to exonerate Dailey before it's too late.",
    "author": "Zuri Davis (zuri.davis@reason.com)",
    "url": "http://feedproxy.google.com/~r/reason/HitandRun/~3/9qvOiKgQipc/",
    "published": "2019-12-12T19:20:11Z",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}