{
    "data_id": "26085",
    "id": "bbc--2019-04-19--Turpin trial Couple jailed for life for inhuman child abuse",
    "date": "4/19/2019",
    "source": "bbc",
    "title": "Turpin trial: Couple jailed for life for 'inhuman' child abuse",
    "content": "A couple from the US state of California have been sentenced to life in prison for starving and torturing all but one of their 13 children.\n\nDavid and Louise Turpin were arrested in January 2018 when their 17-year-old daughter escaped their home in the city of Perris and raised the alarm.\n\nThe children had been abused for at least nine years and some were found chained up in filthy conditions.\n\nBut several of the children told the court they had forgiven their parents.\n\nThe couple are expected to serve the rest of their lives behind bars, unless they are granted parole in 25 years.\n\nThe Turpins wept as they heard victim-impact statements from four of their children at Friday's hearing.\n\nOne child recounted being haunted by the ordeal.\n\nI cannot describe in words what we went through growing up,\" said his statement.\n\n\"Sometimes I still have nightmares of things that had happened such as my siblings being chained up or getting beaten.\n\n\"That is the past and this is now.\n\n\"I love my parents and have forgiven them for a lot of the things they did to us.\"\n\nAnother child, in a statement read by her brother, also forgave her parents for the abuse.\n\n\"I love both of my parents so much,\" she said.\n\n\"Although it may not have been the best way of raising us, I am glad that they did because it made me the person I am today.\"\n\nBut not all the children were so conciliatory.\n\nOne daughter, who was visibly shaking, said: \"My parents took my whole life from me, but now I'm taking my life back.\n\n\"I'm a fighter, I'm strong and I'm shooting through life like a rocket.\"\n\nShe added: \"I saw my dad change my mom. They almost changed me, but I realised what was happening.\"\n\nDavid and Louise Turpin cried as they apologised for the treatment of their children.\n\nThe 57-year-old father's lawyer read a prepared statement on his behalf, saying: \"My home schooling and discipline had good intentions.\n\n\"I never intended for any harm to come to my children. I love my children and I believe my children love me.\"\n\nHe was an engineer for major US defence contractors Lockheed Martin and Northrop Grumman.\n\nSpeaking directly to the court, housewife Louise Turpin, 50, said she was \"truly sorry\" for what she had done.\n\n\"I love my children so much,\" she said. \"I really look forward to the day I can see them, hug them and tell them I'm sorry.\"\n\nThe couple sat stony-faced as the judge rebuked them for their \"selfish, cruel and inhuman treatment\".\n\nJudge Bernard Schwartz said: \"You have severed the ability to interact and raise your children that you have created and brought into this world.\n\n\"The only reason that your punishment is less than the maximum time in my opinion is because you accepted responsibility at an early stage in the proceeding.\n\n\"And you spared your children having to relive the humiliation and the harm they endured in that house of horrors.\"\n\nThe tidy exterior of the middle-class family home 70 miles (112km) south of Los Angeles offered a veneer of respectability that masked the squalor and stench of human waste found by authorities within.\n\nThe children, between the ages of two to 29 at the time of the police raid, were severely malnourished.\n\nA 22-year-old son was discovered chained to a bed. His two sisters had just been released from shackles.\n\nThe victims were forbidden to shower more than once a year, were unable to use the toilet and none of them had ever seen a dentist.\n\nSome of the adult siblings' growth had been so severely stunted by starvation that authorities at first mistook them for children.\n\nNewly released audio of their daughter's call to 911, obtained by ABC, provides a hint of the conditions in which the children lived.\n\n\"Two of my sisters and one of my brothers... they're chained up to their bed\", the 17-year-old girl, who did not know her own address, told the emergency operator.\n\n\"Sometimes I wake up and I can't breathe because how dirty the house is.\"\n\nThe girl was also unaware of the year or month, or the meaning of the word \"medication\".\n\nThe children - whose names all begin with the letter J - were kept indoors, but were allowed out for Halloween, or on family trips to Disneyland and Las Vegas.\n\nAbout 20 people from across the country, including nurses and psychologists, have offered to care for the seven adult siblings and six children.",
    "author": "",
    "url": "https://www.bbc.co.uk/news/world-us-canada-47991829",
    "published": "2019-04-19 20:57:59+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}