{
    "data_id": "2658",
    "id": "abcnews--2019-11-26--The Latest: NYC lawmakers ban flavored vaping products",
    "date": "11/26/2019",
    "source": "abcnews",
    "title": "The Latest: NYC lawmakers ban flavored vaping products",
    "content": "The Latest on a New York City measure to ban flavored vaping products (all times local):\n\nNew York City lawmakers have voted to ban flavored electronic cigarettes.\n\nThe City Council voted Tuesday to ban all e-cigarette and e-liquid flavors except tobacco.\n\nBackers of the ban said they were acting to protect young people whose use of e-cigarettes has surged in recent years. Democratic City Council member Mark Levine said there is “no higher obligation” than protecting the health of kids.\n\nSupporters of the vaping industry jeered and threw dollar bills from the balcony of the City Council chamber after the vote.\n\nDemocratic Mayor Bill de Blasio has said he supports the ban and will either sign the legislation into law or let it take effect automatically.\n\nThis entry has been corrected to show that a vaping group official says the thrown dollar bills were real, not fake.\n\nNew York City lawmakers are preparing to ban flavored electronic cigarettes.\n\nThe bill before the City Council on Tuesday would ban all e-cigarette and e-liquid flavors except tobacco. More than half of the Council’s 51 members have signed on as co-sponsors.\n\nA spokeswoman for Mayor Bill de Blasio said the Democratic mayor supports the ban and will either sign the legislation into law or let it take effect automatically.\n\nNew York state officials had already moved to implement a ban statewide, but that order has been halted by a court challenge.\n\nThe move to ban flavored e-cigarettes comes amid nationwide concern about the growth of teenage vaping and fears about health risks.",
    "author": "",
    "url": "https://abcnews.go.com/US/wireStory/latest-nyc-lawmakers-ban-flavored-vaping-products-67327858",
    "published": "Tue, 26 Nov 2019 17:24:24 -0500",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}