{
    "data_id": "2834",
    "id": "abcnews--2019-12-04--Judge to hear bid to end John Dillinger exhumation lawsuit",
    "date": "12/4/2019",
    "source": "abcnews",
    "title": "Judge to hear bid to end John Dillinger exhumation lawsuit",
    "content": "A judge will hear an Indianapolis cemetery's bid Wednesday to dismiss a lawsuit filed by a relative of 1930s gangster John Dillinger who wants to exhume Dillinger’s gravesite to determine if the notorious criminal is actually buried there.\n\nA Marion County judge scheduled a hearing to consider Crown Hill Cemetery's motion to dismiss the lawsuit Michael Thompson filed in August against the cemetery. Thompson, who is Dillinger’s nephew, is seeking a court order allowing him to proceed with the exhumation.\n\nHe obtained a permit in October from the Indiana State Department of Health that calls for the remains to be exhumed on Dec. 31. Thompson has said he has evidence Dillinger's body may not be buried there, and he may not have been the man FBI agents fatally shot outside a Chicago theater in on July 22, 1934.\n\nAttorneys for Crown Hill Cemetery call that “a decades-old conspiracy.” They oppose the exhumation, saying that Indiana’s Legislature has granted cemetery owners the right to “protect its gravesites from unwarranted disturbance.”\n\nThey argue that state law specifies that a deceased person cannot be removed from a cemetery without the written consent of that cemetery, as well as a written order from the State Department authorizing the removal and the written consent of certain relatives of the deceased.\n\nIn September, The History Channel dropped out of a planned documentary on Dillinger that would have included the exhumation.\n\nThompson and another relative applied for the state exhumation permit after they obtained an earlier permit calling for a Sept. 16 exhumation.\n\nThat exhumation did not occur after cemetery officials objected to the exhumation.",
    "author": "",
    "url": "https://abcnews.go.com/US/wireStory/judge-hear-bid-end-john-dillinger-exhumation-lawsuit-67486040",
    "published": "Wed, 04 Dec 2019 06:53:15 -0500",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}