{
    "data_id": "3053",
    "id": "abcnews--2019-12-10--Judge to consider delaying trial start in Parkland massacre",
    "date": "12/10/2019",
    "source": "abcnews",
    "title": "Judge to consider delaying trial start in Parkland massacre",
    "content": "The judge overseeing the case of Florida school shooting defendant Nikolas Cruz said Tuesday she will consider a defense request to delay the start of trial beyond late January.\n\nBroward Circuit Judge Elizabeth Scherer set a Dec. 19 date for arguments on the motion by defense lawyers who claim the case is moving much too swiftly and runs the risk of legal errors. That could mean a conviction of Cruz might be reversed on appeal, sending it back for another high-profile trial.\n\nProsecutors have been pushing hard to start the trial with jury selection beginning Jan. 27. Broward State Attorney Mike Satz, who is the chief prosecutor on the case, said the motion to delay trial must be heard quickly.\n\n“We just can't wait until the last minute,” Satz said at a hearing.\n\nCruz, 21, faces 17 counts of first-degree murder and 17 counts of attempted murder in the Valentine's Day 2018 massacre at Marjory Stoneman Douglas High School. He faces the death penalty if convicted, although his lawyers say he will plead guilty in return for a life prison sentence.\n\nIn their motion, defense lawyers noted that of 38 capital punishment cases in Broward County since 1994, the average time they remained pending between arrest and trial was 52 months, or a little over four years.\n\nOn the current schedule, Cruz's trial would begin less than two years after the mass shooting on Feb. 14, 2018. He was arrested that same day. Defense lawyers say that is far too fast for them to adequately prepare a defense in a case of such magnitude.\n\n“We want to make sure it's done once and it's done right,” said Gordon Weekes, chief assistant public defender in Broward County. “Expedience has taken precedence over the prudent disposition of this case.”\n\nThe defense motion suggests that one reason for the accelerated schedule is tha t Satz, retiring in 2020 after 44 years as top prosecutor, wants to get a conviction of Cruz next year. Another reason, the defense says, is that Scherer is up for re-election, and a third is simply the massive media attention the massacre has received.\n\nScherer sought Tuesday to keep the case on track for a Jan. 27 start by scheduling the December hearing on the motion for a continuance.\n\n“It's better to have it sooner rather than later,” the judge said.\n\nThe defense motion notes that there are at least 1,000 witnesses identified by prosecutors in the case, and each of them must be interviewed by Cruz's lawyers. There are about 4 million pages of evidence, thousands of photos, videos, and social media posts and much more.\n\nThere is still a huge amount of work to be done by the defense, Weekes said.\n\n“This court is pushing it forward at breakneck speed to acquiesce to the state,” he said.",
    "author": "",
    "url": "https://abcnews.go.com/US/wireStory/judge-delaying-trial-start-parkland-massacre-67632158",
    "published": "Tue, 10 Dec 2019 17:00:33 -0500",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}