{
    "data_id": "311537",
    "id": "mercurynews--2019-03-17--Letter Innocent man was executed then the murder victim surfaced alive and well",
    "date": "3/17/2019",
    "source": "mercurynews",
    "title": "Letter: Innocent man was executed, then the ‘murder victim’ surfaced alive and well",
    "content": "In reference to an article on the front page of the San Jose Mercury News this morning, I would like to offer my opinion on the subject of the death penalty in regard to a statement made by the resident of the Association of Deputy (Los Angeles County) District Attorneys Michele Hanisee:\n\n“Those in support of abolishing the death penalty point to the possibility of an innocent person being executed… The innocent can take solace in knowing that a unanimous jury of 12 citizens must render the death verdict after an exhaustive trial where the accused murderer is represented by two highly competent attorneys and overseen by an independent judge who ensures a fair trial.”\n\nIf I had a son who was executed for a murder he didn’t commit and posthumously proven innocent, I would be tempted to avenge his wrongful death (actually murder) through vigilante justice.\n\nThe excuse “I’m doing my job” that people in government have been using is only legitimate when used by meter maids.\n\nLetter: Here is how the president can get $8.6 billion for his wall: Letter: Why vote if Newsom’s is the only vote that counts? Letter: How many times must police officers hide behind their guns and badges? Letter: If we remove the Lafayette crosses, we could replace them with this Right is right and wrong is wrong regardless of jury verdicts, code law, or anything else. William Jackson Marion was hanged in 1887 for “murdering” a man who later re-emerged alive and well.\n\nSubmit your letter to the editor via this form\n\n Read more Letters to the Editor",
    "author": "Letters To The Editor",
    "url": "https://www.mercurynews.com/2019/03/17/letter-innocent-man-was-executedthen-victim-surfaced-alive/",
    "published": "2019-03-17 15:10:52+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}