{
    "data_id": "3118",
    "id": "abcnews--2019-12-11--US seeks dismissal of New Mexico's immigration lawsuit",
    "date": "12/11/2019",
    "source": "abcnews",
    "title": "US seeks dismissal of New Mexico's immigration lawsuit",
    "content": "ALBUQUERQUE, N.M. -- U.S. lawyers want a judge to dismiss claims by New Mexico that immigration officials shirked their duties earlier this year by quickly releasing thousands of mostly Central American migrants into communities after they crossed into the United States.\n\nNew Mexico claimed in a lawsuit filed in June that the practice left Las Cruces, Deming and other communities to pick up the tab for housing and feeding the asylum-seekers until they moved on to find relatives or other hosts elsewhere in the U.S.\n\nIn addition to seeking an end to the catch-and-release practice, the state sought reimbursement for humanitarian efforts to temporarily shelter migrants. The state resorted to issuing its own grants to help communities with the costs.\n\nU.S. District Judge James Browning heard arguments Wednesday but he noted that it could take a while before he issues a decision on whether the case will be allowed to move forward. He cited an ongoing backlog of federal cases in New Mexico.\n\nFirst-year Democratic Gov. Michelle Lujan Grisham, an outspoken critic of President Donald Trump and his immigration policies, cited a \"derogation of duty\" when she announced the lawsuit against then-acting Homeland Security Secretary Kevin McAleenan and top immigration officials. The city of Albuquerque was listed as a co-plaintiff.\n\nThe complaint resembled a suit filed by San Diego County in April that challenged the cancellation of a federal program that helped migrants with phone calls and other travel logistics as they sought final destinations across the U.S.\n\nThe quick releases in New Mexico came as the border was inundated with migrants seeking asylum. At times, groups of 300 or more people showed up at remote outposts, including the crossings at Antelope Wells and at Sunland Park, closer to El Paso, Texas.\n\nAttorneys for the state and the city told the judge about the hundreds of people who were dropped off in Deming in the middle of summer.\n\n“It's not an option to ignore those people,” said Jonathan Guss, the governor's deputy general counsel.\n\nHe pointed to state responsibilities for ensuring public health and safety for all people within its jurisdiction and argued that the federal government's actions forced New Mexico to step up.\n\nDeputy City Attorney Winter Torres said local officials had only 10 to 12 hours of notification before some 300 migrants were released on Easter weekend. She suggested that the federal government was targeting the city because of its immigrant-friendly policies.\n\nFederal officials have denied those claims, and attorneys for the government argued Wednesday that New Mexico and the city had no standing to bring the lawsuit because the previous safe release policy was not something that was ever formally adopted through regulations or statute and thus left to the discretion of immigration officials.\n\nAssistant U.S. Attorney Manuel Lucero told the judge that had Congress intended every discretionary decision an agency makes to be reviewed, government would grind to a halt and the courts would be flooded by complaints every time someone disagreed with a policy change.\n\nWhile acknowledging that the immigration and asylum system was overwhelmed, Lucero said the federal government never forced the state or city to spend their money on humanitarian efforts.\n\n“It's discretionary spending on their part. It's commendable. It really is,” he said, adding that no existing regulations, codes or statutes require the federal government to provide shelter, food or other humanitarian aid to all asylum-seekers and that it did not do so under the previous policy. Such aid, he said, is provided only on a case-by-case basis — for example if a migrant is ill and needs medical care.\n\nIn May, at the height of immigrant apprehensions the El Paso Sector — which includes New Mexico’s stretch of the border — saw nearly 30,000 families come through. The numbers dropped quickly over the summer in the busiest crossing spots, the result of several policies making it nearly impossible to gain asylum in the U.S.\n\nNew Mexico's congressional delegation was able to secure $30 million in grants for communities and organizations that aided asylum seekers. The first wave of supplemental funding came in October, but the state said Wednesday that its application for reimbursement from the U.S. government was still pending.\n\nDetails on the amount of reimbursement being sought were not immediately available.",
    "author": "",
    "url": "https://abcnews.go.com/US/wireStory/us-seeks-dismissal-mexicos-immigration-lawsuit-67663084",
    "published": "Wed, 11 Dec 2019 21:22:04 -0500",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}