{
    "data_id": "3126",
    "id": "abcnews--2019-12-12--Appeals court to rehear arguments in Trump hotel lawsuit",
    "date": "12/12/2019",
    "source": "abcnews",
    "title": "Appeals court to rehear arguments in Trump hotel lawsuit",
    "content": "RICHMOND, Va. -- A federal appeals court is set to rehear arguments Thursday in a lawsuit that accuses President Donald Trump of illegally profiting off the presidency through his luxury Washington hotel.\n\nThe state of Maryland and the District of Columbia will ask the full 4th U.S. Circuit Court of Appeals to reconsider a ruling by a three-judge panel that directed a federal judge in Maryland to dismiss the lawsuit.\n\nThe two jurisdictions allege that Trump has violated the emoluments clause of the Constitution by accepting profits through foreign and domestic officials who stay at the Trump International Hotel.\n\nMaryland Attorney General Brian Frosh and District Attorney General Karl Racine have argued that hotels in their jurisdictions suffer “competitive injury” because officials hoping to curry favor with the president are more likely to stay at his hotel.\n\nA three-judge panel of the 4th Circuit ruled in July that the two jurisdictions lack standing to pursue their claims against the president. The court later granted a request to hold a rehearing before all 15 judges on the court.\n\nTrump's lawyers have said that Frosh and Racine — both Democrats — lack authority to sue the president in his official capacity. They've also argued that the emoluments clause only bars compensation made in connection with services provided in his official capacity or in \"an employment-type relationship\" with a foreign or domestic government.\n\nThe hotel is just blocks from the White House. The iconic Old Post Office quickly became a hot spot for lobbyists and foreign officials after it reopened in 2016 as the Trump International Hotel shortly before Trump was elected.",
    "author": "",
    "url": "https://abcnews.go.com/US/wireStory/appeals-court-rehear-arguments-trump-hotel-lawsuit-67677047",
    "published": "Thu, 12 Dec 2019 04:27:52 -0500",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}