{
    "data_id": "316146",
    "id": "mercurynews--2019-11-13--SoCal man freed after 11 years for robberies he didn’t commit",
    "date": "11/13/2019",
    "source": "mercurynews",
    "title": "SoCal man freed after 11 years for robberies he didn’t commit",
    "content": "In 2008 Ruben Martinez Jr. was sentenced to 47 years and eight months in prison for a series of armed robberies, even though he was at work when two of the crimes were committed.\n\nEleven years later, he finally proved his innocence.\n\nThe 49-year-old was freed this month after serving 11 years of that sentence. Los Angeles County Superior Court Judge William Ryan vacated Martinez’s conviction, permanently released him from prison, dismissed his case with prejudice and found him factually innocent of the crimes for which he was convicted.\n\n“I did not do this time by myself,” Martinez said at a news conference. “My family did time. My wife did time with me, did the 11 years with me. I couldn’t do it on my own, by my own strength. It was God’s strength that got me through this.”\n\nMartinez and his wife Maria always insisted that he was not the armed robber who hit the same Los Angeles auto body shop five times between 2005 and 2007.\n\n“All my husband wanted was for the truth to be revealed. Well, the truth has been revealed, and he’s a free man,” Maria Martinez told reporters.\n\nHe was convicted without physical evidence\n\n Martinez worked for a temporary employment agency at the time of the crimes and said he was working when two of the robberies occurred, according to court documents.\n\nBut a witness identified him as the perpetrator and he was convicted in 2008 on nine counts of second-degree robbery. There was no physical evidence linking him to the crimes.\n\nMartinez was tried a second time on the charges after his first trial ended in a mistrial. Two witnesses who testified that he was not the robber were not called in the second trial, according to the District Attorney’s office.\n\nMartinez said he turned down a plea deal that would have included a 2 1/2 year sentence.\n\nHe filed several unsuccessful appeals before bringing his case to the Los Angeles County District Attorney’s Conviction Review Unit.\n\nDistrict Attorney Jackie Lacey told reporters that her investigators were able to track down new information that confirmed Martinez’s alibi. She said the alibis were not fully presented at trial.\n\n“They painstakingly tracked down witnesses and uncovered employment records and pay stubs that confirmed that Mr. Martinez could not have committed two of the crimes that were clearly the work of the same serial robber,” she said at a news conference.\n\nLacey said that the robberies were all committed by the same person, who has not been caught, so Martinez had to be innocent of those crimes as well.\n\nShe ordered him to be released November 1 and he was freed four days later.\n\n“I am sorry for this injustice and I am so happy that you did not give up on us and allowed us to share this moment,” Lacey told the Martinez family.\n\nShe said that during Martinez’s years in prison, the couple was “unstoppable in their pursuit of his freedom.”\n\n“Throughout this terrible ordeal, The two were never deterred by setbacks and instead demonstrated remarkable strength and dignity through what I imagine must have been a dark time,” Lacey said.\n\nHis wife worked on his appeal\n\nMaria Martinez had worked as a secretary in the Los Angeles Sheriff’s Department and was very close with retired homicide detective Catherine Wills — so close that Wills’ husband gave Maria away when she married Ruben.\n\n“She is such a beautiful person and I knew that Maria would never have anything to do with a person who committed crimes, she’s so straight,” Wills said.\n\nWills said that she and Maria Martinez spent six months going through every document in Ruben Martinez’s case and presented a thick binder of evidence to the district attorney’s office.\n\n“I told them, ‘Look, I’m 82 years old now, and I’m not going to die until Ruben Martinez is out of prison,'” Wills said.\n\n“I just pinch myself every morning,” Wills told CNN affiliate KABC. “I knew it should happen, but that doesn’t mean it does happen.”\n\nMartinez is the third person to have their sentence vacated since Lacey formed the unit in 2015 and the first to do it without an attorney, according to the district attorney’s office. There are currently 45 cases under review.\n• Trump says he is a ‘big fan’ of Turkish leader Erdogan\n• DA: ‘It’s a disgrace:’ East Bay counties to crack down on illegal dumping\n• Impeachment: Trump reaching the limit of his powers “Although the vast majority of convictions are correctly upheld, I knew that, at times, the pursuit of justice, which depends on human beings, is not perfect,” Lacey said. “And Mr. Martinez’s case serves as a stark reminder to all of us: Despite our best efforts, we don’t always get it right.”\n\nMartinez gave Lacey a friendly side hug during the news conference and said he was grateful to her, the prosecutors who helped free him and the thousands of people who prayed for him and his wife.\n\n“The Lord Jesus Christ is a part of my life, and there’s no grudges. People are human people do make mistakes.” Martinez said. “But what touches me is when the DA got behind me and stamped me … and proved me innocent — so what grudge?” he said.\n\nMartinez said he was studying to get his driver’s license and is looking forward to getting a job so he can be a taxpayer again and pay his bills.",
    "author": "CNN.com Wire Service",
    "url": "https://www.mercurynews.com/2019/11/13/socal-man-freed-after-11-years-for-robberies-he-didnt-commit/",
    "published": "Wed, 13 Nov 2019 23:02:55 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}