{
    "data_id": "326",
    "id": "21stcenturywire--2019-05-10--Julian Assange The UK Sweden and the Illusion of Justice",
    "date": "5/10/2019",
    "source": "21stcenturywire",
    "title": "Julian Assange: The UK, Sweden and the ‘Illusion of Justice’",
    "content": "Whistleblower and political prisoner Chelsea Manning has been released from Alexandria Detention Centre in the US state of Virginia.  This follows the appeal made by her lawyers that continued detention would be a violation of law as it would be to punish her and not to ‘purge her contempt’ given her principled conviction in not cooperating.  She was held in contempt in March in relation to a grand jury investigation into the highly dubious, if not fabricated charges against WikiLeaks and its founder Julian Assange.  She is now facing the prospect of further detention as she has been subpoenaed to a different grand jury next week and by all accounts will continue refusing to cooperate.  At the same time Assange is fighting extradition from the UK to the US where it is likely he will face degrading treatment for the politically-driven charges against him.  The US and the UK, and Sweden in the case of Assange, have abused their legal systems to create a facade of  both ‘rule of law’ and ‘freedom through choice’, behind which Assange and Manning are persecuted.\n\nAs an army intelligence analyst,  Manning leaked documents to WikiLeaks which led to the exposure of horrific war crimes by the US,  including the  Collateral Murder cockpit video of the slaughter of unarmed civilians in Iraq in 2007.   For this Manning was sentenced to 35 years in prison in 2010, commuted to 7 in 2017.  While outraged by Assange for his role in publishing leaks, the Trump government has also now gone after Manning.  Manning believes this to be about revenge, and the discrediting of truth-tellers and whistleblowers who dare hold governments to account, as she expressed in a statement just prior to release:\n\n“I believe this grand jury seeks to undermine the integrity of public discourse with the aim of punishing those who expose any serious, ongoing, and systemic abuses of power by this government, as well as the rest of the international community. Therefore, participating in this fishing expedition – which potentially exposes other innocent people to the grand jury process – would constitute an unjustifiable and unethical action. Now, after sustaining serious psychological injury from my current confinement, I don’t wish to expose any other person to the trauma and exhaustion of civil contempt or other forms of prison or coercion.”\n\nThe personal toll this has taken on Manning is immense:\n\n“Without committing a federal crime, and after exhaustive testimony at a trial several years ago, I am again ripped from my life by a vindictive and politically motivated investigation and prosecution.”\n\nManning faces continued detention because she won’t surrender.  Assange is probably still alive and fighting because he has not surrendered.  For Assange this meant that while in the Ecuadorian embassy he could only access urgent medical help by risking arrest and extradition to the US, which could have meant the death sentence or a life prison sentence.  Surrender or death.  Death or death.  The illusion of choice hid persecution.  Manning makes this very point:\n\nThe illusion Assange had a choice is also essential for the British government  to carry off that he was a criminal fugitive hiding from justice:\n\n“…Assange is in the embassy of his own choice...”\n\n – Alan Duncan, Foreign Office\n\nIt is now evident that this was a lie.  Choice was an illusion for the public.  Assange would have risked the death sentence or life in prison by leaving the embassy.  This is what he could now face if extradited following his arrest on 11th April.  The British government lied.  What has now become apparent is that law is the government’s weapon of choice.\n\nOn 12th April, the day after Assange was arrested by the British police,  Labour MP Stella Creasey, with backing from over 70 MPs, wrote to the Home Secretary asking for Assange to be extradited to Sweden if its authorities re-opened the investigation into sexual allegations for which Sweden had requested Assange’s extradition in 2010.  This was based on no new claim of evidence, or due process, and could easily be seen as political interference to put pressure on the Swedish authorities.  The case itself has been condemned as trumped-up, a and violation of law.  Meanwhile, the Swedish authorities were not even  aware of the plan to arrest Assange:\n\n“This is news to us too, and we haven’t yet processed the information…We don’t know why he has been arrested.”  – Sweden’s chief prosecutor, Ingrid Isgren\n\nCreasey seemed to think this was about procedural oversight:\n\n“The decision to rescind the political asylum of Mr Assange by the Ecuadorian authorities seems to have been something of which both the UK and US authorities were made aware in advance.”\n\nHow remiss of the UK government to forget the sexual allegations made by two Swedish women they seemed to care about for so many years.  Or perhaps the UK and US no longer needed the women:  extradition to the US could now be through the UK.  The sexual allegations, the initial vehicle for getting Assange to the US via Sweden, were presumably viewed as surplus to requirements on 11th April.  After years of hunting Assange on the pretext he was a ‘rapist evading justice,’ the U.K. government, like that of Sweden, a liberal champion of women’s rights, is exposed as fake,  exploiting sexual allegations for political agenda: in this case subservience to Washington’s attack on journalism and freedom of speech.\n\nMillions were thrown at surveillance on Assange, a bounty the Crown Prosecution Service considered priceless, shown in a 2013 email to the Swedish prosecutor:\n\n“I do not consider costs are a relevant factor in this matter.”\n\nThe statement made by  Women Against Rape in 2012 should help Creasey and Co. to understand why the British government did not notify the Swedes of Assange’s arrest but invested so much in these sexual allegations:\n\n“Once again women’s fury and frustration at the prevalence of rape and other violence, is being used by politicians to advance their own purposes. The authorities care so little about violence against women that they manipulate rape allegations at will, usually to increase their powers, this time to facilitate Assange’s extradition or even rendition to the US.”\n\nThe illusion of ‘unavailability in the Ecuadorian embassy’\n\nAnd now that Sweden has today announced it will decide next week whether to reopen the case for yet a third time, it is continuing its media circus tactics around Assange,  as previously pointed out by journalist John Pilger:\n\n“For Assange, his only trial has been trial by media. On August 20, 2010, the Swedish police opened a “rape investigation” and immediately – and unlawfully – told the Stockholm tabloids that there was a warrant for Assange’s arrest for the “rape of two women”. This was the news that went round the world.”\n\nIs the Swedish government creating a launching pad for reasserting itself as champion of women?  An opportunity for some face-saving for the calculated use of its prosecution services that took being dragged to the Swedish Supreme Court by Assange’s legal team before it would progress the preliminary investigation, while countless offers by both the Ecuadorian government and Assange’s lawyers for him to be interviewed were not taken up? As pointed out by former Foreign Secretary of Ecuador, Gillaume Long:\n\n“There was no need for the Swedish authorities to delay for over 1,000 days before agreeing to carry out this interview, given that the Swedish authorities regularly question people in Britain and received permission to do so on more than 40 occasions in recent years.”\n\nBut should they decide to reopen the case, and have the case internationally scrutinised, an unlikely scenario according to Assange’s Swedish lawyer Per E Samuelson, it would mean all attention would then be on Sweden. This would remove it from the UK – convenient for the UK government to wash its hands of Assange and not be the betrayer of international law and of journalists and whistle blowers everywhere.  Sweden could take that title.\n\nCreasey’s letter embodies the anti-human rights narrative that rejects the decision of the UN Working Group on Arbitrary Detention (UNWGAD) that Assange has been subjected to arbitrary detention. It is this anti-human rights narrative the British government is using to continue persecuting Assange by keeping him in stark prison conditions after years of confinement, while he now fights extradition.\n\nTo justify sentencing him to 12 months inside high-security Belmarsh prison for skipping bail seven years ago,  the court rejected his defense of asylum, despite the risk of persecution to Assange being more obvious than ever, vindicating his asylum in the Ecuadorian embassy.   We have an anti-human rights government in power and some courts are standing in line behind it giving away their independence and integrity to serve the war criminals hunting Assange.\n\nMPs used the withdrawal of his Ecuadorian citizenship and asylum rights, an act recognised as unconstitutional and in violation of international law, as an opportunity to extradite Assange to Sweden from where he would be extradited to the US.  Once there he would face inhumane treatment, as warned by the UN rapporteur on torture.  This was a cowardly act by the MPs.  They have undermined asylum and human rights laws,  Creasey herself being a campaigner for asylum rights in Britain.   What’s more, they exploited the emotive progressive political and feminist outrage to ride rough shod over due process for Assange, while they stayed silent on the government’s use of sexual allegations for political gain, ‘a violation of law.’  Such are the “champions of action.”\n\nThe integrity of two individuals, publisher and whistleblower, has rocked the foundations of the most powerful who thought they were untouchable.  Their resilience against the uncivilised US beast and its supine servants puts to shame our liberal ‘progressive’ politicians who daren’t stray from mainstream narratives, no matter how corrupt or fake, through fear of disapproval.\n\n“Whatever one might make of my principles and decisions, I shall continue to make hard choices and sacrifices rather than relinquish my ethical positions in exchange for mere trinkets of personal gain or self-pleasure in the form of being released.” – Chelsea Manning\n\nMPs should demand an investigation into:\n\nAuthor Nina Cross is an independent writer and researcher, and contributor to 21WIRE. To see more of her work, visit her Nina’s archive.",
    "author": "Nina Cross",
    "url": "https://21stcenturywire.com/2019/05/10/julian-assange-the-uk-sweden-and-the-illusion-of-justice/",
    "published": "2019-05-10 15:49:25+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}