{
    "data_id": "32983",
    "id": "bbc--2019-11-21--France Elodie Kulik murder trial after 17-year fight for justice",
    "date": "11/21/2019",
    "source": "bbc",
    "title": "France Elodie Kulik murder trial after 17-year fight for justice",
    "content": "Elodie Kulik was heading home from a restaurant in January 2002 when she was abducted, raped and then murdered.\n\nA 24-year-old bank manager working in the northern French town of Péronne, her car was targeted in an ambush and as she tried to call emergency services she was dragged from her vehicle.\n\nDespite a huge inquiry, no arrests were made and the trail then went cold.\n\nNow, after a relentless campaign by her father and ingenious use of DNA, a man has gone on trial 17 years later.\n\nWilly Bardon, 45, denies kidnapping, rape and murder and sat beside his lawyer as the trial got under way at a court in Amiens.\n\nElodie's father, Jacky Kulik, arrived early for Thursday's trial. He lost his first two children in a car accident when they were five and six years old. His wife died in 2011 after trying to take her life and ending up in a coma.\n\nCameras were allowed in the court as the judges arrived.\n\nWhy it took so long\n\nThe Elodie Kulik murder case went cold for a decade, until advances in DNA helped identify one of her attackers.\n\nThe victim's body was found by a farmer on 12 January 2002 on a disused airbase. What was found at the crime scene gave investigators evidence they were able to use 10 years later - even though it was unusable at the time.\n\nElodie had been partly burned by her killers. Traces of semen were found in a condom along with four sets of incomplete DNA and a fingerprint.\n\nWhile police interviewed 10,000 people and analysed 14,000 phone records, the DNA samples they had gathered failed to come up with a match on the national crime database. There was no broader DNA database at the time and the samples did not match anyone tested as part of the inquiry.\n\nIn January 2011, a gendarmerie captain, Emmanuel Pham-Hoai, came up with the idea of using a technique tried out in Wales and in the US but never before in France.\n\nInstead of looking for a direct DNA match he searched for similar matches that might indicate a relative within the system - known as familial DNA searching.\n• How familial DNA trapped a murderer for the first time\n\nWithin days, the DNA from the condom matched a man already in prison. Detectives told Le Monde newspaper how they then approached his wife and were able to confirm that the sample matched their children.\n\nThey narrowed down their search to Grégory Wiart, a heating engineer who had died in a car accident in 2003. His body was exhumed and police then said they were sure he was one of the killers.\n\nShortly afterwards police detained seven members of the same family, including Willy Bardon, the man on trial. He originally came from the same village as Wiart.\n\nMr Bardon was charged after his voice was linked to the phone call made by Elodie Kulik to the emergency services. Male voices had been audible in the background and police say when they played the tape to Wiart's relatives, five of them recognised his voice.\n\nThe defendant denies the voice was his. One of his lawyers, Stéphane Daquo, told AFP news agency this was \"the only trial where everyone who has their DNA at the scene of the crime is a witness and the only one who doesn't is accused\".\n\nMore on DNA and rape:",
    "author": "",
    "url": "https://www.bbc.co.uk/news/world-europe-50502262",
    "published": "Thu, 21 Nov 2019 15:37:40 GMT",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}