{
    "data_id": "3357",
    "id": "abcnews--2019-12-20--Suspect in student death will stand trial in assault case",
    "date": "12/20/2019",
    "source": "abcnews",
    "title": "Suspect in student death will stand trial in assault case",
    "content": "SALT LAKE CITY -- A man accused of killing a Utah college student was ordered Friday to stand trial on charges he sexually assaulted another woman he met on a dating site more than a year before the slaying.\n\nAyoola Ajayi, 31, pleaded not guilty to felony kidnapping and three counts of forcible sexual abuse.\n\nDefense attorneys had asked to cross-examine the woman, saying there there were inconsistencies between her written testimony and initial statements to police, but Judge Venice Trease denied the request, citing victims' rights law.\n\nAjayi, shackled and in a yellow jail uniform, hung his head as the judge read the order, The Deseret News reported.\n\nHe met the woman on a dating app for members of The Church of Jesus Christ of Latter-day Saints and invited her to his house for dinner in March 2018, prosecutors have said. He pinned her arms and assaulted her as they were watching television but she was able to get away, charges stated. She reported the crime after seeing news stories about 23-year-old Mackenzie Lueck, whom authorities say disappeared after meeting up with Ajayi in a park in June.\n\nAjayi is charged with murder and kidnapping in the death of Lueck, a University of Utah student from California. Her charred body was later found with her arms bound behind her back.\n\nAjayi was also charged with sexual exploitation of a minor after investigators discovered child pornography on his computer.\n\nHe has not yet entered pleas to those charges, and his lawyers have not commented.",
    "author": "",
    "url": "https://abcnews.go.com/US/wireStory/suspect-student-death-stand-trial-assault-case-67860883",
    "published": "Fri, 20 Dec 2019 18:12:47 -0500",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}