{
    "data_id": "3456",
    "id": "abcnews--2019-12-24--Judge: Parolee will face murder trial in California stabbing",
    "date": "12/24/2019",
    "source": "abcnews",
    "title": "Judge: Parolee will face murder trial in California stabbing",
    "content": "SAN FRANCISCO -- A judge has ruled that a 29-year-old parolee with a history of mental illness is mentally fit to stand trial for the slaying of a woman on an Oakland subway platform.\n\nAlameda County Superior Court Judge James Cramer said Tuesday that John Lee Cowell will face trial starting in January for the unprovoked stabbing death of 18-year-old Nia Wilson in July 2018, KPIX-TV reported.\n\nCowell has been charged with murder and attempted murder for the attack on Wilson and her sister, Letifah, 26, who was wounded in the attack.\n\nThe trial had been in legal limbo as authorities sought to determine Cowell's mental competence. At a hearing Monday, Cramer said that Cowell was not cooperating with doctors appointed last month to evaluate him, for the latest in a series of evaluations. The judge said he understood Cowell has a history of mental illness but that doctors who had previously examined him felt he was “malingering”to avoid standing trial. The judge recessed the hearing, saying he needed 24 hours to reach his decision and announced his ruling Tuesday.\n\nWilson's death was one of several violent or fatal attacks on Bay Area Rapid Transit (BART) lines that connect San Francisco to the cities of Berkeley, Oakland and others.\n\nBART has announced new safety measures and installed thousands of security cameras as part of an effort to increase safety.\n\nProsecutors have said they will seek a life sentence against Cowell and are investigating if he was motivated by racial hate when he killed Wilson. The women are black and he is white.",
    "author": "",
    "url": "https://abcnews.go.com/US/wireStory/judge-parolee-face-murder-trial-california-stabbing-67919745",
    "published": "Tue, 24 Dec 2019 18:53:17 -0500",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}