{
    "data_id": "363068",
    "id": "newyorker--2019-01-14--Study Most Innocent People Need to Hire Thirty-Five Lawyers at Some Point",
    "date": "1/14/2019",
    "source": "newyorker",
    "title": "Study: Most Innocent People Need to Hire Thirty-Five Lawyers at Some Point",
    "content": "WASHINGTON (The Borowitz Report)—Most people who are innocent of any crimes will still need to hire thirty-five lawyers at some point, a new study shows.\n\nAccording to the study, commissioned by the University of Minnesota Law School, thirty-five is the “bare minimum” number of lawyers that an innocent person should have on retainer in the event that he or she becomes the subject of an entirely unjustified criminal investigation.\n\n“We found that many innocent people are going through life without taking the basic precaution of hiring thirty-five lawyers,” Professor Davis Logsdon, who supervised the study, said. “They are flirting with disaster.”\n\n“An innocent person who has absolutely nothing to hide should do everything in his or her power to avoid answering questions from investigators,” he said. “Thirty-five lawyers can really help you do that.”\n\nAdditionally, Logsdon noted, hiring nearly three dozen lawyers is invaluable because of the powerful statement it makes. “Nothing says ‘I’m innocent’ like hiring thirty-five lawyers,” he said.\n\nAlthough some innocent people may balk at the unwieldy number of lawyers that the study recommends, Logsdon emphasized that thirty-five lawyers provide necessary protection against unforeseen legal complications. “If, for example, one of your lawyers goes to prison, you will still have thirty-four,” he said.\n\nLogsdon acknowledged that, although every innocent person should definitely hire thirty-five lawyers, such legal help does not come cheap. “Legal bills for thirty-five lawyers can be very expensive, unless you’re a person who doesn’t pay his bills,” he said.",
    "author": "Andy Borowitz",
    "url": "https://www.newyorker.com/humor/borowitz-report/study-most-innocent-people-need-to-hire-thirty-five-lawyers-at-some-point",
    "published": "2019-01-14 12:46:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}