{
    "data_id": "364",
    "id": "21stcenturywire--2019-05-26--Assange Indictment US Department of Justice Declares War on Journalism",
    "date": "5/26/2019",
    "source": "21stcenturywire",
    "title": "Assange Indictment: US Department of Justice Declares ‘War on Journalism’",
    "content": "This week, Julian Assange, founder of WikiLeaks, was indicted on 17 new counts of violating the Espionage Act of 1917, for his role in obtaining and publishing classified US military and diplomatic material in 2010. It appears the current Trump Administration has crossed over a Constitutional red line which previous US presidents couldn’t or wouldn’t do, and which now has profound implications regarding the First Amendment.\n\nAccording to former Guardian editor Alan Rusbridger:\n\n“The Espionage Act was a panic measure enacted by Congress to clamp down on dissent or “sedition” when the US entered the First World War in 1917. In the subsequent 102 years it has never been used to prosecute a media organisation for publishing or disseminating unlawfully disclosed classified information. Nobody prosecuted under the act is permitted to offer a public interest defence.”\n\nDespite the obvious constitutional breach, the United States Department of Justice has declared war on the practice of journalism, and are colluding with their proxies in the UK, Ecuador and Sweden to claim global jurisdiction whereby they will be able to prosecute any person on the planet for publishing documents pertaining to government war crimes and corruption. But there is hope, as media watchdog and rights groups are now pushing back against the new DOJ leveled against Assange. The debate is heating up. Watch:\n\n.\n\n READ MORE ASSANGE NEWS AT: 21st Century Wire Assange/Wikileaks Files\n\n \n\n SUPPORT 21WIRE – SUBSCRIBE & BECOME A MEMBER @21WIRE.TV",
    "author": "21wire",
    "url": "https://21stcenturywire.com/2019/05/26/assange-indictment-us-doj-trump-declare-war-on-journalism/",
    "published": "2019-05-26 13:00:56+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}