{
    "data_id": "383597",
    "id": "npr--2019-01-30--Wrongfully Convicted And Jailed 38 Years Fred Clay Gets 1 Million Payout",
    "date": "1/30/2019",
    "source": "npr",
    "title": "Wrongfully Convicted And Jailed 38 Years, Fred Clay Gets $1 Million Payout",
    "content": "Fred Clay, who was wrongfully convicted of murder and spent almost 38 years in Massachusetts prisons, will receive a $1 million settlement from the state, the highest amount allowed under a new state law.\n\nThe settlement with the Massachusetts Attorney General was finalized Tuesday in Suffolk Superior Court, the same courthouse where Clay's conviction was vacated in 2017 and his freedom granted at age 53.\n\n\"It is a great day for justice and it is a great day for Mr. Clay,\" said Jeffrey Harris, one of Clay's attorneys who sued the state in June for compensation. \"The Commonwealth was willing to pay the full million dollars that's available under the law and it does appear that in this case, the law worked the way it was supposed to.\"\n\nClay was arrested in 1979 just weeks after turning 16 and charged as an adult for the murder of a cab driver in Roslindale, Mass. He was convicted of first-degree murder based partly on testimony from a witness named Richard Dwyer, who identified Clay only after he had been put under hypnosis by a police detective.\n\nClay's release from prison in August 2017 came after years of investigations by the state's Innocence Program convinced the Suffolk district attorney's Conviction Integrity Program to reassess Clay's murder conviction.\n\nWGBH News chronicled Clay's first year of freedom in a radio series that aired last September.\n\nAfter his release, Clay received no assistance from the state during his first 17 months outside prison and has struggled to find a good-paying job and decent housing. One state legislator is pointing to his case as a reason to retool the way the state assists wrongfully convicted people released from prison, to provide more immediate assistance once they are freed.\n\nState Sen. Patricia Jehlen said the media focus on Clay helped convince her to write a bill she filed less than two weeks ago, calling for getting quicker cash assistance and help with housing and job training to wrongfully convicted people.\n\n\"Immediately upon release, the person could receive $5,000 and immediate help with things like finding a job or finding a home, getting health insurance — all of those are things that would be a part of their transition out of prison,\" said Jehlen.\n\nJehlen said she has discussed the bill with Attorney General Maura Healey, who told WGBH News last year that she also favors changing the law to make it easier for people like Clay to get compensation.\n\nClay's lawyers waited until June to file a lawsuit for compensation because the state law was rewritten just last year to raise the payment limit from $500,000 to $1 million.\n\nOf the 69 people who have sued for compensation under the state law, fewer than half have gotten any money from the state. The average payout, before Clay's settlement, was $364,000.\n\nUnder the state's formula, people like Fred Clay who served long sentences receive a much lower per-year payout. Clay's settlement equals about $26,000 for each year he was wrongfully incarcerated.\n\n\"Would anyone take $26,000 to be in prison for a year?\" asked Clay's attorney Jeffrey Harris. \"Probably not.\"",
    "author": "Chris Burrell",
    "url": "https://www.npr.org/2019/01/30/690016359/wrongfully-convicted-and-jailed-38-years-fred-clay-gets-1-million-payout?utm_medium=RSS&utm_campaign=news",
    "published": "2019-01-30 23:36:07+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}