{
    "data_id": "424690",
    "id": "powerlineblog--2019-05-04--Kamala Harris feels awful about role in keeping apparently innocent man on death row",
    "date": "5/4/2019",
    "source": "powerlineblog",
    "title": "Kamala Harris feels “awful” about role in keeping apparently innocent man on death row",
    "content": "Advocates of abolishing the death penalty claim that innocent defendants have often been executed. I’m not sure whether these advocates have been able to show that this has ever happened in modern times, but a New York Times piece by Nicholas Kristof makes a pretty good case that Kevin Cooper, a death row inmate, is innocent of the murders he was convicted of committing.\n\nCooper, an African-American, was convicted of murdering four people in 1983. The victims, all White, were a couple, their daughter, and a boy who was sleeping over at the couple’s house.\n\nThe couple’s son, who survived the attack, told police that the assailants were White. Hairs found in the victims’ hands seemed to confirm this account. In addition, a woman told police that her White boyfriend, a convicted murderer, was probably involved in the attack. To support this statement, she gave deputies his bloody overalls.\n\nThe deputies, says Kristof, threw away the overalls and arrested Cooper. He awaits execution.\n\nKristof’s lengthy article is worth reading in full. I want to focus on the role of Sen. Kamala Harris, a candidate for her Party’s presidential nomination, in the long legal battle that followed Cooper’s conviction.\n\nReaders will recall that Harris was California’s Attorney General before she became a Senator. By the time of her involvement in the Cooper saga, DNA testing had become available for use in cases like this one. The availability of such testing is part of what gives supporters of the death penalty a high degree of confidence that the innocent won’t be executed\n\nHarris, though, refused to allow the use of DNA testing in Cooper’s case. Indeed, according to Kristof, she “showed no interest in the case.”\n\nIt’s almost as if Black lives don’t matter to Kamala Harris.\n\nHarris did become interested in the case after the online version of Kristof’s article appeared. She emailed him to say “I feel awful about this.”\n\nHarris also put out a statement saying:\n\nMy career as a prosecutor was marked by fierce opposition to the death penalty while still upholding the law and a commitment to fixing a broken criminal justice system. I’ve long been an advocate for measures to improve and make our system more fair and just. As a firm believer in DNA testing, I hope the governor and the state will allow for such testing in the case of Kevin Cooper.\n\nHarris did not explain why, as a firm believer in DNA testing, she refused to allow it in Cooper’s case. Nor did she explain why, if she’s a “fierce opponent” of the death penalty, she couldn’t be bothered to look into whether a man who faced that penalty was innocent.\n\nAs for “fixing a broken criminal justice system,” a good start would be not electing grandstanding opportunists like Harris to positions as prosecutors.\n\nHarris should feel awful. She is a hypocrite and a disgrace.",
    "author": "Paul Mirengoff",
    "url": "https://www.powerlineblog.com/archives/2019/05/kamala-harris-feels-awful-about-role-in-keeping-apparently-innocent-man-on-death-row.php",
    "published": "2019-05-04 21:15:34+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}