{
    "data_id": "431490",
    "id": "prisonplanet--2019-07-06--Report 81 of Suspects Flagged by UK Police Facial Recognition Are Innocent",
    "date": "7/6/2019",
    "source": "prisonplanet",
    "title": "Report: 81% of ‘Suspects’ Flagged by UK Police Facial Recognition Are Innocent",
    "content": "According to a recent report, approximately four out of five people identified by the London Metropolitan Police’s facial recognition system as possible suspects are totally innocent.\n\nA recent report by Sky News has revealed that approximately four out of five people identified by the U.K.’s Metropolitan Police force’s as possible suspects are innocent. Researchers discovered that the system has an 81 percent inaccuracy rate which means that the vast majority of people flagged by the system are not on any wanted lists. The report states that this raises “significant concerns” about Scotland Yard’s use of the technology.\n\nThe report concludes that it is “highly possible” that the Met’s usage of the system would be found unlawful if challenged in court due to a number of technical, operational and legal issues. The Live Facial Recognition (LFR) system has been utilized since August 2016 by the Met to monitor crowds, testing the system first at Notting Hill Carnival.\n\nProfessor Pete Fussey and Dr. Daragh Murray studied the technologies accuracy rate at six of ten police trials, finding that of 42 individuals identified by the system only eight were verified to be correct. This gave the system an error rate of 81 percent. The Met has an alternative way of determining the error rate, measuring instead the number of successful and unsuccessful matches with the total number of faces processed by the system, given it an error rate of just 0.1 percent.\n\nThe Met’s deputy assistant commissioner, Duncan Ball, stated: “We are extremely disappointed with the negative and unbalanced tone of this report… We have a legal basis for this pilot period and have taken legal advice throughout.” He continued, “We believe the public would absolutely expect us to try innovative methods of crime fighting in order to make London safer.”\n\nThis article was posted: Saturday, July 6, 2019 at 2:09 am",
    "author": "admin",
    "url": "https://www.prisonplanet.com/report-81-of-suspects-flagged-by-uk-police-facial-recognition-are-innocent.html",
    "published": "2019-07-06 07:09:01+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}