{
    "data_id": "4387",
    "id": "activistpost--2019-04-04--Chill the Fk Out Good Cop Stops Fellow Cops as They Horrifically Beat 3 Innocent Men",
    "date": "4/4/2019",
    "source": "activistpost",
    "title": "‘Chill the F**k Out!’: Good Cop Stops Fellow Cops as They Horrifically Beat 3 Innocent Men",
    "content": "Albany, NY — Utterly shocking body camera footage was released on Thursday showing what led to one officer’s arrest and felony assault charges and the suspension without pay of two others. What started over an alleged noise complaint quickly turned into a gang-style beat down of several innocent men.\n\nOn March 16, police were responding to a call over a loud party. When officers showed up, however, there was no loud party and all the lights inside the home were off. This wasn’t good enough for the cops, so one of them kicked the door into the home and ripped the occupant out onto the street and began beating him as he doused him in pepper spray.\n\nFor several moments, officers hold the man down as one of them kicks him repeatedly.\n\nIn total, three men were were all forced out into the street where they received this gang-style attack by uniformed assailants.\n\nOne of the most flagrant clips from the released footage shows officer Luke Deer shoving one of the men as he stood there with his hands in the air. Deer appears to snap and then jumps on top of the innocent man and starts savagely beating him.\n\nAs the footage shows, the man is not resisting and only trying to cover his face from the repeated blows being doled out by Deer. After his fists seemingly got tired, Deer then pulled out his baton and continued pummeling this innocent man.\n\nThe baton blows are so hard that the victim’s blood begins to splatter all over the concrete as he asks the raging cop why he is hitting him.\n\nAs another clip shows, two other officers—whose names have not been released—attack the other men and begin beating them.\n\nThe violence eventually becomes so unbearable that one cop felt it necessary to step in and stop it. As TFTP frequently points out, all too often police officers will do nothing as their fellow officers savagely beat innocent and often helpless and handcuffed individuals.\n\nIt appears in the video that these officers were going to do just that and beat these folks and get away with it. However, a good cop stepped in to stop it.\n\nAfter Deer had his victim in handcuffs he jumps up in a fit of rage, seemingly ready to dish out more violence looking for anyone nearby that he can attack. At this point, we hear an officer yell at him to stop.\n\n“Deer! Deer! Take a f*cking second! Chill the f*ck out, Deer!” the good cop says as he prevents the officer from hurting more innocent people.\n\nOfficer Deer appeared to be in a frenzy of rage ready to hurt anyone who was in front of him. Had this cop not stepped in to stop it, he may very well have beaten someone to death.\n\nAfter the cops were done beating the innocent men, they arrested them all and brought false charges against them, all of which were dropped on Wednesday.\n\nThe first man who was seen getting pulled from the home was Lee Childs. He was charged with inciting a riot—for standing in his home with the lights out.\n\nArmando Sanchez was the man with his hands up who was attacked by Deer. He was also charged with inciting a riot and resisting arrest.\n\nMario Gorostiza was also kidnapped and falsely charged. Had body camera footage of this incident not existed, all these bogus charges likely would have stuck as it was the word of these men against that of the uniformed officers. As for officer Deer, he has been arrested and charged with felony assault and official misconduct, a misdemeanor. He and his two fellow cronies who were also seen beating the innocent people have all been suspended without pay. “There are those in our community who believe that police always act responsibly and always tell the truth,” Alice Green of the Center for Law and Justice said Wednesday outside the courthouse, according to the Times Union. “Unfortunately, that’s not the case.” Below is one of the most egregious cases of police brutality TFTP has reported on in some time. It shows just how important filming police interactions is and serves as an example of why so many inner city people fear the cops. Follow @MattAgorist on Twitter, Matt Agorist is an honorably discharged veteran of the USMC and former intelligence operator directly tasked by the NSA. This prior experience gives him unique insight into the world of government corruption and the American police state. Agorist has been an independent journalist for over a decade and has been featured on mainstream networks around the world. Agorist is also the Editor at Large at the Free Thought Project, where this article first appeared Steemit , and now on Minds.",
    "author": "Activist Post",
    "url": "https://www.activistpost.com/2019/04/chill-the-fk-out-good-cop-stops-fellow-cops-as-they-horrifically-beat-3-innocent-men.html",
    "published": "2019-04-04 18:26:10+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}