{
    "data_id": "453",
    "id": "21stcenturywire--2019-07-18--CIA Pushes for Expansion of Secrecy Laws to Shutdown Public Criticism",
    "date": "7/18/2019",
    "source": "21stcenturywire",
    "title": "CIA Pushes for Expansion of Secrecy Laws to Shutdown Public Criticism",
    "content": "When the CIA and other agencies in the United States government pushed for the Intelligence Identities Protection Act (IIPA) in 1981, it was crafted to exclude “covert agents” who resided in the U.S.\n\nThere was consideration by the House Permanent Select Committee on Intelligence of how the legislation might “chill or stifle public criticism of intelligence activities or public debate concerning intelligence policy.”\n\nMore than three decades later, the CIA is apparently unsatisfied with the protections the bill granted covert agents.\n\nIt has enlisted a select group of senators and representatives to help expand the universe of individuals who are protected, making members of the press who cover intelligence matters more vulnerable to prosecution.\n\nDemocratic Representative Adam Schiff, chairman of the House intelligence committee, was involved in adding language to expand the IIPA to the Intelligence Authorization Act moving through Congress.\n\nThe CIA put their specific request for what language they would like amended in writing and sent it to the Senate Select Committee on Intelligence. Their request was essentially copied and pasted, with no changes, into the intelligence bill.\n\nSchiff supports the prosecution of WikiLeaks founder Julian Assange and shares the CIA’s view that WikiLeaks is a “non-state hostile intelligence service,” not a media organization.\n\nIn 2018, when Assange was willing to speak with investigators about the Russia probe, he replied,\n\nSenator Ron Wyden, a member of the Senate intelligence committee, said he is concerned about how the bill expands the IIPA so that it applies indefinitely, including to individuals who have been in the United States for decades and have become senior management or have retired.”\n\nGina Haspel, the CIA director, likely favors the law because she faced scrutiny over her role in the destruction of torture tapes that showed the waterboarding of Abd al-Rahim al-Nashiri. She was still a “covert agent” when news of this scandal erupted, and the protection of her identity played a role in enabling her ascension to the top of the agency.\n\nVarious groups, including the American Civil Liberties Union, Demand Progress, Human Rights Watch, National Association of Criminal Defense Lawyers, Physicians for Human Rights, the Reporters Committee for Freedom of the Press, and the Society of Professional Journalists, wrote a letter objecting to the proposed expansion that was sent to both intelligence committees.\n\nThe groups contend it would “harm congressional oversight of the intelligence community, making it much more difficult to obtain information about almost any individual’s relationship to intelligence agencies and allowing the executive branch to avoid oversight through arbitrary classification. Additionally, it would potentially make it more difficult for intelligence community whistleblowers to approach Congress with reports of fraud, waste, and abuse.”\n\nThe letter further argues it would be “significantly damaging” because it is an “extremely broad expansion of felony criminal penalties and delegates authority to when those penalties apply to the executive branch.”\n\nWhen the IIPA was drafted in 1981, the ACLU initially opposed [PDF] it. Yet, as Angus MacKenzie described, ACLU attorney Jerry Berman and Morton Halperin, who became the ACLU director in 1984 after passage of the bill, worked with the CIA on a compromise in July 1981, which offered journalists some small measure of protection.\n\nNonetheless, before the Senate Subcommittee on Security and Terrorism, which was part of the Judiciary Committee, Halperin articulated a case against the IIPA on May 8, 1981.\n\nHalperin suggested it would be better for the government to focus on taking steps to “make it impossible for foreign terrorist groups or American citizens” to “identify covert agents.” Legislation impinging on the First Amendment should not be passed for a “symbolic purpose.” It should pass because it will have some “real effect on protecting lives.”\n\nThe ACLU and other organizations believed the legislation, as it was drafted, would make it a crime “for the press to publish information which it lawfully acquires, whether it acquires that information from foreign intelligence sources, from foreign governments, from foreign newspapers, [or] from official publications of the United States government.”\n\nThere was nothing in the language that required a “bad purpose” to exist in order for a person to be prosecuted.\n\nIt is not like the law has not been abused by the U.S. government.\n\nIn 2013, the Justice Department successfully prosecuted former CIA officer John Kiriakou for confirming the name of an officer involved in the CIA’s RDI program to a reporter, even though he did not have a “pattern of activity” which involved trying to out “covert agents.”\n\nMembers of Congress specified in the IIPA that a person must be engaged in a “series” of acts or a “pattern of activity” that was intended to “impair or impede the foreign intelligence activities of the United States by the fact of such identification and exposure.”\n\nIt was viewed as a kind of protection for journalists. However, in Kiriakou’s case, there was enough ambiguity to deploy it against a former officer who had a public record of opposing the agency’s use of waterboarding against detainees in the “war on terrorism.”\n\nThe Justice Department did not use the law when CIA officer Valerie Plame had her cover blown by officials in President George W. Bush’s administration. Her outing was retaliation against her husband, former diplomat Joseph Wilson, who exposed part of the fabricated case for regime change in Iraq.\n\nFormer CIA case officer Philip Agee, who sought to reveal how the CIA was involved in “secretly intervening in country after country to corrupt politicians and to promote political repression,” was the key inspiration for the CIA push to pass the IIPA. Agee published a column, “Naming Names,” that outed agents allegedly involved in the activities he exposed.\n\nIn 1975, Agee was blamed by the CIA for the murder of Richard Welch, the CIA station chief in Athens, but Agee maintained the publication had nothing to do with the murder of Welch.\n\nThree decades ago, the CIA mobilized to protect itself from radical acts of transparency, and now, with the internet and organizations like WikiLeaks, it hopes to be able to further isolate and criminalize those who directly challenge the agency’s activities.\n\n***\n\n Author Kevin Gosztola is managing editor of Shadowproof. He also produces and co-hosts the weekly podcast, “Unauthorized Disclosure.”\n\nThis article was originally published at Shadowproof",
    "author": "21wire",
    "url": "https://21stcenturywire.com/2019/07/17/cia-pushes-for-expansion-of-secrecy-laws-to-shutdown-public-criticism/",
    "published": "2019-07-18 04:33:05+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}