{
    "data_id": "467243",
    "id": "rferl--2019-01-01--Family Says Detained US Citizen Is Innocent Was In Moscow For Wedding",
    "date": "1/1/2019",
    "source": "rferl",
    "title": "Family Says Detained U.S. Citizen Is Innocent, Was In Moscow For Wedding",
    "content": "The family of a U.S. citizen being held by Russia's Federal Security Service (FSB) over suspected spying says he is innocent and was in Moscow to attend a wedding.\n\nPaul Whelan, a retired Marine, was last heard from on December 28, according to a statement from his family, obtained by RFE/RL on January 1.\n\nHis failure to contact his family “was very much out of character for him,” the statement said.\n\n“We are deeply concerned for his safety and well-being. His innocence is undoubted and we trust that his rights will be respected,” it added.\n\nWhelan, 48, could face between 10 to 20 years in prison if found guilty. Russian officials did not disclose any details of his alleged involvement in espionage.\n\nDavid Whelan told RFE/RL in a direct message via Twitter that his brother \"has a corporate security role\" with BorgWarner, a U.S.-based supplier of automotive parts and components.\n\nBorgWarner said in a statement sent to RFE/RL on January 1 that Paul Whelan was the company's global security director. It added that he is responsible for overseeing the company's facilities in Auburn Hills, Michigan, \"and at other company locations around the world.\"\n\nBorgWarner has 60 manufacturing sites in 18 countries, but none of them are listed as being in Russia.\n\nA spokeswoman for BorgWarner told RFE/RL that the company \"does not have any facilities in Russia.\"\n\nRussia's state-owned conglomerate Rostec said in 2013 that its truckmaker, KamAz, had a long record of collaboration with a subsidiary of BorgWarner known as BorgWarnerTurboSystems.\n\nDavid Whelan told AP in a January 1 interview that his brother had been to Russia \"several times\" before and was helping a former U.S. Marine friend of his plan a wedding with a Russian woman.\n\nOn the morning of the day he was detained, Paul Whelan had given a tour of the Kremlin museums to a group of wedding guests, his brother said. He failed to show up for the wedding on the evening of December 28.\n\nDavid Whelan said his absence led the family to fear he had been in a car accident or perhaps mugged, and were searching the Internet for news about \"dead Americans in Moscow.\"\n\nThe U.S. State Department has said it knows about \"the detention of a U.S. citizen by Russian authorities\" and had been formally notified by the Russian Foreign Ministry.\n\nThe State Department said on December 31 that it had requested consular access to Paul Whelan and expected \"Russian authorities to provide it.\"\n\nDavid Whelan said in the AP interview that his family was told by the U.S. Embassy in Moscow that it has been unable to speak with Paul Whelan.\n\nDavid Whelan said his brother had previously worked for Kelly Services, an international office-staffing company that does have offices in Moscow, and had been to Russia on business and to visit friends he had met on social-media networks.\n\nPaul Whelan reportedly had a page on the Russian social-media site VKontakte on which he writes messages in basic Russian.\n\nDavid Whelan said his brother was stationed in Iraq several times with the U.S. Marines and has been living in Novi, Michigan.\n\nThe announcement of Whelan’s detainment came a day after Russian President Vladimir Putin said Moscow remains open to dialogue with Washington in a New Year’s greeting to U.S. President Donald Trump.\n\nRelations between the United States and Russia remain strained over a raft of issues including Russia’s role in wars in Syria and eastern Ukraine, its alleged meddling in elections in the United States and elsewhere, and the poisoning of a Russian double agent in Britain.\n\nAt the end of November, Trump abruptly canceled a planned meeting with Putin on the sidelines of a G20 summit in Argentina, citing tensions after Russian forces opened fire on Ukrainian Navy boats before seizing them and capturing 24 Ukrainian sailors.\n\nThe detention of Whelan comes weeks after Russian Maria Butina pleaded guilty in a U.S. court to acting as an agent for the Kremlin.\n\nThe Kremlin has denied that Butina is a Russian agent and has organized a social-media campaign to secure her release.\n\nIn the past, Russia has arrested foreigners with the aim of trading prisoners with other countries.\n\nIn his annual year-end news conference on December 20, Putin said Russia would \"not arrest innocent people simply to exchange them for someone else later on.\"",
    "author": "",
    "url": "https://www.rferl.org/a/family-says-detained-u-s-citizen-innocent-was-in-moscow-for-wedding/29686723.html",
    "published": "2019-01-01 13:07:34+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}