{
    "data_id": "468034",
    "id": "rferl--2019-02-12--Belarusian News-Site Editor Tells Court She Is Innocent",
    "date": "2/12/2019",
    "source": "rferl",
    "title": "Belarusian News-Site Editor Tells Court She Is Innocent",
    "content": "MINSK -- The editor of Belarus's largest independent news site, who is on trial on accusations that her publication has illegally obtained information from a state-run news agency, told the court she is innocent.\n\nA court in the capital, Minsk, on February 12 began preliminary hearings in the case against Maryna Zolatava, editor in chief of the website Tut.by.\n\nDozens of people who came to the trial greeted Zolatava with applauds and supporting chants as she entered the courtroom. All of the courtroom's 170 seats were filled.\n\nAs the hearing started, Zolatava rejected all the charges.\n\n\"I have not committed any of the crimes I'm charged with,\" Zolatava said.\n\n \n\n The case has raised concerns by right advocates, who have warned about growing press restrictions under President Alyaksandr Lukashenka's government.\n\n \n\n In August, police officers searched Tut.by's Minsk offices, along with that of another outlet, BelaPan. Several reporters and employees, including Zolatava, were detained.\n\n \n\n The Belarusian Investigative Committee later alleged that computers from within the Tut.by and BelaPan offices used an account and password other than their own to access the paid subscriber section of BelTA, the state-run news agency. A third outlet, Belarusskaya Nauka, was also targeted.\n\n \n\n \"The crime inflicted considerable damage\" on BelTA, \"leading to the illegal procurement and use of information protected from unauthorized access, as well as to the erosion of the enterprise’s business reputation,\" the committee charged.\n\n \n\n In all, 15 people faced charges. However, all except for Zolatava had charges dropped after paying administrative fines and damages.\n\n \n\n Zolatava, meanwhile, was hit with new charges of \"official inaction,\" a charge comparable to negligence.\n\n \n\n She has denied the allegations.\n\n \n\n Independent Belarusian media have faced severe restrictions for years under Lukashenka's authoritarian government.\n\n \n\n In June, lawmakers passed controversial amendments to the country's media laws, which media advocates warned would likely to lead to further censorship of the press.\n\n \n\n A month later, a journalist was sentenced to four years of restricted movement and forced labor after being convicted of assaulting two police officers. The reporter, Dzmitry Halko, said the case against him was retribution for his critical stance against Lukashenka.\n\n \n\n Other Belarusian journalists and bloggers have been harassed and detained, according to the Committee to Protect Journalists.",
    "author": "",
    "url": "https://www.rferl.org/a/belarus-news-editor-trial/29764982.html",
    "published": "2019-02-12 04:59:22+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}