{
    "data_id": "477081",
    "id": "rt--2019-11-26--‘I’ve dreamt about this day’: Three US friends freed after spending 36 YEARS in prison for murder TH",
    "date": "11/26/2019",
    "source": "rt",
    "title": "‘I’ve dreamt about this day’: Three US friends freed after spending 36 YEARS in prison for murder THEY DIDN'T COMMIT",
    "content": "Three teenagers from Baltimore, wrongfully convicted of killing a school student in cold blood, have been exonerated after spending more than three decades of their lives in jail.\n\nChildhood friends Alfred Chestnut, Ransom Watkins, and Andrew Stewart were arrested in 1983, when they were 16, and subsequently convicted of gunning down a 14-year-old student at Harlem Park Junior High School in Baltimore, Maryland. Authorities said at the time that the boy was shot in the neck with a 22-caliber handgun in an attempt to steal a fancy jacket he was wearing.\n\nThe men have always insisted they were innocent. Nevertheless, they spent 36 years behind bars… until they were exonerated in court on Monday. Their release became possible after Chestnut successfully filed a request to gain access to sealed court records last year, and the state prosecutor’s office launched a review of the case.\n\nThe prosecutors discovered that during the original investigation several witnesses told the court that the murder was actually committed by a different student, a man who would eventually die in 2002. Moreover, four juvenile witnesses, who identified Chestnut, Watkins, and Stewart as the killers, failed multiple times to identify them in photo arrays before the trial.\n\nIt was also found that their testimonies may have been made under pressure from police and had been recanted. The witnesses said police officers questioned them without their parents being present.\n\n“You, you and you, should never have seen the inside of a jail cell. So, on behalf of this system I apologize to you and your family,” state’s attorney for Baltimore City Marilyn Mosby told the men, now in their 50s, in court.\n\nThe three friends, who have finally regained their freedom, thanked their loved ones and everyone who had helped them to fight for justice.\n\n“I’ve been always dreaming of this day,” Chestnut told reporters.\n\n“I sat on my bunk when I got the information and I cried,” said Stewart. “My journey is just beginning because I have to learn how to live right now.”\n\nThink your friends would be interested? Share this story!",
    "author": "RT",
    "url": "https://www.rt.com/usa/474324-three-baltimore-men-exonerated/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
    "published": "Tue, 26 Nov 2019 08:14:48 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}