{
    "data_id": "480489",
    "id": "shareblue--2019-05-17--GOP takes money from accused rapist because he says hes innocent",
    "date": "5/17/2019",
    "source": "shareblue",
    "title": "GOP takes money from accused rapist because he says he's innocent",
    "content": "The Republican Party is happily accepting money from an accused rapist who calls Trump his \"great friend.\"\n\nThe Republican National Committee and the National Republican Senatorial Committee — two of the main groups that seek to get Republicans elected at the federal level — accepted $400,000 in campaign contributions from Steve Wynn, the disgraced casino magnate accused of sexual assault and rape by multiple women, Politico reported Friday.\n\nThe cash came from Steve Wynn, who was forced to resign from his role as finance chair at the RNC after the allegations about sexual assault and rape came out. Wynn was also forced to step down as chairman of his casino empire.\n\nThat's because the allegations against Wynn are disturbing and graphic. He's accused of forcing one employee at his Las Vegas casino to have sex — and ended up settling with the female accuser for $7.5 million, according to a report from the Wall Street Journal.\n\nAnother employee at his Las Vegas casino, a female massage therapist, said Wynn would expose himself during massages and once forced her to masturbate him to climax — something she felt pressured to do because he was her boss and she feared being fired for not accepting his demands.\n\nThe RNC faced pressure at the time the allegations were first made public to return the donations Wynn had made to the committee, but refused.\n\nNow, however, they are accepting hundreds of thousands more from Wynn.\n\nAnd the reasoning from RNC Chair Ronna McDaniel is about as mealy mouthed as it gets.\n\n\"While we must take any allegations like these seriously, everyone is entitled to the presumption of innocence and due process. Over the last year and a half, multiple investigations into the allegations against Steve Wynn have concluded. Throughout this entire process, Steve has repeatedly and unequivocally denied wrongdoing, and he has not been charged with or found guilty of any crimes,\" McDaniel said in a statement to Politico. \"At this point, there is no reason for refusing his support.\"\n\nOf course, this is the same McDaniel who went on a crusade against Democrats who accepted money from Harvey Weinstein, the film mogul who was also accused of sexual assault and rape. Like Wynn, Weinstein has also not been found guilty of the crimes he's accused of committing.\n\nRepublicans accepting men accused of sexual assault and rape shouldn't surprise anyone, however.\n\nTrump is, after all, the leader of the GOP, and he's been accused of sexual assault by nearly two dozen women, as well as openly admitted to grabbing women's genitals without consent.\n\nLast month, Wynn greeted Trump on the tarmac in Las Vegas when Trump flew there for a rally.\n\nIt's no wonder women have fled the GOP. This is not a party that values or supports women.\n\nPublished with permission of The American Independent.",
    "author": "Emily Singer",
    "url": "https://shareblue.com/gop-money-steve-wynn-accused-of-rape/",
    "published": "2019-05-17 21:55:37+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}