{
    "data_id": "48861",
    "id": "bigleaguepolitics--2019-12-29--Another Death is Attributed to Illegal Alien Serial Killer in the Dallas Area, Bringing Kill Count t",
    "date": "12/29/2019",
    "source": "bigleaguepolitics",
    "title": "Another Death is Attributed to Illegal Alien Serial Killer in the Dallas Area, Bringing Kill Count to 20",
    "content": "Another family believed that serial murder and illegal alien Billy Chemirmir killed their mother.\n\nThe serial killing suspect is accused of smothering older women before robbing jewelry and other items around the DFW area.\n\nOriginally, on December 3, 2017, Diane Delahunt was found dead at Preston Place Senior Living Apartments in Plano. Three rings were missing from her fingers although police informed her family that she died of natural causes.\n\nTrending: Pope Francis Unveils Globalist New World Religion at Summit with United Nations Leader\n\nHowever, Delahunt’s cause of death changed in July 2019 to “undetermined” and her daughter claims police recently told her that serial murder suspect Billy Chemirmir was responsible for killing her.\n\ntake our poll - story continues below\n\nDelahunt’s death is the 20th linked to Chemirmir. Two other women survived Chemirmir’s attacks in Frisco and Plano.\n\nThe illegal alien was indicted on 12 counts of capital murder in Dallas and Collin counties and two counts of attempted capital murder. In addition to Delahunty, eight more North Texas families stated that police suspect Chemirmir killed their loved ones.\n\nChemirmir is maintaining his innocence and is currently in the Dallas County Jail with a $16.2 million bail. In one Dallas County case, he faces the death penalty.\n\nLori Delahunty stated she found her mother lying dead on the floor of her apartment two years ago. She noticed a large knot on her mother’s head, but Lori Delahunty did not suspect foul play at the time. Originally, police told her the death was allegedly due to natural causes — a heart attack or stroke. Lori Delahunty originally thought that maybe her mother hit her head before falling.\n\nAfter the attack, Lori Delahunty tried looking for the three rings — an engagement ring, a wedding ring and a 50th anniversary gold band — and then filed an insurance claim after failing to find them.\n\nA few months later, she learned from other residents at Preston Place that police were investigating deaths and thefts there. Additionally, she learned about the case of a woman surviving an attack by a man who tried to suffocate her and stole her jewelry.\n\nLori Delahunty called Plano police in March 2018 and they informed her that her mother was “on the list”, which surprised her.\n\nAt that time, she learned about Chemirmir and the list of people he had been accused of murdering between May 2016 and March 2018.\n\nChemirmir was arrested back in March 2018 after another woman at Preston Place survived an attack. She provided a description of the assailant to police, who identified Chemirmir and proceeded to wait for him at his Far North Dallas apartment the next day.\n\nAfter Chemirmir was apprehended, police across North Texas started investigating into reported deaths and looked for more potential victims.\n\nBLP has previously reported on Chemirmir’s killing spree and its general lack of coverage in the mainstream media.",
    "author": "Jose Nino",
    "url": "https://bigleaguepolitics.com/another-death-is-attributed-to-illegal-alien-serial-killer-in-the-dallas-area-bringing-kill-count-to-20/",
    "published": "Sun, 29 Dec 2019 19:42:30 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}