{
    "data_id": "495083",
    "id": "sottnet--2019-01-17--Cop charged for stomping innocent man as K9 chewed off hunks of flesh",
    "date": "1/17/2019",
    "source": "sottnet",
    "title": "Cop charged for stomping innocent man as K9 chewed off 'hunks of flesh'",
    "content": "On the night of June 24, 2016, Frank Baker - an innocent man - 'fit the description' of a 'black man' in the area, so he was attacked by police and their K9.On Wednesday, officer Brett Palkowitsch, 31, was charged with one count of deprivation of rights for kicking the innocent man while a K9 tore him apart, literally.said a news release from the Minneapolis' FBI office, which investigated the case.At the time of the incident,Also at the scene that fateful night was officer Tony Spencer - whose dashcam recorded the violent assault on Baker - and who could not keep silent about what he saw.That night, Spencer and his partner responded to a call, which ended up being fake, about a man with dreadlocks wearing a white t-shirt and armed with a gun.When they arrived on the scene, Spencer and his partner saw Baker and realized he did not look like a suspect.\"There are about 50 people who would have matched that description that night,\" Spencer said of Baker. \"He is not acting agitated. To me, he does not appear to be engaged in a fight. He did not appear to have run from a fight ... so we continue to roll through.\"However, just after they passed Baker, two less experienced and far more violent cops showed up, pulled out their guns, and unleashed a dog.Because police said Baker was slow to respond when showing his hands, officer Brian Ficcandenti let loose the K9, 'Falco.'\"I'm thinking he (Ficcadenti) saw something we didn't see or missed and is now performing a felony-style stop,\" Spencer recalled. \"As I turn the car and see the dog pulling out this man from the cars, I recognize it's (Baker). I can clearly see there's nothing in his hand as he comes between the cars.\"The dashcam then captured the following beat down - after Baker had been mauled.Baker's legs were so severely injured during the attack that he spent weeks in the hospital recovering. He also suffered several broken ribs and collapsed lungs as well.According to his attorney Robert Bennett, the dog tore \"hunks of flesh\" as its teeth bit \"down to the bone\" of Baker's legs.After watching his fellow officers do this to an innocent person, Spencer could no longer stand it and did what a good cop should do. He crossed the thin blue line and testified against the officers who nearly killed an innocent man. It is highly likely that without Spencer's testimony, Palkowitsch would not be facing any charges. After all, he was still hired back, even after Spencer blew the whistle.\"It was very difficult because it was something I had been programmed throughout my career to never do,\" Spencer, told Ruben Rosario from Twin Cities at the time.\"But I decided that the right thing to do was tell Mr. Baker's story,\" he added as he looked away momentarily, tears starting to form in his eyes, explained Rosario. \"I owed it to him. How do you explain to that guy what happened to him was justified?\"Spencer, who felt horrible after watching his fellow officers do this to an innocent man, visited Baker in the hospital.\"He had these big tears in his eyes,\" Spencer noticed. \"He was still having trouble breathing. And then he tells me:\"We are the department that brought (cop killer) Guy Harvey Baker to jail alive,\" Spencer said. \"That's what the community expects of us. The younger cops don't understand the legacy of the department. In our darkest hour on our worst day, we brought in that guy alive. And he did not have seven broken ribs and two collapsed lungs, did he? And he killed two of our cops.\"Because of Spencer's testimony, which was described as the entire department against him and his partner, Baker received the largest settlement for police misconduct in the history of St. Paul, $2 million.Officer Spencer is the epitome of a good cop as he was unafraid of pointing out the crimes of his fellow cops against an innocent member of society - whom they ostensibly protect.However, that good cop is now gone, retiring shortly after this incident, and he has since been replaced, as he stated above, by \"younger cops [who] don't understand the legacy of the department\" who are more prone to destroy first and attempt to justify later.Below is a video showing the type of legacy the new cops intend to leave for the St. Paul police department - and it is terrifying.",
    "author": "",
    "url": "https://www.sott.net/article/405174-Cop-charged-for-stomping-innocent-man-as-K9-chewed-off-hunks-of-flesh",
    "published": "2019-01-17 20:05:39+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}