{
    "data_id": "503041",
    "id": "sottnet--2019-07-01--Charges dropped for 119 people after cop caught on video planting drugs in innocent womans vehicle",
    "date": "7/1/2019",
    "source": "sottnet",
    "title": "Charges dropped for 119 people after cop caught on video planting drugs in innocent woman's vehicle",
    "content": "Wester is extremely nice to the woman, complimenting her, joking around, and making small talk. But in the back of his mind, he knew the entire time that he was going to plant meth on her and have her thrown in a cage-an insidious move indeed.\n\nthe system began to go after\n\nA single cop framed dozens of innocent people and once a state attorney found the body camera footage from the arrests, the victims were vindicated.Dozens of innocent people who were rotting in jail have been freed and their charges erased after the corrupt cop who put them there was. Jackson County Sheriff's Deputy Zachary Wester has since been fired and a slew of lawsuits are now rolling in.Wester's fall from law enforcement grace and theare due largely in part to the diligence of a single person, assistant state attorney at the 14th Judicial Circuit, Christina Pumphrey.Pumphrey's job as assistant state attorney included reviewing evidence before moving forward with charges against individuals. When she began reviewing cases, she found something very peculiar.\"This is an exaggeration, but it felt like his (Wester's) name was on half the cases,\" Pumphrey told The Appeal. When Pumphrey began watching the body camera footage from Wester's arrests, she found something even more disturbing. Many times,. Also, his written affidavits did not match what she watched in the videos. But that wasn't the most telling aspect of all these videos.While it is no question that folks will claim that drugs found on them or in their possession \"aren't their's\" and \"they don't know how that got there,\" nearly all of Wester's cases had this. The videos showed that people were utterly shocked when Wester claimed to have found drugs in their vehicles. While a single person may have been lying,Although she reviewed multiple videos, Pumphrey never saw the actual act of Wester planting drugs or otherwise hiding them. However, all that changed when Wester pulled over Teresa Odom in February of 2018.In that video, Wester pulls Odom over, claiming her tail lights aren't working. However, it would later be revealed that her tail lights were, in fact, working fine and Wester had targeted her to frame her.In the video,After threatening to have a K-9 come search her car, Wester tells Odom that she can avoid the K-9 if she just lets him search her truck himself - a huge mistake.As the body camera shows, Wester opens the door to Odom's truck and is cupping a small baggie with a white powder in it.Wester would plant the substance under a red towel in her truck and then pretend to find it later.After Pumphrey began to raise red flags in her department pointing out videos like Odom's, she saysAs The Appeal reports:Apparently, it wasn't just Wester who had an interest in locking up innocent people.Pumphrey said. \"When it was ignorance it was one thing, but as soon as we know there are innocent people sitting in jail and we don't drop the charges, we're as guilty as he is.\"Although Wester was fired after Pumphrey exposed him,claiming they are still looking into it.Also, although these 119 people were vindicated, and a possible 30 more could be, they still face challenges from being framed.\"People still had consequences. It wasn't like this was just all erased,\" Pumphrey said. Dropped charges still remain on a person's criminal record. And \"even though the charges got dropped. Or you've got people who have to spend money on supervision fees; they have to spend money paying for their own urine analysis test; they've done community service hours; they paid cost of bond - like $1,500. ... You're not getting back six months of your life. Or you're not getting back the job that you lost because you sat in jail for a week before your girlfriend could get the bond money.\"The next time someone tells you that obeying the law will keep you out of trouble with police, show them this article.",
    "author": "",
    "url": "https://www.sott.net/article/415969-Charges-dropped-for-119-people-after-cop-caught-on-video-planting-drugs-in-innocent-womans-vehicle",
    "published": "2019-07-01 14:19:40+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}