{
    "data_id": "5035",
    "id": "activistpost--2019-07-23--Cops Mistakenly Raid Innocent Familys Home 3 TIMES in Just 4 Months",
    "date": "7/23/2019",
    "source": "activistpost",
    "title": "Cops Mistakenly Raid Innocent Family’s Home 3 TIMES in Just 4 Months",
    "content": "Chicago, IL — Because of their gross negligence and incompetence, the city of Chicago is facing a slew of lawsuits for raiding the homes of innocent people — allegedly by mistake. TFTP has reported on several of these lawsuits in which cops raided a four-year-old’s birthday party and held other children at gunpoint. Now, however, we have learned that one of these families has been raided — mistakenly — three times in just the last four months.\n\n“There was no time to breathe in between,” said Krystal Archie, 38, whose home in the 6800 block of South Dorchester Ave has been repeatedly raided by incompetent and often extremely rude cops. “I’d get my house together, and they were back in my house.”\n\nAl Hofeld Jr., whose law office represents multiple families who’ve been wrongfully raided by incompetent Chicago police, held a press conference Friday to address the issue.\n\n“There is a silent epidemic of trauma being perpetrated upon the children and families of the South and West sides of our city by Chicago police barreling into the wrong homes, holding guns on children, handcuffing children … ,” Hofeld said.\n\nHofeld has filed half a dozen lawsuits in recent months, claiming in each that children have been traumatized by gun-wielding cops bursting into homes during raids. Each time police came to Archie’s home — between February and May — they came in search of illegal drugs and someone who doesn’t live in her apartment, according to the suit, filed in U.S. District Court. A spokesman for the city’s Law Department said Friday said he he had not seen the lawsuit and so could not comment. Archie said it has cost her hundreds of dollars every time she’s had to clean up after the police have come through. She says she expects them to come again.\n\n“We have to now look over our shoulders, and who we look for to protect us … we can’t see them in that light any more,” she said.\n\nArchie explained to FOX 43 that not only were the officers who repeatedly raided her home unapologetic, but they also made fun of the family as they held Archie and her four children, aged 7-14, at gunpoint.\n\nArchie told FOX 43 that the officers burst in, pointed guns at their heads and destroyed the furniture. They also said the officers made jokes while raiding the home.\n\nArchie’s children now live in constant fear of armed terrorists barging into their home at any time. Sadly, however, they have no recourse, because these armed terrorists are police officers.\n\nAccording to FOX 43, when Archie asked police why they kept raiding her home, she said one officer told her they needed to figure out what was going on with her neighbors. She said he implied CPD was targeting her apartment because she had a connection to her neighbors, which she said she did not.\n\nPolice now claim to be investigating these raids, but if history is any indicator, it will have little to no effect on innocent families being terrorized by Chicago’s finest.\n\n“Chicago police officers behave as if our children of color and their trauma is collateral damage in Chicago,” said Holfield.\n\nAnd he’s right. As TFTP reported earlier this year, when Samari Broswell, 7, was celebrating her younger brother, TJ Broswell’s 4th birthday earlier this year, she never expected to see 17 heavily armed cops come smashing through her door. However, thanks to a severe case of police incompetence, that is exactly what happened.\n\nNow, just like Archie’s family, this family is left traumatized while people who claim to ‘protect’ them instead ignore them and continue the same practice. In the Broswell’s case, police claim video from officer-worn body cameras showing the horrifying raid simply went “missing.”\n\nBut that is not all.\n\nOn March 15, Alberta Wilson says Chicago police woke her up, along with her four children as cops forced their way into her home. It was below freezing outside with ice on the ground and despite this fact, the entire family was forced from the home and made to stand in the freezing rain.\n\nThinking he was a threat, the cops even handcuffed Wilson’s 8-year-old son Royal, who was also forced to stand in the freezing cold.\n\n“They are afraid to go to the washroom, they are afraid to sleep by themselves, they are very nervous and jump,” Wilson said of her children after the raid.\n\nAlso, just last August, two little boys who used to look up to police were traumatized and their view of police tarnished after a SWAT team burst into their home at night and held the entire family at gunpoint, including the children. The family was innocent and just like the above cases, the raid was on the wrong home.",
    "author": "Activist Post",
    "url": "https://www.activistpost.com/2019/07/cops-mistakenly-raid-innocent-familys-home-3-times-in-just-4-months.html",
    "published": "2019-07-23 17:32:12+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}