{
    "data_id": "505357",
    "id": "sottnet--2019-08-28--Cops put a gun to innocent mans head over window tint stop",
    "date": "8/28/2019",
    "source": "sottnet",
    "title": "Cops put a gun to innocent man's head over window tint stop",
    "content": "If ever you think that all traffic laws are for your safety, one thing can change that view — window tint. In the land of the free, if police feel that your window tint is too dark, they will claim the right to extort money from you. If you resist this extortion, police will claim the right to kidnap or kill you. Unfortunately, in the land of the free, these instances happen so frequently that they are often caught on video too. As the following incident illustrates, fearful cops whose only tool is the escalation of violence, will not hesitate to resort to deadly force over a stop for window tint.A video was submitted to the Free Thought Project this week showingIn California, police officers who target people for extortion over window tint have the option of issuing those folks a fix-it ticket. These tickets give the owner of the vehicle a certain time frame in which to correct the supposed violation. Typically, you pay a smaller fee and then prove that you \"fixed\" the problem, like remove the window tint or fix a broken taillight.Ornelas' fix-it time frame had not yet expired and he was still within the law. This did not matter to these officers though, who just knew they had nabbed themselves a criminal.Police then told Ornelas that he had a missing front license plate, which Ornelas already had a fix it ticket for as well. They then told him they saw him recklessly driving. However, once again, Ornelas had his entire drive recorded on the same dash camera that was recording cops, proving he did no such thing.During the stop, multiple officers continued to press this innocent man until another officer on a power trip approached the car. At this point, Ornelas asked her if this was \"Nazi Germany\" as his harassment was not keeping anyone safe and akin to a \"papers please\" shakedown.This comment seemed to push the officer over the top. She then asked Ornelas if he had any weapons and in California, you are legally required to tell police where it is when they ask. Ornelas told officers that he had a legally registered gun in his trunk and all hell broke loose.The frightened cop then pulled out a gun and held it to Ornelas' head. Naturally, this frightened the innocent man, who likely thought he was about to be killed. Ornelas cooperated with every single one of the officers' command as he was dragged from the vehicle.\"This is exactly why I wanted a supervisor,\" Ornelas says as he's being handcuffed at gunpoint over window tint.\"Stop resisting,\" the female cop says when it is clearly evident from the video that no such resisting is happening.When Ornelas asked once more why they were detaining him, once more, the officer could not give him a straight answer and said, \"when we pulled you over, you were acting nervous.\"Ornelas was issued several citations during this stop, all of which he fought in court. This stop happened in November of 2018, but Ornelas just went to court for it this month. And, because he filmed the entire interaction, he won. He beat all the charges, which is why he decided to release the video below.Below is a video showing how police extortion for window tint can and will lead to your life being threatened by those sworn to uphold the Constitution.The Free Thought Project reached out to the Sacramento police department for a statement on this incident and we have not yet received a response.",
    "author": "",
    "url": "https://www.sott.net/article/419359-Cops-put-a-gun-to-innocent-mans-head-over-window-tint-stop",
    "published": "2019-08-28 10:28:08+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}