{
    "data_id": "5377",
    "id": "activistpost--2019-08-24--Houston Cop Who Lied About Raid that Killed Innocent CoupleCharged with Murder",
    "date": "8/24/2019",
    "source": "activistpost",
    "title": "Houston Cop Who Lied About Raid that Killed Innocent Couple—Charged with Murder",
    "content": "Houston, TX — The murder of an innocent Houston couple made national headlines earlier this year as police took to smearing their names and threatening those who didn’t believe their official narrative. As the months passed, we learned that the Houston police department’s raid on the home of Dennis Tuttle and Rhogena Nicholas was based on lies and they were murdered for no reason. In May, the case had reached a turning point after the family hired a forensics expert to examine the home and found that there is no evidence the officers encountered gunfire. And, moments ago, the cop who lied to attain the warrant for the raid—was charged with murder in the first degree.\n\nEx-case agent Gerald Goines on Friday was hit with two counts of felony murder and is still under investigation over claims he stole guns, drugs and money, Harris County District Attorney Kim Ogg announced at a news conference downtown. His partner, Steven Bryant, was also charged with one count of witness tampering. Both men are expected to turn themselves in by the end of the day, but prosecutors said a review of more than 14,000 cases and a broader investigation into the rest of the squad is still underway.\n\n“We have not seen a case like this in Houston,” Ogg said. “I have not seen a case like this in my 30-plus years of practicing law.”\n\n“Based on everything we’ve seen so far, that’s certainly something that should happen,” Mike Doyle, an attorney representing family members said, “but it really can’t be the ending point based on what we’ve uncovered so far.”\n\nAs we reported in March, these lying cops could be responsible for putting away hundreds of innocent people. Houston District Attorney Kim Ogg previously announced that 1,400 cases tied to Officer Goines are in question. And now, her office estimates that at least 800 more cases could be tainted which are tied to Bryant.\n\nIt is important to point out that the only likely reason these officers have been charged is because outside sources in the family stepped up and not only demanded answers but found them.\n\nAccording to the forensics experts hired by the family of the victims, the officers who suffered bullet wounds during the raid on the innocent couple’s home were shot by their fellow cops. This is a direct challenge to the official narrative which states the officers were forced to kill the couple after the couple opened fire on them.\n\nIt is important to point out that even if the couple did open fire on the officers, the officers were in plainclothes when they kicked in the door to the home and fired first and killed their dog. However, this appears to never have happened.\n\nAccording to police, when they kicked in the door to the home they were forced to shoot the couple’s dog, at which point Tuttle grabbed his .357 Magnum revolver and opened fire on the officers. Then, according to police, Nicholas moved in to disarm one of the officers, so they shot and killed her. However, according to the forensics experts, there is no evidence of this.\n\nFurthermore, the forensics team noted that police never really investigated the crime scene and left behind mountains of evidence showing what really transpired.\n\n“It doesn’t appear that they took the basic steps to confirm and collect the physical evidence to know whether police were telling the truth,” said attorney Mike Doyle. “That’s the whole point of forensic scene documentation. That’s the basic check on people just making stuff up.”\n\nThe independent forensic investigation was conducted over the course of four days by forensic expert Mike Maloney, a retired supervisory special agent with the Naval Criminal Investigative Service.\n\nHis findings were nothing short of bombshell and imply that the Houston police department is engaged in a massive cover-up.\n\nAs the Houston Chronicle reported, “though police said they started shooting when the dog lunged as they came through the door, Maloney’s forensics team found that the dog was shot and killed at the edge of the dining room, 15 feet from the front door. Authorities never picked up the shotgun shell when they collected evidence.”\n\nWhat’s more, the forensics team found no evidence that bullets were fired from the back of the house, where police claim Tuttle opened fire on them, toward the front door, where police claim they were shot.\n\n“The initial bullet trajectories appear to be somewhat contradictory,” said Louisiana-based attorney Chuck Bourque, who is also representing the Nicholas family. “We see no evidence that anybody inside the house was firing toward the door.”\n\nThe bullet holes through the front of the house, that police claim came from the inside, were actually fired from outside the home at least a foot away, into the house, according to the forensics team.\n\n“You can’t see into the house from there,” Bourque said, “you’re firing into the house through a wall.”\n\nRandomly firing through a wall into a house where your fellow cops are standing is a good way to shoot your fellow cops. While the forensics team didn’t speculate, the evidence points to a story that unfolded far differently than what police are saying. And now, police are acting on the actual story.\n\nIt appears that when police kicked in the door and began shooting, the officers outside the home began firing into the home, shooting both cops and the innocent couple in the process. Thinking they were under fire from the couple, the other cops then shot and killed Tuttle and Nicholas. Even more damning is the fact that the forensics team found no evidence Tuttle’s .357 was ever fired in the home and the only bullets pulled from the walls were .223 and .45 caliber—which came from police. The forensics team also noted that the amount of evidence left behind by police was overwhelming, which means there was no way they could’ve actually conducted a thorough enough investigation to determine if the officers were telling the truth. “I can’t explain why all that was left — that sounds like something only the Houston Police Department and investigators can answer,” said former Houston Police Chief Charles A. McClelland. “If that evidence is connected to that shooting scene, I’d certainly be asking questions.” Sam Walker, a criminal justice professor at the University of Nebraska at Omaha, called it “sloppy” and said the uncollected evidence raises other questions, according to the Chronicle. “How many people have been convicted over the years as a result of sloppy investigations which failed to collect evidence that was there that would have exonerated the suspect?” he asked. “If they do it in this kind of a homicide case, what do they do in other kinds of investigations?” Matt Agorist is an honorably discharged veteran of the USMC and former intelligence operator directly tasked by the NSA. This prior experience gives him unique insight into the world of government corruption and the American police state. Agorist has been an independent journalist for over a decade and has been featured on mainstream networks around the world. Agorist is also the Editor at Large at the Free Thought Project, where this article first appeared. Follow @MattAgorist on Twitter, Steemit, and now on Minds. Subscribe to Activist Post for truth, peace, and freedom news. Follow us on Minds, Twitter, Steemit, and SoMee. Become an Activist Post Patron for as little as $1 per month. Provide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.",
    "author": "Activist Post",
    "url": "https://www.activistpost.com/2019/08/houston-cop-who-lied-about-raid-that-killed-innocent-couple-charged-with-murder.html",
    "published": "2019-08-24 00:30:17+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}