{
    "data_id": "53980",
    "id": "birminghammail--2019-01-11--Smirking killer of Small Heath grandma Riasat Bi jailed for life after own dad went to police",
    "date": "1/11/2019",
    "source": "birminghammail",
    "title": "Smirking killer of Small Heath grandma Riasat Bi jailed for life after own dad went to police",
    "content": "The smirking killer of grandma Riasat Bi has been jailed for life - after his own dad told police his son may have been involved in her murder.\n\nMadni Ahmed, 20, repeatedly knifed the 86-year-old at her home in Aubrey Road, Small Heath, where he had also stabbed her grandson as he slept.\n\nThe crazed killer, of Cavendish Road, Stoke on Trent, launched the frenzied and motiveless attack after buying knives online using his brother's ID.\n\nHe was found guilty of murder, attempted murder, being in possession of an offensive weapon and affray after a trial at Birmingham Crown Court.\n\nAhmed smirked as was sentenced to life in prison today, where the judge set a minimum term of 36 years.\n\nHe stabbed Riasat Bi’s 18-year-old grandson 15 times as he slept in the front room of the family home, before fatally stabbing Mrs Bi and leaving her with more than 25 injuries on the morning of July 12.\n\nHe then continued upstairs where he was met by another grandson who ordered him to leave before grabbing a knife in self-defence. Ahmed refused to leave and following a scuffle he received a slash wound to his arm.\n\nThe killer fled the house via the attic window, ditching his knife in the roof guttering before jumping into a neighbour’s garden.\n\nAhmed’s blood was later found on the fence panels as he stumbled through the garden and into a neighbour’s house, grabbing a knife from the kitchen.\n\nHe made his way down Coventry Road before ditching his blood soaked clothes on Malmesbury Road. He had called a taxi to collect him from The Akers Trust to take him back to a hostel in Newtown.\n\nHowever, later that evening, Ahmed was arrested at a hospital in Stoke-on-Trent after detectives traced the phone he had been using throughout the day.\n\nThe court heard Ahmed's own father had gone to police to say his son could have been involved after hearing about the murder and seeing Whatsapp footage of the killer leaving the scene.\n\nSpeaking after the case, Miss Bi's daughter - who asked not to be named - told how the tragedy had 'devastated' the close-knit family.\n\nShe said: \"My mom had three children and six grandchildren - the youngest is only four.\n\n\"We have tried to stay strong and positive for the children - we want them to know whatever they are going through we will be there for them.\n\n\"I was so very close to my mom - I saw her every day.\n\n\"She was so gentle and kind and had no enemies - she was loved by everyone.\n\n\"She wasn't just our mom - she was a mom to so many other people.\n\n\"She didn't have a bad bone, she loved and cared for everyone she met.\"\n\nDetective Inspector Harry Harrison, from Force CID, said: “This was a pre-meditated attack, with Ahmed intent on killing someone that day by taking a knife to the home of an elderly lady.\n\n“Ahmed claimed that he was looking for someone at the address and when he couldn’t find who he was looking for, he attacked Riasat’s grandson while he was sleeping, leaving him with life changing injuries. He then went on to carry out a horrifying attack on a defenceless elderly lady.\n\n“This was a horrendous and violent attack and although no sentence will ever compensate for what Ahmed has caused this family, I hope they can find some closure in that justice has been served today.\"",
    "author": "birminghammail",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/smirking-killer-small-heath-grandma-15663480",
    "published": "2019-01-11 12:39:27+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}