{
    "data_id": "54138",
    "id": "birminghammail--2019-01-13--Innocent dad has Universal Credit stopped - because civil servants think hes in Birmingham Prison",
    "date": "1/13/2019",
    "source": "birminghammail",
    "title": "Innocent dad has Universal Credit stopped - because civil servants think he's in Birmingham Prison",
    "content": "An innocent single dad had his Universal Credit stopped – because civil servants said he was in Birmingham Prison.\n\nLee Carroll said the wrangle with bureaucrats was the worst experience of his life.\n\nThe 36-year-old, who lives on Merseyside with his ten-year-old daughter, said he was left feeling \"like a criminal\" as his claims of innocence fell on deaf ears.\n\nHe even held his phone up so the civil servants he was dealing with could hear the noise of everyday life in a bid to prove he was not in the Winson Green jail.\n\nLee, who works in a Novotel in Liverpool, said: “I have never been in prison, on bail, or wanted by police.\n\n“I was made to feel like I had done something wrong, like I was a criminal. I even said to them how can I be ringing you now on my mobile from prison, when prisoners don’t have mobiles?\n\n“And I put the phone up so they could hear noise in the background of traffic and music, while I was walking through town.’”\n\nLee told the Liverpool Echo he went to police for help, wrote to his MP and contacted Action Fraud. He added: “I told the DWP my employer had said she would send in a letter and told them to check my earnings.\n\n“I said I could fax them over, but they just left me with no money.”\n\nHe contacted the Department for Work and Pensions after he noticed his monthly payment had been suspended.\n\nBut an advisor told him he would not be receiving the money because “he was in prison in Birmingham”.\n\nIt is believed the error was caused because another man with the same name and date of birth as Lee was on the system.\n\nNow the DWP has apologised and said the mistake was caused by an “administrative error”.\n\nLee, who was due a £751 payment in January, said: “It is the worst thing that has ever happened to me in my whole life.\n\n“I knew I was going to get the payment on a certain date so you sort of budget for that date.\n\n“All my last wage in December went on Christmas and council tax. I don’t have family I can turn to for help.\n\n“I am one of those people that is going out to work to save them money and then they do this. I get up and go to work and still take my daughter to school. It is just shocking what they have done.”\n\nA spokeswoman for the Department for Work and Pensions said: “ We have apologised to Mr Carroll for this administrative error and reinstated his benefit payments immediately.”",
    "author": "James Cartledge",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/innocent-dad-universal-credit-stopped-15645081",
    "published": "2019-01-13 05:30:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}