{
    "data_id": "54789",
    "id": "birminghammail--2019-01-20--Convicted killer who murdered his wife and baby is son to be proud of",
    "date": "1/20/2019",
    "source": "birminghammail",
    "title": "Convicted killer who murdered his wife and baby is 'son to be proud of'",
    "content": "The father of a man sentenced to spend the rest of his life in a US prison for killing his wife and baby said: “He is a son to be proud of.”\n\nCliff Entwistle and wife Yvonne remain convinced their son is innocent, and have carried out an investigation into the evidence that jailed him.\n\nFormer computer programmer Neil Entwistle, 40, lived in Redditch before moving with wife Rachel to Carver, Massachusetts.\n\nHe was convicted of the deaths in June 2008, and sentenced to life imprisonment with no chance of parole.\n\nHis father, a councillor in Bassetlaw, Nottinghamshire, said: “He is holding up.”\n\nThe case against Entwistle seems compelling. He was in the family home at the time of the deaths and flew back to England, with the intention of seeing his parents Cliff and Yvonne, hours after the crime.\n\nHe was arrested on the London Underground in February 2006, and voluntarily extradited to America.\n\nHis father, however, remains adamant the case against his son is flawed, and the legal process tainted.\n\nHe is furious a book on the case, which made legal headlines, was on sale on the very day the trial began, and painted the defendant as a cold-blooded murderer.\n\nNeil’s decision to fly to England was a “normal reaction”, Cliff insists. He was in a state of shock and his first thought was to come home.\n\nCliff has now written his own book, Neil’s Story: Trial by Media, in a bid to prove his son’s innocence.\n\nPublicity for the work states: “With remarkable objectivity, Cliff Entwistle reveals the inconsistencies in the investigation, the lies told and the key forensic evidence withheld from the medical examiner, and with touchingly personal candour, he shares the pain he felt at the great loss and betrayal his family suffered.”\n\nEntwistle met future wife Rachel Souza, an American studying abroad, while on an electronic engineering course at York University.\n\nThey married in 2003, then moved to Redditch, where Rachel taught English, drama and theatre studies at St Augustine’s Catholic High School.\n\nAfter moving to the States in 2005, they stayed with Rachel’s mother and step-father before getting their own home in Hopkinton, Massachusetts.\n\nThe bodies of 27-year-old Rachel and daughter Lillian, aged only nine months, were found in the rented property’s main bedroom on January 22, 2006. The mum had been shot in the head, her daughter in the stomach .\n\nEntwistle became a suspect after his DNA was discovered on the handle of a .22 handgun owned by his father-in-law, and Rachel’s DNA was on the muzzle.\n\nMiddlesex County district attorney Martha Coakley told a packed press conference: “With a firearm we believe he had secured at some time before that from father-in-law Joseph Materazzo, he shot Rachel Entwistle in the head and then proceeded to shoot baby Lillian, who was lying on the bed next to her mother.\n\n“We believe possibly this was intended to be a murder-suicide, but we cannot confirm that. Obviously the murder was effected, but the suicide was not.\n\n“We believe Neil Entwistle returned the gun to his father-in-law’s home in Carver, then made preparations to leave the country. As we know, he was observed at Logan International Airport (in Boston).\n\n“He purchased a one-way ticket on British Airways at approximately 5am on Saturday morning, January 22.\n\n\"He was on an 8.15am flight to the UK on that day. Based upon forensic information that linked the .22 handgun owned by Joseph Materazzo both to Neil Entwistle and to Rachel, we believed we had probable cause to seek a warrant for Neil Entwistle’s arrest.”\n\nEntwistle was convicted on June 25, 2008 , a local newspaper the Metrowest Daily News describing the verdict as a “foregone conclusion”. The prosecution made much of his interest in swingers’ sites and financial problems.\n\nThe court was told that, just four days before the murders, his user-name was used to search the web for the best way to kill someone.\n\nRachel’s mother Priscilla Mattarazzo said at the sentencing: “Our dreams as a parent and grandparent have been shattered by the shameful, selfish act of one person.\n\n“For him to have to hide behind the accusation of murder-suicide of this beautiful woman and perfect mother is low and despicable.\n\n“We were sentenced without the luxury of a trial by jury and now must go on with the eternity of emptiness.”\n\nThe murdered woman’s stepfather, Joe, looked Entwistle in the eye and said, slowly and deliberately: “Neil, you have been judged today by a jury of your peers on Earth, but one day, you will face the ultimate judgment of your horrific deeds and betrayals.”\n\nAn immediate appeal by Entwistle was rejected by the Massachusetts Supreme Judicial Court.\n\nHe still protests his innocence, backed to the hilt by his father, a former miner, despite shifts in the interpretation of events that day.\n\nEntwistle told detectives, during a recorded call Massachusetts detectives made to his parents’ home in Worksop, that he had returned home from an errand at 11am and discovered the two bodies. He covered them with a blanket, but did not contact the police.\n\nHe informed cops he was so distraught he intended to commit suicide, but, unable to end it all, flew home.\n\nHe rushed upstairs to discover Lillian dead and Rachel ready to shoot herself in the head.\n\nBefore the double killing, there had been clear signs Rachel was suffering from post natal depression, he says.\n\n“This gun was never conclusively proved to be the murder weapon,” he says.\n\n“And we all know DNA can be transferred.\n\n“ There are many things wrong with this case, but there is no-one out there who has the guts to say this, apart from ourselves.\n\n“What the media never portrayed, is that we had lost – and Neil had lost – a beautiful granddaughter and daughter.”\n\nTwo years ago, Cliff told his local newspaper, the Worksop Guardian: “I just don’t understand why this wasn’t brought up in court at all.\n\n“I remember one occurrence when Yvonne and I were speaking to her on the phone and she asked if we had received photos of Lillian from Christmas that she had posted over.\n\n“When we replied that we hadn’t, she put the phone down and, according to Neil, ran upstairs sobbing.\n\n\"She had been having problems since Lillian was born.”\n\nEntwistle, despite initially claiming he was out when the crime took place, used the same defence in a pen-pal letter written behind bars.\n\nHe wrote: “The truth is we can never truly know what goes through a person’s mind at such moments.\n\n“When I think back, I still wonder what went through Lilly’s mind, nine months old though she was, as she yelled out in pain.\n\n“Was she calling for her daddy to come and help?\n\n“Even Rachel, as her eyes met mine before she fired that fatal shot, seemed to be saying something, though she uttered not a word.”\n\nCliff believes a piece of “crucial forensic evidence” underlines the fact a terrible miscarriage of justice has taken place, and proves his son did not commit murder.\n\nAt the 2008 trial, Dr William Zane, the man who carried out the post-mortem examination on Rachel, said he did not know gunshot residue had been found on both sides of the woman’s hands.\n\n“This was hard cold evidence according to Neil’s defense attorneys,” Cliff maintains.\n\n“No such evidence has ever been found to prove that Neil committed this crime.\n\n“Withholding this evidence is perverting the course of justice. As soon as the revelation was revealed in trial the judge should have dissolved the case against Neil.\n\n\"The medical examiner in the trial admitted on the stand he would have wanted to know of this information if it was available to him.”\n\nDr Zane, however, did not see the revelation as significant. He said in court: “It only tells me she was in a room where a gun was fired.”\n\nShortly after his incarceration, he was tricked by white supremacists at Souza-Baranowski Correctional Center, in Lancaser, Massachusetts, the Boston Herald reported.\n\nFearing death threats from black gangs, he agreed to shave his head in exchange for protection from the right-wing extremists.\n\nBut once he’d taken a Bic-issue razor to his bonce, the Brit was told: “It’s a nice gesture on your part but we’re gonna kill you, too.”\n\nOne prison officer told the Globe: “He seems to have been very easily manipulated.“\n\nThe non-white inmates were threatening him, calling him a baby-killer. He apparently asked: ‘How do you distinguish who belongs to your group and who doesn’t?’\n\n“The white inmates eventually convinced him the only way he was going to have any safety was if he joined up with them.”\n\nEntwistle was later placed in protective custody, then transferred to a medium security prison in Bridgewater, Massachusetts.\n\n“With his wife and baby daughter found dead in their bedroom, Neil was the immediate suspect, and his subsequent conviction seemed inevitable to all who heard and read the sordid coverage.\n\n“However, things are not always what they seem.\n\n“You will be disturbed by the harrowing details he exposes of the justice systems of both the UK and the US, yet you cannot fail to be encouraged as he testifies to the strength and resilience of family bonds in the face of unimaginable heartache and adversity.”",
    "author": "Mike Lockley",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/convicted-killer-who-murdered-wife-15687488",
    "published": "2019-01-20 05:30:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}