{
    "data_id": "54980",
    "id": "birminghammail--2019-01-22--Family of speedboat crash victim demand action to catch her fugitive killer",
    "date": "1/22/2019",
    "source": "birminghammail",
    "title": "Family of speedboat crash victim demand action to catch her fugitive killer",
    "content": "The family of Charlotte Brown, who died after a speedboat crash, will demand to know what is being done to catch her fugitive killer in a meeting with the Home Secretary.\n\nJack Shepherd, 31, is still on the run after he was sentenced to six years imprisonment for manslaughter by gross negligence in his absence last summer, after vanishing before his Old Bailey trial.\n\nMs Brown, 24, was killed after the boat he had bought to \"pull women\" flipped into the icy waters of the River Thames during her champagne-fuelled first date with Shepherd in December 2015.\n\nHer father, Graham Brown, mother Roz Wickens and sister Katie, will meet Sajid Javid on Tuesday to seek assurances that everything possible is being done to bring on-the-run Shepherd to justice.\n\nMr Brown said: \"Jack Shepherd has stolen a beautiful life and needs to atone for his crass and reckless actions.\n\n\"If it wasn't for this our lovely Charlotte would still be here.\n\n\"We want to hear from the Home Secretary on what action is being taken to bring Shepherd to justice.\n\n\"We also want to know that this operation will be fully resourced until he is found and put behind bars.\"\n\nThe family will ask Mr Javid what action has been taken so far, what current lines of inquiry are open and about the resources available to police, including through the National Crime Agency (NCA).\n\nThey also want to know what can be done to obtain digital forensic evidence from web designer Shepherd's contact with his lawyer, which could help to pinpoint his location.\n\nShepherd's solicitor Richard Egan has previously denied \"protecting a fugitive\" despite helping him to appeal against his conviction while on the run from the law.\n\nIn December, he was given permission to challenge his conviction, sparking an outpouring of public anger, with Ms Brown's family accusing Shepherd of making a mockery of justice.\n\nSince then, uncorroborated theories about Shepherd's whereabouts have included Turkey, Thailand and Georgia.\n\nMs Brown's family's meeting with the Home Secretary in the House of Commons was arranged by Communities Secretary James Brokenshire, their local MP for Old Bexley and Sidcup\n\n\"In seeking this meeting for the family I want to ensure that the full efforts of our law enforcement agencies are being used to arrest Shepherd,\" he said.\n\n\"It is unacceptable that Charlotte's family still have not seen the justice they rightly deserve.\n\n\"There can be no hiding place for this man and we must be utterly resolute in seeing that Shepherd pays for his crime.\"",
    "author": "birminghammail",
    "url": "https://www.birminghammail.co.uk/news/uk-news/family-speedboat-crash-victim-demand-15711612",
    "published": "2019-01-22 06:43:59+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}