{
    "data_id": "55051",
    "id": "birminghammail--2019-01-23--Birmingham mum jailed for 12 years for throwing boiling water over convicted killer",
    "date": "1/23/2019",
    "source": "birminghammail",
    "title": "Birmingham mum jailed for 12 years for throwing boiling water over convicted killer",
    "content": "A Birmingham mum who threw boiling water over a convicted prisoner has been jailed for 12 years.\n\nNatalie Roberts attacked Josie Hollis while they were both on remand at HMP Foston Hall in Derbyshire.\n\nHer trial at Derby Crown Court in December was told how there had been tensions between them on the wing where they were both based.\n\nRoberts was a serving prisoner while Hollis was awaiting trial on charges of murder and robbery.\n\nHollis said in the build-up to the kettle incident Roberts, of Broughton Road, Handsworth, had “constantly abused” her in “social” areas of the jail such as the canteen.\n\nShe said moments before it happened she had been supporting another inmate who was being verbally abused by a third prisoner.\n\nIt was then that Roberts called out “murderer”.\n\nHollis, who later admitted to the manslaughter of a Sheffield man, went into the defendant’s cell to confront her.\n\nThe 35-year-old then threw the freshly-boiled water over her.\n\nWhen Roberts was found guilty of causing grievous bodily harm with intent, she shouted to the jury that convicted her she would “kill herself and come back to haunt them” .\n\nAccording to Derbyshire Live, she has now told a probation officer she “wishes she had killed the b***h” referring to throwing the water over Miss Hollis.\n\nSentencing Roberts, Recorder David Mason QC said: “This was a horrendous offence which has left Miss Hollis with permanent scarring to the left side of her body.\n\n“You tried to pour a kettle full of boiling water over her head which I believe shows an intention to cause even more serious injuries than those you did.\n\n“I have read your pre-sentence report and in it you said to the probation service on more than one occasion ‘I wish I had killed the b***h’ which does not help your situation.\n\n“You took the case to trial and were found guilty of GBH with intent so I cannot give you any credit.”\n\nAt the time of the incident on July 27, 2017 - Hollis was awaiting trial for the murder of 23-year-old Jordan Hill, who died shortly after an attack in the hallway of his flat in Southey Avenue, Sheffield, on March 23, 2017.\n\nThat trial, in February of last year, saw 32-year-old Bradley Onfroy found guilty of murder and robbery following a trial at Sheffield Crown Court.\n\nHe was ordered to serve a minimum term of 33 years.\n\nHollis, 24, pleaded guilty to manslaughter and robbery at a previous hearing and was jailed for 15 years.",
    "author": "Katie Brooks",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/birmingham-mum-jailed-12-years-15719802",
    "published": "2019-01-23 11:34:49+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}