{
    "data_id": "55144",
    "id": "birminghammail--2019-01-24--Convicted child killer David Gaut lied to neighbours David Osborne Ieuan Harley and Darran Evesham",
    "date": "1/24/2019",
    "source": "birminghammail",
    "title": "Convicted child killer David Gaut 'lied to neighbours David Osborne, Ieuan Harley and Darran Evesham about his crime'",
    "content": "A convicted child murderer lied to his new neighbours that he was jailed for over 32 years for killing a soldier, a court heard.\n\nThree men, David Osborne, 51, Ieuan Harley, 23, and Darran Evesham, 47, are on trial accused of murdering David Gaut, 54, by stabbing him over 150 times after learning he had killed a child.\n\nNeighbour Kyle Alford said he first met Mr Gaut, known as Dai, when he moved into his block of flats in Long Row, New Tredegar, Caerphilly, south Wales, just six weeks before his death.\n\n\"He said he had been released from prison for serving 33 years for killing a soldier, at first,\" he told Newport Crown Court.\n\nMr Alford said he and his partner Samantha Jenkins became suspicious of their new neighbour and began to search the internet.\n\nHours before Mr Gaut was killed on August 2 last year, they learnt he had in fact been jailed for murdering 15-month-old Chi Ming Shek in 1985.\n\nThe pair told other neighbours, including Osborne, what they had learnt.\n\n\"It was almost as if Ozzy didn't believe it and didn't seem too bothered. He made a comment that Ieuan would probably want to cut him up and put him down the plughole,\" Mr Alford said.\n\n\"Ieuan was shocked and angry. He had been drinking and under the influence, or coming down, from amphetamine. He said he had been taking amphetamine.\n\n\"He was annoyed, calling him things like a 'dirty f*****' and saying, 'He wasn't even a child, he was a baby'.\"\n\nMs Jenkins told the jury it took some time to discover the truth about Mr Gaut.\n\n\"We were spelling his name wrong and it came up in Ozzy's and we were in shock when it came up,\" she said.\n\n\"Ozzy said he would text him about films or something. Ieuan said Ozzy can get him round here and Ozzy can hide in the kitchen.\"\n\nMr Alford and his partner returned to their flat and a short time later they sent a text message to Osborne, saying: \"Don't let Dai know we all know he's a baby killer. Catch the FK. N out. Dirty nonce c***. WA\"\n\nProsecutors allege Mr Gaut was stabbed over 150 times after being lured to Osborne's flat by the three defendants.\n\nHis fingernails were also cut off and after his death the three men dragged his body back to his own flat.\n\nThe following day Harley went to Mr Alford's flat with half a leg of lamb he had stolen from Morrisons and they chatted about Mr Gaut.\n\nMs Jenkins said: \"Kyle said, 'It's terrible about what we learnt about Dai' and Ieuan said, 'Don't worry about him, you won't be seeing him again'.\"\n\nOsborne, from Long Row, Elliots Town, New Tredegar; Harley, of no fixed address, and Evesham, from Powell's Terrace, New Tredegar, all deny the murder of Mr Gaut, between August 1 and August 4 last year.\n\nHarley and Evesham also deny a charge of perverting the course of justice, which Osborne admits.",
    "author": "James Rodger",
    "url": "https://www.birminghammail.co.uk/news/uk-news/convicted-child-killer-david-gaut-15729446",
    "published": "2019-01-24 19:54:19+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}