{
    "data_id": "55519",
    "id": "birminghammail--2019-01-28--Familys heartbreaking words as killer neighbour John Nixon sentenced to 15 years",
    "date": "1/28/2019",
    "source": "birminghammail",
    "title": "Family's heartbreaking words as killer neighbour John Nixon sentenced to 15 years",
    "content": "\"No sentence will ever be the right result, we’ll never get justice,\" were the words issued as friends and family of tragic murder victim Reece Hipwood streamed out of a packed courtroom.\n\nThe popular 28-year-old - described as a \"proper lad\" by those who knew him - was killed after a drunken row with his next-door neighbour, John Nixon.\n\nMechanic Nixon, aged 54, stabbed Mr Hipwood seven times during a fight at his home in Sandmere Road in the early hours of July 15 last year.\n\nMr Hipwood, whom Nixon described as being like a son to him, ran upstairs and attempted to defend himself with a vacuum cleaner.\n\nNixon, though, proceeded to attack Mr Hipwood and stabbed him repeatedly with a large kitchen knife, with one blow measuring 12 centimetres.\n\nThe stabbing was witnessed by Nixon's 11-year-old son as his partner, Leigh-Anna Hunt, wrestled the blade from his grasp and immediately called for an ambulance.\n\nDespite heroic efforts by police and paramedics, Mr Hipwood suffered a cardiac arrest and was pronounced dead just after 2am.\n\nAt Birmingham Crown Court today (MON), Nixon - who appeared emotionless in the dock - was sentenced to life and will serve a minimum of 15 years behind bars.\n\nJudge Inman branded the murder as \"an utterly senseless killing\" as both sets of relatives and friends remained calm in - and outside - the courtroom.\n\nUpon leaving the court after sentencing, Mr Hipwood's heartbroken fiancée Bethany Tonry was comforted by around 20 or so family members.\n\nSpeaking to BirminghamLive at the end of the trial, a relative of Mr Hipwood said: \"No sentence will ever be the right result, we’ll never get justice.\n\n\"We don’t get to see [Reece] ever again.\"\n\nThe victim's fiancée, Miss Tonry, had dreams of family life together with Mr Hipwood after moving into their home in Sandmere Road.\n\nIn a statement, Miss Tonry said: \"Reece was a really bubbly person. Full of life. He truly was the life and soul of the party.\n\n\"It was our home and the place we had decided to start a family.\n\n\"Sadly, our future was ripped apart and shattered.\n\n\"He had many passions in life.\n\n\"My whole life has changed. I have lost the person I intended to spend the rest of my life with.\n\n\"We were always together, especially at night.\n\n\"I have had to have a significant time off work. I cannot believe that someone who with whom he had a good relationship with took his life.\"\n\nThe victim's father, Jonathan Hipwood said: \"Our world has been turned upside down. Our hearts have been smashed to smithereens.\n\n\"It is painful to know that the person who took his life still has a future.\n\n\"We cannot celebrate any more. We are not a complete family any more.\n\n\"There will be no wedding of Reece and Beth to celebrate.\n\n\"We have pictures of Reece around our house keeping his memory alive.\n\n\"It is hard to even talk about. None of us sleep properly.\n\n\"We feel like zombies going through the normal motions of life.\n\n\"It all comes back, the heartache.\"\n\nSpeaking after Monday's sentencing, Detective Inspector Caroline Corfield, from the force’s homicide unit, said: \"Nixon got into such an uncontrollable drunken rage that he carried out a horrifically violent attack in front of his own wife and son.\n\n\"There is no doubt that both men were drunk and had been fighting with one another, but the final attack on Reece had no justification.\n\n\"Reece was unarmed and completely unprepared to defend himself against Nixon’s frenzied assault with a knife.\n\n\"Our thoughts are with Reece’s family and we can only hope that justice being served on Nixon will give them some kind of closure and help them to come to terms with their loss.\"\n\nReece’s family spoke of their loss following the verdict.\n\nThey said: \"As a family - Reece’s mother, father, fiancée and sisters - we are happy that justice has been done for the loss of our son Reece, both for us and for Reece’s friends.\n\n\"We would like to take the opportunity to thank the paramedics and ambulance service for their efforts that tragic night, Adrian Keeling QC for prosecuting the case, the police and their family liaison officers, and Victim Support for their help through this process.\"",
    "author": "Ashley Preece",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/familys-heartbreaking-words-killer-neighbour-15744043",
    "published": "2019-01-28 17:02:03+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}