{
    "data_id": "55586",
    "id": "birminghammail--2019-01-29--Bloodstained clothing linked by DNA to murdered child killer David Gaut trial told",
    "date": "1/29/2019",
    "source": "birminghammail",
    "title": "Bloodstained clothing linked by DNA to murdered child killer David Gaut, trial told",
    "content": "Bloodstained clothing found dumped in a plastic bag matched the DNA of a child killer who was allegedly murdered by three men, a court has heard.\n\nDavid Gaut, 54, was allegedly lured to his death and stabbed 150 times in August at a block of flats in New Tredegar, Caerphilly, South Wales.\n\nDavid Osborne, 51, Ieuan Harley, 23, and Darran Evesham, 47, are on trial accused of murdering Mr Gaut after learning he had served more than 32 years in prison for murdering toddler Chi Ming Shek in 1985.\n\nNewport Crown Court on Tuesday heard there was a \"one in one billion\" chance that blood found on clothes stuffed in a B&M bag on a riverbank did not belong to Mr Gaut or a member of his family.\n\nProsecutors had earlier alleged the defendants were caught on CCTV before Mr Gaut's death wearing clothes matching those that were found.\n\nForensic scientist Martin Beale was taken by prosecutor Ben Douglas-Jones QC through the items, which included a heavily bloodstained T-shirt, tracksuit bottoms, a pair of socks and underwear.\n\nMr Beale said the white T-shirt displaying the logo Jamaica Brand Cannabis was found \"saturated\" in blood.\n\nHe said: \"There was heavy contact bloodstaining noted to the front right side. Some of this was smeared and diluted. Blood spots were also noted.\"\n\nMr Beale said the smearing occurred after \"a degree of force was applied to wet blood\".\n\nHe added: \"The chances of (blood) being from someone other than David Gaut or someone related to him are one in one billion.\"\n\nHe also said components of DNA found also matched Harley.\n\nMr Beale showed the jury the T-shirt and a pair of bloodstained grey Everlast tracksuit bottoms.\n\nHe said: \"I expect the T-shirt and jogging bottoms would have been worn at the same time, because of the blood pattern.\"\n\nMr Beale said the \"sheer quantity of blood\" found on the pair of black FCUK underpants led him to believe they were worn underneath the jogging bottoms.\n\nLast week the jury was shown CCTV of Osborne and Evesham walking near the riverbank following Mr Gaut's death.\n\nThe court previously heard Mr Gaut claimed he had been jailed for killing a soldier when he moved next door to Osborne, six weeks before his death.\n\nSuspicious neighbours found out his past as a child killer by searching the internet, and prosecutors allege the three defendants then \"lured\" him to Osborne's flat where he was murdered.\n\nMr Gaut was stabbed more than 150 times while still alive, and a further 26 times after he died, and his fingernails were also cut off post-mortem.\n\nOsborne, from Long Row, Elliots Town, New Tredegar; Harley, of no fixed address; and Evesham, from Powell's Terrace, New Tredegar, all deny the murder of Mr Gaut between August 1 and 4 last year.\n\nHarley and Evesham also deny perverting the course of justice, which Osborne admits.",
    "author": "James Rodger",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/bloodstained-clothing-linked-dna-murdered-15750837",
    "published": "2019-01-29 20:27:15+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}