{
    "data_id": "557",
    "id": "21stcenturywire--2019-08-28--Julian Assange Deprivation of Justice and Double Standards in Belmarsh Prison",
    "date": "8/28/2019",
    "source": "21stcenturywire",
    "title": "Julian Assange: Deprivation of Justice and Double Standards in Belmarsh Prison",
    "content": "\n\n A TALE OF TWO PRISONERS: Wikileaks founder Julian Assange and right-wing personality Tommy Robinson, are being treated very differently inside HM Belmarsh Prison.\n\n \n\n Nina Cross\n\n 21st Century Wire\n\nAlfred de Zayas, former UN Rapporteur, has described the actions of the British authorities in pursuit of Assange as “… contrary to the rule of law and contrary to the spirit of the law.”  What we see on the surface is an illusion of British justice, masking a political agenda behind it.\n\nBritain’s notorious Belmarsh Prison is now being presented as beacon of good governance, indicative of a fair and just society which equitable but firm with perpetrators. After carefully reviewing the case of Julian Assange though, there can be little doubt that placing the award-winning journalist in such a facility is nothing but the latest vehicle for his rendition to the US.\n\nSo far, Belmarsh has been fulfilling that state agenda.\n\nBelmarsh as the state’s next weapon of choice\n\nJudge Deborah Taylor sent Assange to category A Belmarsh prison for a bail-skipping offense, even though he’d demonstrated that he had good reason to skip bail.\n\nIt is difficult not to conclude that the category A assignment was done so that he would be weak and vulnerable.  In essence, Assange was sent to Belmarsh for 50 weeks for failing to turn up at a police station.  There was no ongoing court case; he had no prior offenses; there were no charges; the Swedish investigation had been dropped.  So skipping police bail was all the British government had. It should also be pointed out that Judge Taylor made a series of mistakes during the sentencing on 1st May, referring to rape charges in Sweden, which Assange corrected and which she then acknowledged were wrong.  This indicates that Judge Taylor went into court at least uninformed, set in her mind that Assange had somewhere, somehow been charged with rape. This would seem to explain some of the reasoning behind Judge Taylor’s cruel sentencing, described by the United Nations Working Group on Arbitrary Detention as ‘disproportionate’ but also as furthering the arbitrary deprivation of Assange’s liberty.  What’s more, it has been pointed out how several thousand people in the UK skip bail each year and are in now way subject to such harsh punishment.\n\nClearly, Judge Taylor had used narratives provided by the state in order to send Assange to a category A penitentiary, even though these narratives have been thoroughly debunked.  One of the false story lines promulgated by the British state and its mainstream media adjuncts, was that Swedish authorities had dropped its sex allegations case against Assange because it ‘could not progress with it’ while he was holed-up in the Ecuadorian embassy in London.  This piece of disinformation was false, shown by the fact that Swedish authorities had already carried out no less than 44 video link or in-person interviews with persons of interest and thus were more than capable of interviewing Assange too.\n\nAs for the case itself, the question has now become: what case?  Opened then shut, then opened again, then shut, then opened, and yet – Sweden’s office of Public Prosecutions still said at the time that, ‘an interview is not on the cards’.\n\nNot surprisingly then, Swedish authorities appear to be leaving the case hanging, as they have for years.  With the Swedish courts having recently thwarted the prosecutor’s attempts to extradite him to Sweden, is the reopened case now simply a crowd control tactic?  Perhaps they have opened it for a third time because closing the books permanently on the increasingly disingenuous ‘rapist’ narrative risks attracting increased support from those members of the public (and the government) who had been previously unsure about whether Assange was entitled to any moral support.  We wait to see when the Swedish prosecutor might decide whether a ‘interview is on the cards’ after hanging the label of rapist over Assange for nearly a decade already.\n\nAnd so with all the might the British establishment could muster behind a police bail skipping offence, it has Assange trapped inside Belmarsh prison.\n\nOn cue, HM Belmarsh Prison’s high security regime has so far proved crippling for Assange’s hopes of mounting a legal defence.  It is now public knowledge that government officials at Belmarsh have imposed restrictions which effectively deny Assange sufficient legal visits, deny him the ability to speak to his US lawyers, deny him access to and possession of legal documents, and deny him the basic means through which to prepare for his legal defence, namely, a laptop computer.\n\nFor those readers who may not be versed in legalese, the following points passages will demonstrate how one can measure Belmarsh’s treatment of Assange against recognised protections and guidelines, such as:\n\nArticle 6.3 of the European Convention of Human Rights, which is of particular significance for prisoners (Assange clearly qualifies a political prisoner) and states that detainees must:\n\n“… have adequate time and facilities for the preparation of their defence…”\n\nThe Council of Europe (CoE) has produced a definition of what this means in a guide on Article 6 of the ECHR:\n\nNOTE: During Assange’s US extradition court hearing in June, Assange himself was adamant that he had not even received the text of the US indictment against him and said that he had to have essential legal documents posted to him. His legal team also reiterated that preparation for his defense was being impeded and that access to their client was being restricted by the British government. It is difficult to argue that this strategy is not intentional.\n\nThe CoE human rights guidelines have also set out in its European Prison Rules that:\n\n23.6    Prisoners shall have access to, or be allowed to keep in their possession, documents relating to their legal proceedings.\n\n“A person facing criminal charges must have the time and facilities to prepare a defence. This right exists at all stages of the proceedings and encompasses the right to documents, files, and information as well as a guarantee of confidential communication with counsel.”\n\nIn May 2019, Nils Melzer, UN Rapporteur on Torture, reported that Assange had restricted access to legal documents in his cell.\n\nMore recently award-winning journalist John Pilger also reported how Assange was not permitted access to documents to prepare his defence:\n\nIn regard to Assange’s request for a laptop computer, the UK’s  Access to Justice guidelines shows this is a reasonable request and Assange’s case would seem to encapsulate the exact conditions covered by it:\n\n“The guidance does say that laptops should be given to people who could not prepare for their case properly without it, but should not be given if it would just make things more convenient.”\n\nThe CoE’s guide on Article 6.3 also legitimises the request:\n\nFollowing his assessment of Assange in May inside Belmarsh prison, Nils Melzer issued a statement detailing the conditions of dentention. Melzer was accompanied by two medical experts who specialize in the examination of possible victims of torture as well as the documentation of symptoms, both physical and psychological.  On examining Assange Melzer observed the following:\n\n“Most importantly, in addition to physical ailments, Mr. Assange showed all symptoms typical for prolonged exposure to psychological torture, including extreme stress, chronic anxiety and intense psychological trauma.“\n\nIn addition to these concerns, reports also indicate Assange is being medicated.\n\nMelzer has also explained that the piling-up of multiple legal proceedings is adding to Assange’s stress and inability to cope with the demands of preparing for his defence. Watch:\n\n.\n\n It is important to note that Assange’s legal preparations in this case have nothing to do with the spurious bail skipping charges for which Assange was initially apprehended and detained by the British government. Rather, his legal defence involves fighting what could become a defining legal precedent for this generation – an US extradition case where a non-US citizen faces charges under Espionage Act of 1917 for his role (as a journalist) in disclosing war crimes and crimes against humanity by the US government – all published by a non-US media outlet. Therefore, it can be rightly argued that by restricting Assange’s access to a proper legal defence in such a high-profile and historic case, the British government is acting against the public interest, not only domestically, but internationally as well.\n\nDespite all this, Belmarsh appears to have ignored or dismissed concerns about Assange’s inability to access the courts for his defence and is denying him “facilities.”\n\nBelmarsh’s restrictions on Assange’s ability to meet his lawyers, and its refusal to allow him to speak to his US lawyers would seem to undermine the very basis of Article 6, which, according to the CoE guide:\n\n“… guarantees the right of an accused to participate effectively in a criminal trial.”\n\nIn recognition of Article 6, the UK government website provides guidance on the right of all prisoners to contact their lawyer:\n\n“Prisoners have rights, including … being able to get in contact with a solicitor.”\n\nPrisoners’ rights are also supported by the UK’s own Citizen’s Advice Bureau (CAB), which provides an advisory service to all prisoners.  The following summarises prisoners’ rights in the particular areas where Assange has requested access to justice but has been denied or restricted such access by Belmarsh.  These are as follows (emphasis added):\n\nIt becomes clear, therefore, that Assange is being denied prisoner rights regarding access to justice.  The result of these restrictions on Assange is that he cannot effectively participate in the legal proceedings against him.  Belmarsh’s current restrictions appear to undermine all of his attempts to access each and every avenue of justice, as well as the means required to participate in his legal defence since the time he entered the prison. Such infringements of rights and denial of access to justice are often blamed on shortages, system problems and inefficiencies, and even justified by security and institutional practice. However, all of the British system’s shortcomings in this case could easily be avoided or corrected by prison officials.\n\nIn Assange’s case it means his legal team is forced to waste time and resources attempting to gain legal access to justice, including possibly taking legal action against Belmarsh and the British government. It is easy to imagine why authorities are quite happy for that to happen: it’s eating into the time, is draining his legal team’s resources, and causing more litigation to pile up.  There are only so many battles that can be fought; Assange’s appeal against the Belmarsh bail jumping sentence has already been dropped. And while certain restrictions will be less harsh while Assange is likely to be on remand fighting extradition, common sense tells us that the impact of the restrictions in place before then will be highly detrimental to his defence.\n\n‘Access to justice’ has been described by the ECHR as:\n\n“Access to justice enables individuals to protect themselves against infringements of their rights, to remedy civil wrongs, to hold executive power accountable and to defend themselves in criminal proceedings.  It is an important element of the rule of law…”\n\nIf we believe that barriers to Assange’s ability to defend himself against extradition are justified on the criteria given by a ‘overstretched and underfunded’ high-security prison system, then we are merely consenting to the erosion of law and accepting in its place rules imposed by the administrators of the state’s institutions – at the expense of an individual’s liberty. These justifications for denying Assange his basic legal right to justice are convenient pretexts for Belmarsh which, on cue, has been co-opted by a political agenda which seeks to enable his rendition to the US.\n\nDouble Standards: the Belmarsh ‘prison experience’ according to the governor\n\nBelmarsh is also the state’s prison of choice for Tommy Robinson (real name Stephen Yaxley-Lennon), the controversial right-wing personality and founder of the English Defence League.  Robinson was convicted for breaching contempt of court laws for streaming the trial of a sex trafficking grooming gang on Facebook Live outside Leeds court in 2018, and was later convicted as a civil prisoner.\n\n\n\n IMAGE: Robinson famously entered the prison wearing a T-shirt which reads, “Convicted of journalism.”\n\nUnlike Assange who was placed within the general prison population before being placed in healthcare, Robinson’s special placement appears to fall within the Belmarsh category of prisoner who is “requiring specific management arrangements because of their public and media profile” and thus has been isolated from all other prisoners.  As a result, he is held in the high security unit inside Belmarsh.  Civil prisoners are treated the same as convicted prisoners  with some exceptions, one of these being greater visiting rights.  According to one of his recent visitors, Ezra Levant, head of the Canada-based media outlet The Rebel Media, which Robinson has been employed by, he is receiving visitors three or four times a week. Levant also stated that the prison governor, Rob Davis OBE, visits Robinson daily, noting that,\n\n“.. the governor of the prison, the warden as we call it in North America, actually visits him every day even, just for a moment just to say ‘how’s it going.’ I thought that was very interesting. Not only is the is the warden making himself available to Tommy but he’s inspecting to make sure things are well done. I found that very interesting and relieving.”\n\nAnother visitor from The Rebel Media, Jessica Swietoniowski, reported that Robinson is allowed to make unlimited phone calls between 9am and 11am each morning, stating:\n\n“… from 9:00 until 11:00 he can be out of his cell, so his cell opens from 9:00 in the morning until 11:00, 11:00 [he] gets back into the cell. So during that time he can exercise and pretty much make as many phone calls as he wants, which is good news.”\n\nIt should be noted here that Robinson’s ability to have unfettered access to phone calls is likely because he is a civil prisoner. However, it does demonstrate the gulf in access to resources from one prisoner to the next, and what relatively little facilities Assange is allowed in comparison while attempting to prepare for his legal defence.\n\nSwietoniowski also said that Belmarsh’s governor had “made it an exception for me” to visit Robinson during a Friday August 15th morning visitation session, and that the prison governor was working with “us” (The Rebel Media) to ensure their visits to Belmarsh as “positive as possible.”   This is explained in The Rebel’s ‘prison reports‘ which document their visits to Belmarsh.\n\nIt should also be noted that if the governor has made a decision to make a special exception for a media outlet which has employed Robinson and that can reach Robinson’s followers – it is bound to result in positive public relations for Belmarsh, and any by extension any British government officials involved in the process.  Perhaps it is hoped that Belmarsh’s efforts to be supportive might resonate with his followers and help to appease threats of unrest feared by the government. Likewise, in the eyes of Robinson’s right-wing support base, Belmarsh’s overall positive treatment of Robinson could reflect positively on the new Tory government and cabinet led by Boris Johnson as Parliament heads towards a coming general election. It is reasonable to regard this as a likely outcome of the governor’s publicly supportive treatment of Robinson.\n\nAre we seeing the state, through Belmarsh, attempting to placate the followers of one individual while another is denied access to justice?  Is this the guileful agenda now being played out through a politicised prison system?\n\nThe stark contrast between the prison’s treatment of two high-profile figures, Robinson and Assange, is certainly evident. While Robinson is being treated fairly and lawfully, Assange is not.\n\nAccording to John Pilger, the prison governor had also failed to respond to the letter sent by Assange’s lawyer, Gareth Peirce, on 4th June, roughly three months ago, about restrictions placed on Assange’s legal access entitlements.\n\nAll the indications strongly suggest that the British state through Belmarsh, seem to be imposing a lawless regime upon Assange, who finds himself yet again fighting for his basic human rights and due process in Britain.",
    "author": "Nina Cross",
    "url": "https://21stcenturywire.com/2019/08/28/julian-assange-deprivation-of-justice-and-double-standards-in-belmarsh-prison/",
    "published": "2019-08-28 14:02:23+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}