{
    "data_id": "56002",
    "id": "birminghammail--2019-02-03--Knife killer not sorry about murdering teen says rapper friend",
    "date": "2/3/2019",
    "source": "birminghammail",
    "title": "Knife killer 'not sorry' about murdering teen, says rapper friend",
    "content": "The friend of a convicted killer has prompted disgust by saying in a rap the prisoner isn't sorry about his crime and is seeking to appeal.\n\nJoshua Marshall, aka 'Hecki', made the boast about Tobijah Thompson, also known as 'Tiny', in a video posted on Instagram.\n\nThe 18-year-old was on a night out with friends when they were brutally attacked in the early hours of Mother’s Day 2015.\n\nDaniel later died of his injuries having been stabbed in the neck.\n\nThompson was handed a life sentence at Warwick Crown Court in April 2016 and will serve a minimum of 32 years.\n\nMarshall himself is serving a six-year jail sentence for slashing a 17-year-old across the face with a knife after the teenager refused to hand over his phone.\n\nThe 22-year-old, from Bordesley Green, left his victim permanently scared.\n\nMarshall was sentenced at Birmingham Crown Court in April 2015 after being found guilty of wounding and possessing an offensive weapon.\n\nIt's not clear where the video was recorded.\n\nA source told BirminghamLive: \"It's absolutely disgusting. Daniel's family are lovely and these are dangerous people.\n\n\"Tobijah Thompson is going for an appeal and this video is saying he's not sorry.\n\n\"Shouldn't that be bought to the attention of the parole board?\"\n\nIn the video, Marshall says: \"My brother cut a body and told me he's not sorry\"\n\nThe rapper also makes it clear he has spoken to his fellow prisoner.\n\nOver a hip hop beat, he continues: \"In that system I hear many n***** fold, so it's good to hear him smile up on that prison phone.\n\n\"Now it's process of appeals, God knows how that goes, but that's progress for real.\n\n\"I hope that he gets it, if he don't that's a different road.\n\n\"Probably be 58 when he sees parole.\n\n\"He went jail 25 so do the maths.\"\n\nMarshall also raps that he and his jailed friend \"started from the bottom\", going from \"handguns to shottys\".\n\nTompson brandished a knife during an altercation at the former Society nightclub in Coventry and stabbed Daniel in the neck.\n\nThe teenager collapsed on the pavement outside and died in an ambulance while on the way to hospital.\n\nThe horrific attack, which was caught on CCTV and shown to a jury at Warwick Crown Court during the trial, also saw Thompson injure three of Daniel’s friends who were in the club that night.\n\nThompson, who lived between his sister’s home in Bearwood, Birmingham, and an address in Bedworth, was also found guilty of wounding Niall Kavanagh and Nigel Mkhwananzi with intent, assaulting Christopher O’Brien, violent disorder and possessing a bladed article.",
    "author": "birminghammail.co.uk",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/knife-killer-not-sorry-murdering-15769538",
    "published": "2019-02-03 16:09:49+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}