{
    "data_id": "56053",
    "id": "birminghammail--2019-02-04--Locked up around the UK in January An MP a hidden camera pervert and a contract killer",
    "date": "2/4/2019",
    "source": "birminghammail",
    "title": "Locked up around the UK in January: An MP, a hidden camera pervert and a contract killer",
    "content": "A sitting Member of Parliament, a contract killer and a paedophile caught using a hidden camera are just three of the criminals who were locked up in courts around the country during January 2019.\n\nThe convicts listed here are all now starting prison terms at UK jails. In one case, a killer has been told that he will never leave jail until after his death.\n\nThe jailed even include a Member of Parliament who was jailed for lying to police in a bid to escape a minor speeding fine.\n\nFrom up and down the country, here are just a few of the criminals locked up last month.\n\nMark Fellows was found guilty of murdering the well-known Salford gangster Paul Massey and his friend John Kinsella in two separate attacks.\n\nFellows, 38, gunned down the father-of-five in July 2015 and was given a rare Whole Life Order so he will remain in jail for the rest of his life.\n\nHis partner-in-crime, Steven Boyle, was also jailed for 30 years for the murder of Mr Kinsella, reported the Manchester Evening News.\n\nCarlo Risi, 66, was caught twice with heroin which he claimed was for personal use and with £15,000 in cash he said was from a gambling win.\n\nThe Northumberland pensioner was sentenced to five-and-a-half years in prison after admitting possessing the heroin with intent to supply, reported Chronicle Live.\n\nA Newcastle man was jailed for two years and eight months after he hoped to meet a 14-year-old girl at a Metro station but instead found paedophile hunting vigilantes and police lying in wait.\n\nJohn Sewell had sent explicit videos and graphic descriptions to what turned out to be a decoy profile and told 'Ellie' that he had \"taught a few shy virgins\" before, according to Chronicle Live.\n\nA 44-year-old former Scout leader was jailed for a number of sickening sex crimes that included installing a hidden camera in a cafe toilet to spy on teenage boys.\n\nTerence Hamblett, who referred to himself as 'The Master', was sentenced to 12 years at Chester Crown Court, reports StokeonTrent Live.\n\nJoshua Gardner was caught on camera attacking a car with a frightening zombie knife in south London was originally spared jail last year.\n\nVideo of the attack was filmed by a passing car's dash-cam and went viral across social media causing a lot of controversy.\n\nThe 18-year-old had his sentence overturned by a Court of Appeal and was jailed for three and a half years in a young offenders institute, according to MyLondon .\n\nGaryth Twiselton admitted to ejaculating into a woman's cup of tea before she drank it in order to 'humiliate' her at Stafford Crown Court.\n\nBirmingham Live reported that the 32-year-old was jailed for the sexual assault as well as 12 other sex-related offences.\n\nNadia Plesuvu had turned over more than £100,000 in the nine months before she was raided by Cardiff Police.\n\nShe recruited new prostitutes, organised advertising and negotiated prices, reports Wales Online.\n\nThe MP for Peterborough who lied to police over a speeding ticket was given a three month jail sentence.\n\nFiona Onasanya was sentenced for perverting the course of justice at the Old Bailey but this is being reviewed after a complaint it was unduly lenient.\n\nCambridgeshire Live reported that the Labour politician denied being behind the wheel when her car was spotted doing 41mph in a 30mph zone, in July 2017.\n\nGary Gardner stole more than £20,000 of charity funds that were raised for the son of murdered soldier, Lee Rigby, was ordered to pay back some of the cash and jailed for two-and-a-half years.\n\nLeicester Crown Court heard that Gardner, 56, supported his overdrawn bank account and produced a charity single he \"knew would be a flop\".\n\nLeicestershire Live reported that events organised by the former lorry driver were attended by thousands of people, including Lee Rigby's widow and son.",
    "author": "Patrick Jack",
    "url": "https://www.birminghammail.co.uk/news/uk-news/locked-up-around-uk-january-15777030",
    "published": "2019-02-04 13:02:45+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}