{
    "data_id": "56122",
    "id": "birminghammail--2019-02-05--Hit-and-run crash killers who caused horrific head-on smash jailed for 30 years",
    "date": "2/5/2019",
    "source": "birminghammail",
    "title": "Hit-and-run crash killers who caused horrific head-on smash jailed for 30 years",
    "content": "Three men have been jailed for a total of 30 years for causing a woman's death in a hit-and-run crash after a high-speed chase.\n\nInnocent victim Elizabeth Roberts, an 80-year-old grandmother, was fatally injured when a BMW careered the wrong way down a road and smashed into a Ford Fiesta in which she was a passenger.\n\nIt happened after the BMW was chased for eight miles by a Volkswagen Jetta following an incident involving another Fiesta.\n\nThe BMW and the VW collided in Gaydon, Warwickshire , before the BMW went the wrong way along the B4451, causing the crash in which Mrs Roberts died.\n\nAfter a two-week trial, defendants Naqash Hussain, 29, of Prescott Avenue, Banbury, and Sagar Taseem, 26, of Evenlode, Banbury, were found guilty of causing death by dangerous driving.\n\nThey were jailed for 12 years each at Warwick Crown Court.\n\nA third man, Samuel Franklin, 24, of Warkworth Close, Banbury, pleaded guilty to the same charge in June 2018 and was sentenced on Tuesday, February 5 to six years.\n\nAnd a fourth, Kieran Flint, 21 of Barley Hill, Culworth, Northamptonshire, was cleared of dangerous driving but convicted of careless driving.\n\nHe was fined £500 and given six penalty points.\n\nThe crash happened on February 15, 2017 and the incident started in Banbury.\n\nThe court heard the BMW, containing Taseem and Hussain, had been involved in an incident with Flint's Ford Fiesta.\n\nThe BMW was then chased by the Jetta, driven by Franklin.\n\nBoth vehicles collided and shortly afterwards the BMW turned around and drove the wrong way along the B4451 into oncoming traffic, where it collided with the Fiesta Mrs Roberts was travelling in.\n\nThe Jetta then turned around and drove back to the scene of the collision, where Franklin chased the occupants of the BMW away.\n\nThe occupants of the Fiesta were taken to hospital with serious injuries but Mrs Roberts died the next morning.\n\nFollowing the sentencing, Det Con Stephen Barr from Warwickshire Police said: “This was a tragic incident to investigate, which ultimately could have been avoided.\n\n“I hope the sentencing sends out a clear message that we will not tolerate dangerous driving on our roads, and will ensure those who disregard the law will be investigated and punished for their actions.”\n\nThe family of Mrs Roberts added: “We would like to thank the emergency services and the members of the public who came to assist on the night of the collision and the medical team at University Hospital Coventry & Warwickshire.\n\n“We would also like to thank Warwickshire Police who have worked tirelessly to bring the offenders to justice.\n\n\"No amount of sentence will bring our much-loved mum back but we hope the sentences passed will serve as a deterrent to other road users.”",
    "author": "Zoe Chamberlain",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/hit-run-crash-killers-who-15786117",
    "published": "2019-02-05 23:21:26+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}