{
    "data_id": "561665",
    "id": "tass--2019-02-18--Kremlin on Baring Vostok founders arrest Innocent until proven guilty in a court of law",
    "date": "2/18/2019",
    "source": "tass",
    "title": "Kremlin on Baring Vostok founder’s arrest: Innocent until proven guilty in a court of law",
    "content": "MOSCOW, February 18. /TASS/. Founder of the Baring Vostok equity firm, Michael\nCalvey, who was detained on February 16 on suspicion of fraud, cannot be\nconsidered guilty on any charges until a court has handed down a verdict,\nKremlin Spokesman Dmitry Peskov said on Monday.\n\n\"We know that law enforcement agencies have questions for Michael Calvey, and\nwe know that the court decided to detain him. Right now, we can say that he\ncannot be considered guilty on any charges, because there was no legal trial\nand he can only be convicted by a court’s verdict,\" the spokesman emphasized.\n\nWhen asked if President Vladimir Putin discussed the case with anyone, in\nparticular Russian businessmen, who said they were ready to vouch for Calvey,\nPeskov said: \"No, this situation has nothing to do and should not have nothing\nto do with the agenda of the head of the state. This issue concerns the\ninvestigative agencies first and foremost. It may also partially concern the\nfiscal authorities since this is a really large investor in our economy.\"\n\nPeskov stayed muted on how the court’s decision regarding Calvey complies with\nPutin’s earlier statement that the authorities should choose alternative\nmeasures to arrest with regard to the businessmen under investigation.\n\n\"I cannot comment on the court’s decision in any way,\" he stressed.\n\nAccording to him, the Kremlin did not know when the decision to detain Calvey\nwas made, because this ruling \"was made not inside the administration, but\nwithin special departments, and the president was informed about it according\nto the established procedure after reports in the media were published.\"\n\nOn a similar note, Peskov stressed that it would be incorrect to compare\nCalvey’s case with the detention of Rauf Arashukov, a senator from Karachay-\nCherkessia, who is facing charges of ordering two murders and organizing a\ncriminal gang. The Kremlin official said that in Calvey’s case, the court is\ndealing with a foreign investor and a citizen of another country.\n\n## Calvey’s arrest\n\nOn February 16, Moscow’s Basmanny Court ruled to arrest the founder of Baring\nVostok and co-owner of Vostochny Bank Michael Calvey for two months on\nsuspicion of embezzling 2.5 bln rubles ($37.5 mln). That said, Calvey’s\nlawyers are going to challenge the ruling.\n\nBaring Vostok is one of the largest private equity firms focusing on Russia\nand the CIS with $3.7 bln in capital. Since 1994, the fund has poured more\nthan $2.4 bln of investments into 70 projects in the areas of financial\nservices, oil and gas, telecommunications and media, and into the consumer\nsector.\n\nBaring Vostok’s projects include CTC Media, Yandex, Avito, Ozon, ER-Telecom,\n1C, and Novomet.\n\n",
    "author": "",
    "url": "http://tass.com/economy/1045241",
    "published": "2019-02-18 14:20:06+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}