{
    "data_id": "56188",
    "id": "birminghammail--2019-02-06--Convicted child killer David Gaut screamed for help during alleged revenge attack",
    "date": "2/6/2019",
    "source": "birminghammail",
    "title": "Convicted child killer David Gaut 'screamed for help' during alleged revenge attack",
    "content": "One of the men accused of murdering a child killer repeatedly \"prodded\" his victim's body after stabbing him to death with a knife, a court has heard.\n\nDavid Gaut, 54, was allegedly lured to his death and stabbed 150 times in August at a block of flats in New Tredegar, Caerphilly, South Wales.\n\nOn Wednesday David Osborne, 51, one of three men accused of carrying out the killing, said he was in his kitchen when he heard Mr Gaut screaming for help when fellow defendant Ieuan Harley, 23, attacked him with a knife.\n\nOsborne said: \"I could hear some arguing and shouting.\n\n\"Then I heard Harley turn around and call David a paedophile.\n\n\"It sounded like a knife going into flesh and someone being stabbed.\n\n\"I could hear David shouting out 'help' and heard him screaming. I felt scared.\n\n\"I didn't want to go into the lounge because it sounded horrible.\"\n\nOsborne said he eventually entered his lounge to find Harley holding a bloodied knife in his hand and while standing over Mr Gaut's body.\n\nHe described how Harley, whose clothes were covered in blood, then allegedly knelt down on his knees and began \"prodding\" Mr Gaut's body, gesturing a stabbing motion with his hand to judge Mr Justice Clive Lewis.\n\nOsborne said he asked Harley \"What the hell have you done in my flat?\" to which Harley replied: \"Don't worry, we'll clean it all up.\"\n\nHe said he chose not to call the police and instead go on a \"drinking spree\", saying: \"It was done. The police were going to come anyway.\"\n\nOsborne said he and Harley moved Mr Gaut's body to his passageway and used bleach to clean up blood, and about 30 minutes later they were joined by the third defendant, Darran Evesham, 47, who arrived \"drunk\" and carried on drinking at the flat.\n\nOsborne said later all three wore socks on their hands as they \"carried and dragged\" Mr Gaut's body next door back to his own flat.\n\nNewport Crown Court had earlier been told Harley called Mr Gaut a \"nonce\" after finding out he had served more than 32 years in prison for murdering toddler Chi Ming Shek in 1985.\n\nHarley allegedly told Osborne: \"He doesn't deserve to be here.\"\n\nMr Gaut had moved next door to Osborne six weeks before the three defendants allegedly \"lured\" Mr Gaut to Osborne's flat where he was murdered after they found out about his conviction.\n\nMr Gaut was stabbed more than 150 times while still alive, and a further 26 times after he died, and his fingernails were also cut off post-mortem.\n\nOsborne, from Long Row, Elliots Town, New Tredegar; Harley, of no fixed address; and Evesham, from Powell's Terrace, New Tredegar, all deny the murder of Mr Gaut between August 1 and 4 last year.\n\nHarley and Evesham also deny perverting the course of justice, which Osborne admits.",
    "author": "James Rodger",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/convicted-child-killer-david-gaut-15792548",
    "published": "2019-02-06 20:25:50+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}