{
    "data_id": "562",
    "id": "21stcenturywire--2019-08-31--Adam Schiffs New Law Expands Definition of Domestic Terrorism Promotes FBI Entrapment",
    "date": "8/31/2019",
    "source": "21stcenturywire",
    "title": "Adam Schiff’s New Law Expands Definition of ‘Domestic Terrorism’, Promotes FBI Entrapment",
    "content": "\n\n Recently, the US House Intelligence Committee Chairman Adam Schiff (D-CA) introduced a bill which intends to criminalize various new acts under the ever-expanding banner of domestic terrorism. Undoubtedly, this is an attempt by the government to broaden the definition of ‘domestic terrorism’ in order to make the interpretation more arbitrary, and thus qualifying more offenses for terrorism prosecutions.\n\nSchiff’s new law will give the US Attorney General new powers which would potentially charge any threat of violence or damage to property that “creates a substantial risk of serious bodily injury” – as an act of domestic terrorism.\n\nPotentially, this might could also include the use of heated political rhetoric during a “planning meeting” (a conversation in person, or in an internet chat room), or even breaking a window during a protest. In theory, the Federal government could them pursue sentences up to 30-years in prison.\n\nPredictably, mainstream partisan pundits are cheering this authoritarian move by Schiff, as they believe that this legislation will give the state more power to crack down on what they perceive as their political enemies, namely ‘white supremacists’ and ‘white nationalists. It’s important to point out that this same reactionary, flawed logic was used by Neconservatives in the wake of 9/11 in order to target and ‘deal with’ the supposed ‘Muslim threat’ by rushing through Patriot Act I and II during the Bush Administration.\n\nWriting for The Hill, Michael German offers a few real-life scenarios, explaining, “If you think this possibility is absurd, keep in mind that in 2012 the Justice Department put two political activists in jail for months for refusing to testify before a grand jury about colleagues who may have participated in a Seattle May Day protest in which a federal courthouse window was broken,” adding that, “In 2017, the Justice Department charged more than 200 protesters at an anti-Trump rally with felony charges for allegedly conspiring to riot because someone broke windows and lit a limousine on fire while they were in the general vicinity. Prosecutors used selectively edited undercover recordings of protest planning meetings in which a speaker threatened to turn the inauguration into a “giant clusterf—” as evidence of a broad conspiracy.”\n\n“The prosecutions failed in these cases, which may partly explain why the Justice Department and FBI have been seeking to expand their domestic terrorism powers. If they were intent on using these new powers to target far-right militants, they could have simply amended current Justice Department policies that de-prioritize the investigation and prosecution of hate crimes,” said German.\n\nSchiff federal power-grab is a bi-partisan effort – because both the Republican and Democratic wings of the Establishment will want to use such broad powers in order to marginalize their perceived political opponents, or worse – use the FBI to fabricate terror plots in order to create and maintain an ongoing crisis through which it can reinforce convenient political and state-power narratives and also justify increasing departmental expenditures.\n\nIn short, this breed of new legislation will only give the FBI increased license to continue and expand upon its highly shady practice of using handlers and informants to entrap and arrest unsuspecting dupes, and further boast to the press about the impressive number of “terror busts” it has referred to prosecution.\n\nAll the while, short-sighted partisan lawmakers remain oblivious to the long-term consequences of reactionary such policy.",
    "author": "21wire",
    "url": "https://21stcenturywire.com/2019/08/31/adam-schiffs-new-law-set-to-expand-the-definition-of-domestic-terrorism/",
    "published": "2019-08-31 10:32:01+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}