{
    "data_id": "56265",
    "id": "birminghammail--2019-02-07--Family in new plea for help to catch 17-year-olds killer",
    "date": "2/7/2019",
    "source": "birminghammail",
    "title": "Family in new plea for help to catch 17-year-old's killer",
    "content": "The family of a 17-year-old youth worker murdered in a drive-by shooting have released new childhood pictures of her campaigning against gun and knife crime as police renewed appeals to catch her killer.\n\nTanesha Melbourne-Blake, who mentored younger teenagers to keep them off the streets, was gunned down in Tottenham, north London, on April 2 last year.\n\nDetectives revealed on Wednesday they believe her killer was the passenger in a silver or grey Vauxhall Meriva that was found burnt-out in Barnet five days later.\n\nNo-one has been charged over her death, and in an emotionally-charged interview on Wednesday family friend Akin Akintola said her loved ones need answers.\n\n\"Everyone that knows Tanesha needs an answer. Who did this? Why? We urge people to come forward if they know anything, just come forward,\" he said.\n\n\"No-one will come to terms with what's happened. No-one could come to terms with what's happened.\"\n\nTanesha, who was killed 13 weeks before her 18th birthday, had planned to travel to Jamaica to visit her father and was due to start a youth work course last autumn.\n\nHer mother said in a statement: \"Myself and Tanesha were best friends as well as mother and daughter.\n\n\"The impact of her death is long lasting and still doesn't feel real. It feels as if I'm living in a dream and she'll be coming back.\n\n\"The impact on her dad and siblings has been indescribable too. There is a huge hole in our family that will never be filled. As a family we only ask if anyone does have any information, then please come forward. We would not wish what we are going through on any other family.\"\n\nThe teenager, who had seven siblings, died during a spate of bloodshed in London last year.\n\nOn the same night, Amaan Shakoor, 16, was shot dead in a separate attack in Walthamstow.\n\nOn Wednesday, her family released new childhood pictures of her at anti-gun and knife crime events to coincide with renewed police appeals. \n\n Mr Akintola said she had helped to keep younger people away from crime.\n\n\"In the centre Tanesha was one of the people that brought everyone in,\" he said. \"No matter where you come from, so you're not hanging on the streets, you're not getting into trouble, you're not doing anything negative. She brought everyone in.\n\n\"Since the loss of Tanesha, you can see the atmosphere in the place has changed. It's had a very big impact on the service as a whole. It's had a very big impact on the staff that work there. So many people, her friends, her family. It's just been terrible.\"\n\nHe recalled hearing the anguished screams of her mother on the night she died.\n\n\"Everyone was there, just waiting on one side of the road. Me and another colleague we walked, you know you're just pacing up and down the road just praying, and I heard Tanesha's mum scream.\n\n\"She screamed out loud. We could hear from where we were standing, that's how we knew that she had lost her life.\"\n\nDetective Inspector Beverley Kofi said she is sure someone in the community knows the identity of the killer.\n\nShe said: \"Tanesha was an innocent young girl; she had no gang affiliations whatsoever. Her life was cut tragically short by the senseless actions of a group of people who were intent on committing violence that night.\n\n\"Tanesha's death has left her family completely devastated. Her loss is not only felt by them but by her friends and the wider community in Tottenham, many of whom are young people who she helped to steer them away from violence.\n\n\"I'm certain someone in the community has information. I can assure you anything you provide will be treated in the strictest confidence.\n\n\"If you are worried about contacting police, please think about Tanesha's family, her loss is something they will never get over, we need people to come forward and do the right thing and provide us with that vital piece of information that will bring those responsible to justice.\"\n\nAnyone with information on the shooting should contact the incident room on 0208 358 0100 or call Crimestoppers anonymously on 0800 555 111.",
    "author": "Kirsty Bosley",
    "url": "https://www.birminghammail.co.uk/news/uk-news/family-new-plea-help-catch-15791408",
    "published": "2019-02-07 09:28:20+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}