{
    "data_id": "56299",
    "id": "birminghammail--2019-02-07--Reward of 10k posted to trace the killers of David Danger Currier",
    "date": "2/7/2019",
    "source": "birminghammail",
    "title": "Reward of £10k posted to trace the killers of David 'Danger' Currier",
    "content": "A £10,000 reward has been posted in a bid to trace the killers of Bromsgrove dad David 'Danger' Currier - ten years after he was stabbed to death.\n\nWest Mercia Police have today issued a fresh appeal 10 years on from his unsolved murder.\n\nA reward of £10,000 is available for information passed to Crimestoppers that leads to the arrest and conviction of those responsible. \n\n   \n\n Mr Currier, aged 35 and originally from Stirchley, was murdered at his home on Birmingham Road, Bromsgrove, during the early hours of February 7 2009.\n\nHe had suffered a fatal stab wound to his leg. \n\n   \n\n At the time of his murder his young son, who was only six years old, was present at the address and was found there alone when officers arrived. \n\n   \n\n West Mercia Police Major Investigation Unit are currently reviewing this \"cold case\" investigation and renewing their appeal for information.\n\nPolice are hoping that the tenth anniversary of Mr Currier's murder will result in vital new information being provided.\n\nMr Currier was more commonly known amongst friends by his nickname 'Danger.' \n\n   \n\n When police attended the property on Birmingham Road and discovered his body, there were signs of forced entry to the premises and a disturbance. There was also clear evidence indicating that several people had been present around the time of his murder. \n\n   \n\n Witnesses reported seeing a white Ford transit van and a dark red hatch-back car, possibly a Hyundai, in the area of Birmingham Road and School Lane.\n\nFour men were also seen standing beside both vehicles close to the entrance of what was formerly 'The Mount School' (now KeyOstas) before walking along Birmingham Road in the direction of Mr Currier's house.\n\n\n\n   \n\n His family continue to hope that those responsible for his murder will be found and his brother, Nick Barry, urged anyone with information to come forward.\n\n\n\n   \n\n Detective Inspector Mark Walters, from West Mercia Police, said: \"Officers continue to investigate this tragic death and remain committed to the investigation.\n\n\"Everyone who contacts Crimestoppers stays 100% anonymous. \n\n   \n\n \"I am confident there are people out there who know the identity of those responsible for David's murder and encourage anyone who may have any information, no matter how small or insignificant they may feel it is, to please come forward. \n\n   \n\n \"The investigation team are particularly keen to speak to anyone who may have seen the white coloured transit van or dark red hatch-back car on or near to Birmingham Road and/or School Lane around the time of the incident. \n\n   \n\n \"Our thoughts remain with the family of David Currier who continue to suffer from their loss 10 years on and in particular his son, who tragically lost his father at such a young age.\"\n\nAnyone with any information can contact independent charity Crimestoppers anonymously on 0800 555 111 or via their anonymous online form at  www.Crimestoppers-uk.org . \n\n   \n\n Alternatively you can contact police on 101 quoting incident number 374s 010219.",
    "author": "Andy Richardson",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/reward-10k-posted-trace-killers-15793542",
    "published": "2019-02-07 14:33:34+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}