{
    "data_id": "56337",
    "id": "birminghammail--2019-02-08--Convicted killer Andrew Wallace who killed and dismembered mum Julie Reilly jailed",
    "date": "2/8/2019",
    "source": "birminghammail",
    "title": "Convicted killer Andrew Wallace who killed and dismembered mum Julie Reilly jailed",
    "content": "A family have urged a convicted killer who murdered a vulnerable woman and dismembered her body to tell them where the rest of her remains are.\n\nAndrew Wallace, 42, was jailed for life and ordered to serve at least 28 years behind bars after admitting the murder of Julie Reilly.\n\nHe murdered the 47-year-old at her flat in the Govan area of Glasgow in February 2018 and then cut off her legs with a knife before disposing of her remains.\n\nHer femur bones were found at two separate locations in the city but the rest of her body has not been recovered.\n\nWallace pleaded guilty to murder and attempting to defeat the ends of justice at an earlier court hearing.\n\nJudge Lady Rae sentenced Wallace to life imprisonment when he appeared at the High Court in Glasgow on Friday and said he must serve 28 years before he is eligible to apply for parole.\n\nShe said: \"You are, in my view, a dangerous man who has a considerable propensity for violence.\"\n\nFollowing the sentencing Lynne Bryce, Julie's sister, said on behalf of the family: \"Please tell us where Julie is. Let my Mum have her wee girl back. Let her first grandchild have somewhere to go and grieve for Julie.\n\n\"I hope that if he (Wallace) has a heart he could now please tell us where he put my sister and let her come home to be put to rest properly.\"\n\nShe also thanked police for their work in solving the case.\n\nThe court heard that Wallace moved in with Ms Reilly in December 2017 after splitting up with his girlfriend.\n\nMs Reilly, a mother of four, had suffered a brain injury in 2016 which left her with memory problems and slow reactions.\n\nWallace told a friend she was easy to manipulate and rip-off and in January texted a friend asking \"do you know how to assassinate a stalker?\"\n\nBetween 1pm and 2pm on the afternoon of February 7 Wallace met a friend in the street and told him \"I've murdered a c***, I need to get rid of a body\".\n\nProsecutor Richard Goddard told the court that the following day Wallace told his friend Edward Glover that Ms Reilly had moved away and he moved in with him.\n\nMr Goddard said: \"The accused told Glover he'd been out in a friend's car and they had hit a deer and were intending to sell the meat.\n\n\"On the afternoon of February 10 the accused arrived back at the flat and was dragging a big suitcase from the back into Glover's flat. It seemed to be heavy. The accused said it contained meat from the deer. In fact it contained part of Julie Reilly's body.\n\n\"At some point in the night the accused left the flat and took the suitcase with him.\"\n\nOn 11 February Wallace arrived at another friend's flat with a suitcase which he put in the shower, telling his friend it contained his dirty washing when in fact it contained part of the remains of his victim.\n\nMs Reilly was reported missing in mid-February after she failed to pick up her prescription at the pharmacists, and family members raised concerns.\n\nOn April 19 a member of the public called police to say he could see what appeared to be a bone with flesh attached to it in his front garden at Ardshiel Road in Govan.\n\nIt was recovered by officers and DNA testing confirmed it was Ms Reilly's right femur.\n\nMr Goddard told the court that on April 23 another member of the public went to the police station to report finding what appeared to be a burial site containing \"fleshy material\".\n\nThe site was excavated and remains were recovered which were confirmed to be Ms Reilly's other femur.\n\nA post-mortem examination could not ascertain the cause of death.\n\nForensic scientists examined Ms Reilly's flat in Shieldhall Road and, using a substance called luminol which shows up blood staining, found large areas of blood and drag marks in the property.\n\nThe court heard that Wallace was convicted of culpable homicide in 1992 and sentenced to ten years in jail and had other previous convictions for violence.\n\nLady Rae asked Ian Duguid QC, representing Wallace, whether his client would co-operate with police to recover the rest of Ms Reilly's names.\n\nHe said his client was \"prepared to entertain an approach from the police\" once the court case is over but his client would say nothing further.",
    "author": "James Rodger",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/convicted-killer-andrew-wallace-who-15804534",
    "published": "2019-02-08 21:50:29+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}