{
    "data_id": "56351",
    "id": "birminghammail--2019-02-08--Gay Village serial killer sentenced to life in prison for gruesome murders",
    "date": "2/8/2019",
    "source": "birminghammail",
    "title": "Gay Village serial killer sentenced to life in prison for gruesome murders",
    "content": "A Canadian judge has sentenced \"warped\" serial killer Bruce McArthur to life in prison with no chance of parole for 25 years.\n\nMcArthur pleaded guilty last week to eight counts of first-degree murder. \n\n The 67-year-old former landscaper sexually assaulted, killed and dismembered men he met in Toronto's Gay Village district over seven years.\n\nJustice John McMahon called McArthur a sexual predator who killed for his own \"warped, sick gratification\" and said the victims suffered slow and painful deaths.\n\nHe called their dismemberments \"pure evil\", but said the guilty plea spared a jury four months of graphic and gruesome evidence that would have probably required counselling after.\n\nProsecutor Craig Harper had asked for a parole ineligibility period of 50 years, when McArthur would have been 116.\n\nThe judge said that would have only been symbolic. McArthur will be eligible for parole when he is 91.\n\nMcArthur - who is pictured in the tweet below - has been in prison since January last year when investigators discovered dismembered remains in planters at home he used as storage for his business.\n\n\n\n He also staged photos of some of his victims after they died, posing corpses in fur coats and putting cigars in their mouths. McArthur accessed some of the photos long after the killings.\n\nThe victims fit a pattern: Most were of Middle Eastern or south Asian descent and lived on the margins of Canadian society, and their disappearances attracted little attention.\n\nOne victim hid the fact that he was gay from his Muslim family, another was a recent immigrant with a drug problem, a third was a refugee who was ordered deported, and another victim was homeless, smoked crack cocaine and worked as a prostitute.\n\nMany of Toronto's LGBQT community said for years a serial killer was at work.\n\nThe prosecution said a frequent site of the killings was McArthur's bedroom and he repeatedly strangled his victims either with his hands or with rope and a metal bar.\n\nThe killings took place from 2010 to 2017.\n\nCriminal experts say it is unusual for someone to become a serial killer later in life, but the prosecution said there is no evidence of earlier murders.",
    "author": "David Bentley",
    "url": "https://www.birminghammail.co.uk/news/world-news/gay-village-serial-killer-sentenced-15804473",
    "published": "2019-02-08 21:02:11+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}