{
    "data_id": "56712",
    "id": "birminghammail--2019-02-13--How receipt in 100-year-old widower Zofija Kaczans bag helped catch killer Artur Waszkiewicz",
    "date": "2/13/2019",
    "source": "birminghammail",
    "title": "How receipt in 100-year-old widower Zofija Kaczan's bag helped catch killer Artur Waszkiewicz",
    "content": "A damning fingerprint on a receipt in the handbag of 100-year-old Zofija Kaczan and her killer's drug addiction were key factors in proving his guilt, a chief Crown prosecutor has said.\n\nArtur Waszkiewicz told his trial he had been a heroin addict since the age of 18, which the prosecution proved to be his motive for robbing the elderly widow.\n\nAddressing Waszkiewicz's previous convictions, Chief Crown Prosecutor for the CPS in the East Midlands, Janine Smith, said: \"He did have a propensity for dishonesty.\n\n\"He had a number of previous convictions and they were primarily for dishonesty, primarily for shop theft.\"\n\nMs Smith continued: \"The thing about this case is if you look at the defendant's behaviour before and after - that is what we could put in front of the jury.\n\n\"We knew he was trying to borrow money, we knew he was trying to sell his dog - all to go towards drugs.\n\n\"After the offence he changed his appearance and cancelled the insurance policy on his car.\n\n\"We would say they help to build a picture which we can put to the jury.\"\n\nQuestioned on what she believed led to Waszkiewicz's conviction, Ms Smith said: \"I really do believe it is a combination.\n\n\"His vehicle being in close proximity very shortly before the offence, the fact you can see the brake lights on his car and the fact that you can see his fingerprints on a receipt in the bag.\n\n\"He is the one who had the motive. He is the one, by his own admission, who had a heroin addiction.\"\n\nSpeaking of Waszkiewicz's desperation for drugs, Ms Smith said: \"I think it is a clear aggravating feature of the offence and we would say that he has targeted someone who is vulnerable.\"",
    "author": "James Rodger",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/how-receipt-100-year-old-15826409",
    "published": "2019-02-13 15:56:48+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}