{
    "data_id": "56724",
    "id": "birminghammail--2019-02-13--Murdered schoolgirl Alesha MacPhails dad sold drugs to alleged killer",
    "date": "2/13/2019",
    "source": "birminghammail",
    "title": "Murdered schoolgirl Alesha MacPhail's dad 'sold drugs to alleged killer'",
    "content": "The father of murdered six-year-old Alesha MacPhail sold cannabis to the teenager accused of killing her, a court has heard.\n\nRobert MacPhail, 26, told the High Court in Glasgow he had done deals with the 16-year-old.\n\nThe schoolgirl was found dead in woodland in July last year on the Isle of Bute.\n\nShe had been spending a summer break with her father and grandparents in the house they shared.\n\nThe accused, who cannot be named because of his age, denies taking her from her bed before raping and murdering her on July 2 last year.\n\nAlesha's father identified him in the courtroom and told the jury: \"I used to sell him cannabis.\"\n\nMr MacPhail, who is unemployed, said he had last sold him the drug a few months before Alesha's murder.\n\nHe said he stopped after the teenager's mother told his partner, Toni McLachlan, to stop.\n\nThe court heard the deals usually took place at a bus shelter across from his own mother's house in Ardbeg Road, where he then lived along with Ms McLachlan, 18.\n\nThe pair were in bed on the morning of July 2 when Alesha's grandparents came in to say she was missing, and all four began hunting around the house and outside for the schoolgirl.\n\nMr MacPhail said he had put his daughter to bed the night before with a Peppa Pig DVD.\n\n\"I told her I would see her in the morning and that was the last time I saw her,\" he said.\n\nMr MacPhail said his relationship with Alesha's mother Georgina Lochrane in Coatbridge, North Lanarkshire, had broken down months after she was born.\n\nHe said he saw his daughter every second weekend and during the holidays.\n\nMr MacPhail said his daughter \"loved\" spending time on his home island, going to the beach and playing at the park.\n\nAsked about Alesha's relationship with Ms McLachlan, he said it was \"great\".\n\n\"They both loved each other to bits,\" he said.\n\nThe 16-year-old accused of Alesha's murder has lodged a special defence blaming Ms McLachlan for her death.\n\nHe also denies attempting to defeat the ends of justice by disposing of clothing and a knife.\n\nAlesha's grandfather Calum MacPhail, 49, described the desperate search after they realised she was not in her bed.\n\nHe said: \"We searched under all the beds, in all the wardrobes to see if she had crawled away somewhere.\n\n\"There was no sign of her anywhere. I threw some clothes on and went outside.\"\n\nAfter driving around, looking for Alesha at the park and the putting green, he later saw police had cordoned off an area and was told to go to Rothesay police station with the rest of the family.\n\nVisibly distressed, he said: \"We were all put into a room and about five minutes later a police officer came in and said 'we found her but she's passed\"'.\n\nAlesha's grandmother Angela King, 47, had made a call to the police at 6.23am, around 10 minutes after realising she was not in her bed.\n\nIn the call played to the jury, she continued to check cupboards as she told the handler: \"We've looked all through the house and she's nowhere to be seen.\"\n\nHer partner had earlier told the court that the key to the lock on the front door of the top-floor flat was often left in the door during the day to allow family members to come and go.\n\nHe said: \"In Rothesay a lot of people leave their door unlocked.\"\n\nMs King said the key was still in the door when she went to bed in the early hours of July 2.\n\nShe said: \"The key was in the lock and I'd forgotten to take the key back out of the door.\"",
    "author": "James Rodger",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/murdered-schoolgirl-alesha-macphails-dad-15822476",
    "published": "2019-02-13 08:04:46+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}