{
    "data_id": "5676",
    "id": "activistpost--2019-09-23--Watch as Cops Record Themselves Making Up Fake Charges to Kidnap Innocent Man Steal His Car",
    "date": "9/23/2019",
    "source": "activistpost",
    "title": "Watch as Cops Record Themselves Making Up Fake Charges to Kidnap Innocent Man, Steal His Car",
    "content": "Jasper, GA — If you still have any doubt that police are here just for your protection, the following video should be enough to convince you otherwise. An entirely innocent man, Charles A. Spradlin had committed no crime, had harmed no one, and was on his own property when two Georgia State Troopers illegally stopped him, kidnapped him, and stole his vehicle. The gross violation of rights was captured on video as the two troopers discussed the various ways to accomplish their illegal goals. The trooper’s conduct is now the subject of a federal lawsuit.\n\nThis infuriatingly corrupt incident unfolded on March 26, 2016 when Spradlin got a call from his neighbor — whose son happened to be killed by police — letting him know that officers had set up a checkpoint near his home. According to the lawsuit, Spradlin then got in his car, drove to the end of his driveway and parked on a hill to see where the checkpoint was. When he didn’t see it, he turned around and drove back to his home.\n\nSpradlin would never make it back to his house, however, because Georgia State Trooper TFC Jonathan Salcedo pulled him over, kidnapped him and stole his car.\n\nAs the video shows, Salcedo admits that he pulled over Spradlin because he saw him turn around. It is not illegal to turn around. And, according to the lawsuit, Spradlin turned into an adjacent driveway, used his turn signal and obeyed all traffic laws. But this was irrelevant to this tyrant.\n\nSalcedo immediately began to berate Spradlin, accusing him of violating a law that the trooper had just made up: turning around before a checkpoint. Spradlin told the trooper why he drove to the end of his driveway — to get a view of the police checkpoint — but the trooper couldn’t have cared less. He was going to make sure he turned this man’s day into a living hell.\n\nAs the video shows, Spradlin confirmed to the trooper that he had a driver’s license and asked for the basis of Officer Salcedo’s stop. According to the lawsuit, officer Salcedo became visibly agitated and told Spradlin to turn around and put his hands behind his back.” Spradlin was then handcuffed and locked in the backseat of the cruiser.\n\nThe officers then proceeded to illegally search the man’s vehicle. It wasn’t the search that was most infuriating, however. It was the troopers discussing what they could charge this innocent man with.\n\n“Looks like his tires are worn, that’s our P.C. (probable cause) right there,” one trooper says. Worn tires are not probable cause for a stop and even if it was, this trooper had no way of seeing worn tires while the vehicle was in motion.\n\nThe officers then call their supervisor and ask him for permission to continue to violate this man’s rights. As the video shows, they were clueless of the law and were scrambling for a reason to kidnap this man.\n\n“Let’s check his window tint,” the cop said, continuing to fish for something to find on Spradlin. The cops then illegally proceeded to search Spradlin’s vehicle, without his consent and against their supervisor’s orders. When asked by Spradlin why they were searching his vehicle, they claimed it was an “inventory” and not a “search.”\n\nAs the officers continue their illegal detainment, they turn off their recording devices in what was was likely an illegal conversation to figure out how to kidnap an innocent man and steal his car. When the mics turn back on, Spradlin is told his vehicle is being impounded and he is being arrested.\n\nPolice then stole Spradlin’s car and kidnapped him, falsely charging him with failure to display license, obstruction of justice, and having unsafe tires. It took two days for Spradlin to get his car back after he had to make bail and pay a $200 impound fee.\n\nThree weeks later, according to the lawsuit, during a preliminary hearing on April 14, 2016, a judge dismissed the obstruction of justice charge because there was “not in fact evidence to sustain that a reasonable person would believe that a crime was committed.” He also dismissed the unsafe tire charge because there was “never any testimony that [the tires] were below 2/32 of an inch.” The prosecution later dropped the failure to display license charge.\n\nSpradlin is now suing Salcedo for violations of his Fourth, Fifth, and Eighth Amendment rights and he will likely win as the judge has already dismissed Salcedo’s claim for immunity.",
    "author": "Activist Post",
    "url": "https://www.activistpost.com/2019/09/watch-as-cops-record-themselves-making-up-fake-charges-to-kidnap-innocent-man-steal-his-car.html",
    "published": "2019-09-23 00:04:54+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}