{
    "data_id": "57320",
    "id": "birminghammail--2019-02-22--Police reveal how they caught teen killer who raped 14yr old Viktorija Sokolova",
    "date": "2/22/2019",
    "source": "birminghammail",
    "title": "Police reveal how they caught teen killer who raped 14yr old Viktorija Sokolova",
    "content": "Detectives have lifted the lid on how they solved a crime which \"shocked\" a community.\n\nA teenage boy has been given a 19-year sentence today for the rape and murder of 14-year-old Viktorija Sokolova in West Park, Wolverhampton in April last year.\n\nThe schoolboy, who cannot be named for legal reasons, was just 16 when he arranged to meet Viktorija on the night of Wednesday 11 April after several Facebook Messenger exchanges.\n\nThe following morning Viktorija’s body was found by a dog walker, semi-naked and bent over a park bench. She had been brutally raped and bludgeoned with a weapon, possibly a hammer, causing massive head injuries and a fractured spine.\n\nDetective Inspector Caroline Corfield, from the force’s homicide unit, said: \"It was clear that the scene of Viktorija’s attack was a large wooden pavilion near to the boating lake, known locally as the ‘black house’. Her blood-stained baseball cap and earrings were found there and also, horrifically, three of her teeth which points to the violence of the attack. Her body had then been dragged to a bench some 150 metres away, where she was found.\n\n\"We also found footprints in Viktorija’s blood on the floor in the pavilion, the pattern of which were identified as those of Adidas Gazelle trainers, the same footwear later seen worn by the killer as he walked to and from the park.\"\n\nDI Corfield continued: \"The murder of Viktorija shocked the local community and the wider general public, not least because of the ages of those involved.\n\n\"As many young teens do, Viktorija was testing boundaries and could be wilful, but she was a popular girl and had the love and support of her family and friends. She certainly had her whole life ahead of her, but sadly that was brutally cut short.\n\n\"I am so proud of everyone who worked incredibly hard on this deeply distressing case. Nothing can compensate for the loss of Viktorija and her family have been put through an unimaginable ordeal. Our thoughts remain with them.\"\n\nA judge at Wolverhampton Crown Court told the teen he must serve at least 19 years in prison before he will be eligible to apply for parole. He was sentenced to an additional 10 years for rape to run concurrently.\n\nFollowing his conviction in December, Viktorija’s mother and stepfather spoke of their loss. They said: \"We were a family, now there are only two of us. Viktorija will never be replaced and will always be missed dearly. She will remain in our hearts forever. We will never be given the opportunity to have grandchildren because this has been taken from us.\"\n\nViktorija had moved to the UK from Lithuania in 2011, and was with friends on the evening of her death when she arranged to meet her killer later that night. Although they advised her not to go, Vikorija assured them he was a friend and left at 10.40pm. Sadly they did not see her alive again.\n\nCCTV showed the teenager walk from Bright Street towards the Kingsland Road entrance of West Park. He was seen again, wearing distinctive Adidas trainers, leaving the park around two hours later. Viktorija’s body was found later that morning.",
    "author": "Kelly Ashmore",
    "url": "https://www.birminghammail.co.uk/black-country/police-reveal-how-caught-teen-15874050",
    "published": "2019-02-22 16:59:05+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}