{
    "data_id": "58479",
    "id": "birminghammail--2019-03-18--Disgraced MP Fiona Onasanya declares shes innocent in first video since release from jail",
    "date": "3/18/2019",
    "source": "birminghammail",
    "title": "Disgraced MP Fiona Onasanya declares she's 'innocent' in first video since release from jail",
    "content": "Disgraced MP Fiona Onasanya has vowed to continue as a \"voice of change in Parliament\" in her first video to be published since she was released from prison.\n\nIn the clip, posted on her social media channels the day before the start of a petition that could unseat her, she claims that she is innocent of perverting the course of justice.\n\nThe Peterborough MP was found guilty by a jury at the Old Bailey and was sentenced to three months in prison.\n\nThe 35-year-old, who was elected as a Labour MP, served just 28 days for lying about who was driving her car when it was caught speeding in July 2017.\n\nShe was released on February 26.\n\nMs Onasanya, a solicitor, still received her £77,379 salary while in jail despite missing votes in the Commons.\n\nIn the video, posted on Monday, she says: \"I am telling you I am innocent and will continue to pursue avenues to clear my name.\n\n\"If you wish for me to continue as your independent Member of Parliament I am willing and able to do so but the choice is now in your hands.\n\n\"I would like to say I have a deep gratitude to all who have offered prayers, support and love during this difficult period of time over the past few months and also say to you all, thank you.\n\n\"I will continue to be your voice of change in Parliament for as long as you wish me to do so and if you do wish me to do so I can tell you I will continue to lobby Government, I will continue to fight for social justice with all of the veracity and power that I have been so far, and continue to be your voice, because you deserve nothing less.\"\n\nJurors at the Old Bailey were told that she colluded with her brother Festus after her car was clocked speeding at 41mph in a 30mph zone in the village of Thorney, near Peterborough, in July 2017.\n\nShe was sent a notice of intended prosecution (NIP) to fill out, but it was sent back naming the guilty driver as Aleks Antipow, an acquaintance of her brother, who was away visiting his parents in Russia.\n\nFestus Onasanya, 34, from Cambridge, was jailed for 10 months after he admitted three counts of perverting the course of justice over speeding, including the July 24 incident.\n\nMs Onasanya claims in the video, posted on Monday, that her defence \"was never put across in the media\".\n\nGiving evidence at her trial, Ms Onasanya said that when she received the notice of intended prosecution (NIP) she left it at her mother's house for whoever had borrowed her car to complete, assuming she had been in London.\n\nShe said that while being pursued over the NIP she suffered a relapse of multiple sclerosis and was admitted to hospital for three days, and said that when she asked her brother about the ticket he told her it was all \"sorted\".\n\nMs Onasanya appealed against her conviction, but this was thrown out at the Royal Courts of Justice.\n\nA recall petition will be opened on Tuesday and voters will have six weeks to sign before it closes at 5pm on May 1.\n\nIf it attracts the signatures of 10% of eligible voters, about 7,000 people, Ms Onasanya will be forced out and a by-election called.\n\nUnder recall rules, Ms Onasanya will be permitted to stand for re-election.",
    "author": "James Rodger",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/disgraced-mp-fiona-onasanya-declares-15992458",
    "published": "2019-03-18 14:36:27+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}