{
    "data_id": "58808",
    "id": "birminghammail--2019-03-21--Birmingham psychologist reveals truth behind Alesha MacPhails killer Aaron Campbell",
    "date": "3/21/2019",
    "source": "birminghammail",
    "title": "Birmingham psychologist reveals truth behind Alesha MacPhail's killer Aaron Campbell",
    "content": "A Birmingham psychologist has revealed her thoughts on convicted murderer Aaron Campbell.\n\nThe 16-year-old was sentenced to at least 27 years in jail by a judge at Glasgow High Court this morning.\n\nDuring sentencing Lord Matthews said Campbell showed a \"staggering lack of emotion\" and that he did not see \"one flicker of emotion\" from him during the nine-day trial last month, after which a jury found him unanimously guilty.\n\nHe described Campbell as a \"cold, callous, calculating, remorseless and dangerous individual\".\n\nNow Professor Elizabeth Yardley, a Professor of Criminology and Director of the Centre for Applied Criminology at Birmingham City University, has told the Mirror that this wasn't a \"random\" incident where Campbell \"snapped\".\n\nShe said Alesha's murder was \"one of the most awful cases I've come across\".\n\n\"If you look at the extent of violence that was used, she had 117 injuries, this was not the case of a normal, healthy individual one day turned into a homicidal child-killer the next,\" she explains.\n\n\"This is somebody who would have had an extensive history of problematic behaviour. This is someone who really values violence and enjoys hurting other people.\n\n\"I think one of the most disturbing things to me was how calm he was afterwards.\"\n\nCCTV footage from Campbell's mother's own security system provided evidence which helped detectives catch the killer.\n\nHis mother had contacted police herself, hoping the footage would eliminate her son from the investigation.\n\nProf Yardley added: \"You've got this CCTV of him just sauntering home so he doesn't appear to have an emotional reaction to it. He appears to be emotionally empty and he's got this lack of remorse.\n\n\"Most of the offenders I work with who've been convicted of manslaughter and murder can't function at all because they're so abhorred by the harm they've caused. They can't behave in a normal way at all, and so for Campbell to react in that way suggests some psychopathic tendencies to me.\n\n\"Another key thing that comes through for me is that Alesha was a girl. That's a really significant thing here and that the attack involved sexual violence - that tells us about his views about women and girls, who they are and how they should behave.\n\n\"It's inherently misogynistic. One of the most common things we see in cases of femicide is strangulation and that's what we've got here.\"\n\nA post-mortem found Alesha died of \"pressure to the face and neck\".\n\nAfter Campbell was found guilty and Lord Matthews lifted the anonymity order, it emerged that the 16-year-old had a fascination with the Slenderman character and violent video games.\n\nBut Prof Yardley doesn't believe the the gruesome character would not have compelled him to carry out the awful attack - instead she argues he would have been drawn to Slenderman because it reinforced his views.\n\n\"I always say these things cause people to commit these acts of violence, people are watching this kind of stuff but they support the views and values that they already have,\" she explains.\n\n\"It isn't something that triggers this kind of thing.\"\n\nShe also doesn't agree with calling him \"evil\", rather he's a person who \"decided to do an evil thing\".\n\n\"Given how sustained the attack was and the number of injuries that she had - that's 117 decisions to keep inflicting harm on somebody.\n\n\"This is someone who knows exactly what they're doing, they know what they're doing is wrong and they just choose to do it anyway.\"\n\nMs Yardley has worked with countless offenders and says this level of violence is usually something they take \"years to work up to\".\n\n\"For somebody who is a teenager to be doing this kind of thing is really rare, thankfully, but when it does happen, it's horrendous.\"\n\nNeighbours claim this wasn't his first act of violence, although none of the stories have been corroborated, but stories have been making their rounds on the island about him previously nearly drowning a young girl at a leisure centre pool when he was a young child.\n\nHe's also said to have slaughtered and skinned cats in his younger teens, apparently burying two feline corpses in his garden.\n\nAnd one neighbour claimed Campbell had become a local nuisance on Bute and was once caught trying to set fire to buildings.\n\nProf Yardley said: \"I'd argue that people don't just snap, that's not a thing.\n\n\"In order to perpetrate something this horrendously violent, you need to value violence and that comes from a messy combination of nature and nurture. I'd say it's what they observe in the world around them growing up is quite an important factor in leading to this kind of thing.\n\n\"All the violent men I work with have some kind of horrendous abuse, or neglect, or trauma in their early lives.\n\n\"They feel that during their time as children, they didn't have a lot of control and that develops into an intense need to be in control as adolescents and adults. And for some people that can mean harming other people.\n\n\"This is a young man who wants to call all the shots, he wants everything his way.\"\n\nA psychological evaluation carried out on July 9 and 10 last year highlighted no issues to suggest he was not of sound mind when he murdered Alesha.\n\nAt a hearing after the trial ended it emerged the teenager had a history of self harm, anxiety and depression, and has been tested for attention deficit hyperactivity disorder.\n\nThe murder trial heard about the teenager's social media activity after Alesha was murdered, including a Snapchat video in which Campbell looked into a mirror and said: “Found the guy who’s done it.\"\n\nThe court also heard how he had spoken to a friend about killing someone for the \"life experience\".\n\nProf Yardey argues that he will have loved the attention after the anonymity order was lifted and will embrace his new-found notoriety.\n\n\"There's quite a sense of narcissism about him that he's enjoying the attention,\" she said.\n\n\"When the anonymity order was lifted I thought, 'he's going to be quite liking this'.\n\n\"It's Alesha's name we should be remembering from this case and not his.\n\n\"He's going to enjoy people talking about him, having his name and picture out there in the papers and he'll really enjoy the fact that people are trying to figure out what drove him to do this.\n\n\"But he's not going to have an easy time in prison at all...child killers are right at the bottom of the pecking order. He's going to have one eye open all of the time.\"\n\nThe Professor believes he'd have killed again if he'd not been apprehended for Alesha's murder but she does think he can be rehabilitated, if he accepts responsibility for the harm he has caused.\n\nWhen you look at the level of harm he's inflicted and the fact that he enjoy doing that, I think the only thing that saved potential future victims is that he's a very inexperienced offender.\n\n\"He was incredibly disorganised, he wasn't forensically aware enough to try and cover his tracks. This was someone who was capable of more harm and he still is now.\n\n\"Everybody is capable of change. I've seen examples of that happen but in order for somebody to change their behaviour, they need to acknowledge that what they've done and accept responsibility for it.\n\n\"I've worked with people convicted of murder, manslaughter, armed robbery and during their time in prison they have decided 'I don't want to be this person anymore'. And it can take years and years and years but they have got there in the end.\"\n\n\"It's so disturbing to think that someone of that age can consciously decide to cause that amount of harm but that's what we've got in this case and we really need to understand where that came from in order to prevent this happening again.\n\n\"He certainly wasn't an innocent little boy one minutes and then played a violent video game and turned into a killer.\"",
    "author": "Katie Brooks",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/birmingham-psychologist-reveals-truth-behind-16008069",
    "published": "2019-03-21 13:50:23+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}