{
    "data_id": "592",
    "id": "21stcenturywire--2019-09-11--Remain Roadblock Scottish Court Rules PMs Suspension of Parliament Unlawful",
    "date": "9/11/2019",
    "source": "21stcenturywire",
    "title": "Remain Roadblock: Scottish Court Rules PM’s Suspension of Parliament ‘Unlawful’",
    "content": "\n\n Scotland’s highest civil court has ruled today that Boris Johnson’s suspension of the UK Parliament is unlawful. A three judge panel at the Court of Session in Ednburgh ruled in favour of a cross-party group of politicians, stating that the Prime Minister’s prorogation is an attempt to ‘prevent Parliament holding the government to account ahead of Brexit.’\n\nBoth Labour and Scottish National Party (SNP) are demanding an immediate recall of Parliament.\n\nHowever, this latest Scottish ruling appears to contradict previous statements made by judges in London, as well as the initial findings by the same Edinburgh court last Wednesday when Lord Doherty stated that PM Johnson’s prorogation was lawful.\n\nIn response, Johnson’s government has said it will appeal the ruling in the country’s Supreme Court in London who will make the final decision on the matter. The case will be heard next Tuesday.\n\nAs of Wednesday, no final decision has been made to immediately reverse the PM’s suspension of Parliament, but according to the House Speaker’s office, Parliament can only be recalled if the government so chooses.\n\nAccording earlier reports from The Guardian in London, Sir Ed Davey, the deputy Liberal Democrat leader, this ruling could lead to the resignation of Boris Johnson:\n\n“It could well do. If he has been found to have misled the Queen, I think the whole nation will be deeply shocked and alarmed. This is a prime minister we already know has said he might obey a law in parliament, so he is behaving in the most disgraceful way. Now it may be that the supreme court next week overturns the decision. But that three judges, independent judges, could come to this conclusion today is a real blow to the government, and it also backs what Liberal Democrats and others have been saying, this government should not have silenced parliament.”\n\nFresh attacks against the Prime Minister are also coming from the Tory rebel’s camp, as Dominic Grieve, the former Conservative attorney general (and one of the 21 MPs who had the whip removed last week), said to BBC News that, if Boris Johnson misled the Queen about the reasons for prorogation, then he should resign:\n\nThe Guardian added that, “Grieve was also the MP who tabled by standing order 24 motion passed by MPs on Monday demanding the release of private messages from Johnson’s aides relating to the prorogation of parliament. In the debate he said government whistleblowers who had told him what really happened thought the affair “smacked of scandal”.",
    "author": "21wire",
    "url": "https://21stcenturywire.com/2019/09/11/remain-roadblock-scottish-court-rules-pms-suspension-of-parliament-unlawful/",
    "published": "2019-09-11 12:17:49+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}