{
    "data_id": "59228",
    "id": "birminghammail--2019-03-25--Vigilante Ieuan Harley jailed over David Gaut murder after stabbing baby killer 176 times",
    "date": "3/25/2019",
    "source": "birminghammail",
    "title": "Vigilante Ieuan Harley jailed over David Gaut murder after stabbing baby killer 176 times",
    "content": "A vigilante who murdered a child killer, brutally stabbing him 176 times, has been jailed.\n\nIeuan Harley, 23, murdered David Gaut after discovering he had been jailed for killing a 15-month-old boy in 1985.\n\nGaut was stabbed to death in August last year in New Tredegar, South Wales.\n\nHarley, who was convicted of murder after a trial in February, was sentenced to life in prison on Monday with a minimum term of 24 years,  WalesOnline  reports.\n\nIn February, a jury found Mr Gaut's neighbour David Osborne, 51, not guilty of murder or manslaughter after he was accused of taking part in the killing.\n\nHarley and Darran Evesham, 47, were also found guilty of perverting the course of justice, a charge Osborne had admitted before the trial, after attempting to dispose of evidence of the killing.\n\nDuring the trial, Newport Crown Court heard Mr Gaut was killed on the night of August 2 last year after his neighbours in Long Row, New Tredegar, discovered he had served 32 years in jail for killing toddler Chi Ming Shek in 1985.\n\nProsecutors alleged he was lured to neighbour Osborne's flat before being attacked with at least two knives, before being stabbed at least 150 times while he was still alive and another 26 times after his death, and his fingernails were also cut off.\n\nAt least one knife was said to have been used to kill Mr Gaut and a screwdriver was later used to stab his dead body, leaving him with injuries that were so gruesome pictures were deliberately kept away from the jury.\n\nThe murder weapon had been thrust into Mr Gaut with such force that part of it was found broken off in his sternum.\n\nA Peugeot car was set on fire hours after the killing, which Evesham later told a BBC reporter had contained bloodied sheets from the killing, which he claimed had been committed by \"three spice addicts\".\n\nPolice later recovered heavily blood-stained clothing from a riverbank close to where Osborne and Evesham were caught on CCTV walking.\n\nBloodied towels and sheets were found inside a black Sports Direct bag and nearby was a B&M Bargains bag which contained blood-stained underwear, socks, a white T-shirt and grey Everlast tracksuit bottoms.\n\nMr Gaut had moved into his block of flats six weeks before his death, telling neighbours he had been released from prison after serving 33 years for killing a soldier.\n\nBut neighbour Kyle Alford and his partner Samantha Jenkins discovered he was a convicted child killer after finding his name on the Black Kalendar website, which lists British murders.\n\nThe pair told other residents at the block of flats including Osborne and Harley, who was homeless and staying at Osborne's flat.\n\nMr Alford recalled one conversation he had with Mr Gaut before he died, where he joked about not liking Chinese takeaways, but would order a \"Chi Ming Shek\", the name of the toddler he killed.\n\nMr Alford said Harley was \"shocked and angry\" when he showed him the website, and Harley said he wanted to \"cut (Gaut) up and put him down the plughole\", before telling Osborne: \"Let's get him in here to set him up.\"\n\nOsborne said Mr Gaut came to his flat on the night of his death, but said he was in his kitchen when he heard Mr Gaut screaming for help as Harley attacked him.\n\nOsborne said he entered his lounge to find Harley holding a bloodied knife in his hand and standing over Mr Gaut's body.\n\nOsborne said he asked Harley: \"What the hell have you done in my flat?\", to which Harley replied: \"Don't worry, we'll clean it all up\", before continuing to prod the body.\n\nOsborne said he and Harley moved Mr Gaut's body to his passageway and used bleach to clean up blood, and about 30 minutes later they were joined by Evesham, who arrived \"drunk\" and carried on drinking at the flat.\n\nThe three men were said to have carried Mr Gaut's body back to his flat with socks on their hands and also attempted to clean up Osborne's home, dispose of bloodied clothing and set fire to a car to destroy incriminating evidence.\n\nHarley denied murder and said he had been asleep in another room when Mr Gaut was killed, while Evesham, who was cleared of murder earlier in the trial, denied helping to get rid of evidence and moving Mr Gaut's body.\n\nThe jury at Newport Crown Court took over five hours to return their verdicts following a three-week trial.\n\nMr Justice Lewis remanded Harley, of no fixed address, Osborne, of Long Row, Elliots Town, and Evesham, from Powell's Terrace, New Tredegar, in custody ahead of sentencing on March 25.",
    "author": "James Rodger",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/vigilante-ieuan-harley-jailed-over-16024096",
    "published": "2019-03-25 13:46:31+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}