{
    "data_id": "5983",
    "id": "activistpost--2019-11-14--Innocent Mom Speaks Out After She Was Kidnapped, Interrogated for Speaking Spanish",
    "date": "11/14/2019",
    "source": "activistpost",
    "title": "Innocent Mom Speaks Out After She Was Kidnapped, Interrogated for Speaking Spanish",
    "content": "Havre, MT — Ana Suda and Martha “Mimi” Hernandez are both U.S.-born citizens who grew up in Texas and California respectively. But their lifelong citizenship and complete lack of criminal record would have no bearing on a US Border patrol agent hell-bent on taking ‘dangerous’ Spanish speaking women off the streets of Havre, Montana. Since that fateful day on which these women were detained for speaking Spanish, Suda says her life has become a nightmare.\n\nAs TFTP reported at the time, the incident happened on May 18, 2018, as Suda and Hernandez stood in line at a local grocery store. The two ladies were having a friendly conversation—in Spanish—an entirely legal and common activity which takes place in most grocery stores everyday in this country. However, the Border Patrol Agent in line behind them, saw their conversation as nefarious. He just knew they were evil criminal scum.\n\nAs the two innocent US citizens checked out at the register, this “hero” public servant demanded to know where they were born. Remember, they had done nothing wrong and were simply speaking Spanish. Still, Suda and Hernandez complied and told the officer they were born in Texas and California. But he did not believe them.\n\nThe agent then demanded the two women hand over their driver’s licenses which were apparently not enough to get them immediately on their way. The two innocent US citizens were then held against their will—otherwise known as kidnapping—by US Border Patrol Agents who completely humiliated them in front of their friends and neighbors.\n\n“After Mimi and I told the officer that we were born in the U.S.,” Suda explained. “he demanded that we show identification. I didn’t feel like I could say no since he was in uniform and armed. We gave him our Montana driver’s licenses and then followed him outside into the store’s parking lot as directed. ”\n\nDuring their illegal detainment, Suda and Hernandez were interrogated as if they were criminals. The scene is something akin to the era of “papers please” as these entirely innocent women were temporarily kidnapped and forced to prove they weren’t “illegal” human beings who should be shipped off to some ‘camp’.\n\nHad they been “illegal,” the stop was still unconstitutional, as speaking Spanish is most assuredly not probable cause for detainment. Even if a person speaks no English at all, the state cannot detain them for it.\n\nNevertheless, this tyrant agent had no problem telling the women why he had taken them into custody. When Suda and Hernandez asked him why they were being humiliated and interrogated, the officer responded with brutal honesty.\n\nSuda explained that, “Agent O’Neal — the name on his badge — got on his car radio and asked for backup, as if two moms holding a carton of eggs were a threat. As we stood there, I felt a knot in the pit of my stomach. I told him that I was going to start filming on my cell phone. Then I made a simple request, ‘Can you tell us in video why you asked for our ID’s please.’”\n\n“He said it was because, ‘You guys are speaking Spanish which is very unheard of up here,’” said Suda.\n\nFor nearly an hour, Suda and Hernandez were held captive as other armed agents showed up in their uniforms and carrying guns—to investigate two American soccer moms—a shameful act indeed.\n\nNow, Suda is speaking out. In an interview with BBC, Suda says she and her family have faced constant harassment over the video of her rights-violating incident. She was forced to move and her family is now separated.\n\nSuda and Hernandez’ case is now the subject of an ACLU lawsuit as their detention was unlawful, unconstitutional, and entirely uncalled for.\n\nSadly, Hernandez says that her family has also been harassed repeatedly and have received hateful messages from people across the country.\n\nTheir children are even feeling the effects of this disgusting madness.\n\n“At his high school, a teacher asked Mimi’s son whether he had brought his ID to class. My 8-year-old daughter is scared to speak Spanish and has started responding to me in English when I ask her questions,” said Suda.\n\nBelow is the infuriating and saddening video from last year.\n\nMatt Agorist is an honorably discharged veteran of the USMC and former intelligence operator directly tasked by the NSA. This prior experience gives him unique insight into the world of government corruption and the American police state. Agorist has been an independent journalist for over a decade and has been featured on mainstream networks around the world. Agorist is also the Editor at Large at the Free Thought Project, where this article first appeared. Follow @MattAgorist on Twitter, Steemit, and now on Minds.\n\nSubscribe to Activist Post for truth, peace, and freedom news. Become an Activist Post Patron for as little as $1 per month at Patreon. Follow us on SoMee, Flote, Minds, Twitter, and Steemit.\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.",
    "author": "Activist Post",
    "url": "https://www.activistpost.com/2019/11/innocent-mom-speaks-out-after-she-was-kidnapped-interrogated-for-speaking-spanish.html",
    "published": "Thu, 14 Nov 2019 18:15:54 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}