{
    "data_id": "60448",
    "id": "birminghammail--2019-04-10--Speedboat killer Jack Shepherd touches down in London after extradition following months on the run",
    "date": "4/10/2019",
    "source": "birminghammail",
    "title": "Speedboat killer Jack Shepherd touches down in London after extradition following months on the run",
    "content": "Speedboat killer Jack Shepherd has touched down in London after 10 months on the run.\n\nThe 31-year-old told reporters on a Georgian Airways flight as he was extradited from Tbilisi that he acted on \"emotion and fear\" when he fled the UK and now wants to \"make amends\".\n\nHe arrived at London Gatwick on Wednesday evening and will appear at the Old Bailey in the morning, the Crown Prosecution Service (CPS) said.\n\nAngela Deal, head of extradition at the CPS said: \"Jack Shepherd has returned to the UK to face justice following close co-operation between the CPS extradition unit, UK colleagues and the Georgian authorities, to ensure a successful extradition.\n\n\"He will first appear at the Old Bailey to be sentenced for the gross negligence manslaughter conviction in connection with the death of Charlotte Brown, and then at a later date in the South West over the grievous bodily harm charge.\"\n\nPictures released by the Special Penitentiary Service of Georgia earlier on Wednesday showed a handcuffed Shepherd being led by two uniformed officers into a secure cell in the back of a van.\n\nHe was believed to have been transferred to Metropolitan Police officers at Tbilisi International Airport and boarded a plane to Gatwick.\n\nHe was sentenced in his absence last year to six years in prison over the death of 24-year-old Charlotte Brown.\n\nShe died after the pair went for a late-night speedboat ride down the River Thames in December 2015.\n\nShepherd told reporters on the plane that he and his family have received threats as a result of \"misplaced\" animosity caused by the media's misreporting of certain aspects of the case.\n\nWearing an open-collared shirt, Shepherd said: \"There really have been some complete untruths, in particular this idea that I let her drown, that I did nothing to help her, this could not be further from the truth.\"\n\nAsked why he did not stay to defend himself in court, he said: \"I wasn't thinking at the time, I was acting on emotion and fear and I made a mistake.\n\n\"But now I'm trying to make amends.\"\n\nShepherd added that he regretted not speaking to Ms Brown's family sooner, calling it his \"second biggest mistake\" after taking out the boat that night.\n\nA jury found Shepherd guilty of manslaughter by gross negligence in his absence after he skipped bail last summer.\n\nThe web designer's trial heard that he had been drinking champagne on a first date with Ms Brown when they went on the speedboat ride.\n\nHis 14ft Fletcher Arrowflyte boat had a series of defects and was speeding when it overturned near Wandsworth Bridge, throwing Ms Brown to her death in the water.\n\nShepherd, originally from Exeter, was plucked from the cold river.\n\nHe made his last appearance before the Old Bailey in November 2017 to deny manslaughter.\n\nIt was at the start of his trial last June that it emerged he would not attend court but he remained in regular contact with his defence team who pushed on without him.\n\nThe jury found him guilty and Judge Richard Marks QC sentenced him in absentia.\n\nShepherd told reporters he now felt \"ready to face\" prison and had \"come to terms\" with spending time behind bars.\n\nHe added that he felt responsible for Ms Brown's death \"in part\" but \"not to the degree of manslaughter\".\n\nShepherd will be returned before the judge from 9.30am on Thursday for the execution of a bench warrant. Then his prison sentence awaits.\n\nHe could also face extra jail time for absconding but it is not yet known when a judge may add to his sentence.\n\nShepherd was granted permission to appeal against the conviction in December and surrendered to authorities in Tbilisi the following month.\n\nThe family of Ms Brown, from Clacton-on-Sea, Essex, had publicly campaigned for Shepherd to hand himself in.\n\nHer father Graham Brown told ITV after Shepherd agreed to extradition last month that he had a weak case and \"no choice\" but to return.\n\nShepherd also faces a grievous bodily harm charge over an alleged assault in Devon on March 16 last year.",
    "author": "James Rodger",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/speedboat-killer-jack-shepherd-touches-16111577",
    "published": "2019-04-10 21:01:34+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}