{
    "data_id": "60553",
    "id": "birminghammail--2019-04-11--Speedboat killer Jack Shepherd pleads guilty as he comes face to face with victims family in court",
    "date": "4/11/2019",
    "source": "birminghammail",
    "title": "Speedboat killer Jack Shepherd pleads guilty as he comes face to face with victim's family in court",
    "content": "Speedboat killer Jack Shepherd has come face-to-face with his victim's parents in court after being extradited from Georgia.\n\nThe 31-year-old web developer admitted breaching bail and absconding as he was brought before the Old Bailey for the first time since he ran away to avoid his trial for the manslaughter of Charlotte Brown.\n\nHe touched down at Gatwick airport on Wednesday night after he handed himself in at Tblisi.\n\nShepherd, 31, appeared in the dock wearing a dark suit, light shirt and no tie, flanked by two guards.\n\nHe last appeared at the Old Bailey in November 2017, when he denied manslaughter.\n\nMs Brown's parents and both sisters sat to the side of the court with a clear view of Shepherd.\n\nLast year, Shepherd was found guilty in his absence of Ms Brown's manslaughter in a speedboat accident on the Thames and sentenced to six years in jail.\n\nAfterwards, the 24-year-old victim's devastated parents Graham Brown and Roz Wickens expressed their anger at his failure to face the consequences, having attended every day of his trial.\n\nAfter 10 months on the run, Shepherd, originally from Exeter, was brought before trial judge Richard Marks QC for the execution of a bench warrant for breaching bail.\n\nHis Old Bailey trial last June was told that Shepherd was responsible for his speedboat, which had a series of serious defects, including to its steering.\n\nJurors heard how he and Ms Brown had been drinking champagne and went on a late night high speed jaunt in his boat past the Houses of Parliament on their first date in December 2015.\n\nShepherd had handed the controls to Ms Brown just before it capsized, tipping both of them into the cold water, the court was told.\n\nThe defendant was plucked from the Thames alive, but his date was killed.\n\nAs he returned to Britain on Wednesday night, Shepherd said he had acted on \"emotion and fear\" when he fled the UK and now wants to \"make amends\".\n\nHome Secretary Sajid Javid thanked the Georgian authorities for their assistance on Twitter, adding: \"Charlotte Brown's family have endured immeasurable pain & are now one step closer to getting the justice they deserve.\"",
    "author": "James Rodger",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/speedboat-killer-jack-shepherd-pleads-16112439",
    "published": "2019-04-11 09:01:20+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}