{
    "data_id": "60709",
    "id": "birminghammail--2019-04-16--Killer Birmingham driver Connor McCaugherty jailed for further 20 months after BITING prison officer",
    "date": "4/16/2019",
    "source": "birminghammail",
    "title": "Killer Birmingham driver Connor McCaugherty jailed for further 20 months after BITING prison officer",
    "content": "Killer Birmingham driver Connor McCaugherty has been jailed for a further 20 months after TWICE biting a prison officer.\n\nThe inmate has been barred from meeting inmates after he spat at another officer at a Midlands prison.\n\nThe 28-year-old is currently serving his term at Lowdham Grange in Nottingham.\n\nMcCaugherty was jailed for 10 years for causing death by dangerous driving in Birmingham in 2011.\n\nCareer criminal McCaugherty ploughed into father-of-three Dil Bahadur Subedi after leading cops on a six-mile chase through some of Birmingham’s busiest roads.\n\nMcCaugherty had also switched off the lights on the Ford Mondeo and jumped a red light.\n\nHe fled the crash scene and torched the car in Rubery in a bid to cover his tracks.\n\nBirmingham Crown Court later heard he was clocked at 110mph on the Aston Expressway and was doing 90mph when he hit Mr Subedi, who had just finished work and was his family’s main breadwinner .\n\nThe new sentence will be served at the end of the term imposed for the driving death.\n\nNottinghamshireLive reports Luc Chignell, prosecuting, said the first prison assault took place on May 19 last year when he was told to go into his cell.\n\nOfficers tried to restrain him when one felt a sharp pain to the ribs. He discovered he had been bitten.\n\n\"He was trying to regain control by grabbing this man and was then bitten on the right hand. It was a nasty bite,\" said Mr Chignell.\n\nHe was taken to the Queen's Medical Centre for treatment to the two bites.\n\nThe officer needed injections and antibiotics because of concerns he may have caught hepatitis B through the wounds.\n\nThe second incident took place in the same prison on July 6.\n\nMr Chignell told the court: \"The defendant was being kept away from the general population under prison rule 45.\n\n\"The officer went to his cell to advise him that he would not be allowed out.\n\n\"The defendant tried to defy him and tried to leave.\"\n\nThe officer ended up in a headlock and had to be released by colleagues.\n\nMcCaughtery then spat at him.\n\nThe officer needed two days off duty because of concussion and said he was nervous about returning to the prison.\n\nMcCaughtery had denied assaulting the first officer causing actual bodily harm but was found guilty by magistrates. He admitted the second charge of common assault.\n\nWill Bennett, mitigating, told the court McCaughtery suffers from symptoms similar to post-traumatic stress disorder.\n\n\"This is as a result of the fact that he caused the death of a pedestrian in a police chase.\n\n\"The PTSD arises from that incident.\"\n\nMcCaughtery was driving a green Ford Mondeo when he struck the victim.\n\nThe car was later burnt out with a witness claiming the driver walked away laughing.\n\nHomeless McCaugherty admitted causing death by dangerous driving and trying to pervert justice by setting light to the car.\n\nWhen sentenced for the road death at Birmingham Crown Court, Judge Mark Wall QC told him: \"You killed Mr Subedi whilst you were on bail and subject to a suspended sentence.\n\n\"You drove at more than 100mph, on the wrong side of the carriageway, across pedestrian crossings and for a protracted period with your lights off.\n\n\"In terror, Mr Subedi jumped one way and his friend jumped the other. You showed a total disregard for the safety of others who were in great danger because of your actions.\"",
    "author": "Rod Malcolm, James Rodger",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/killer-birmingham-driver-connor-mccaugherty-16134581",
    "published": "2019-04-16 08:21:16+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}