{
    "data_id": "61049",
    "id": "birminghammail--2019-04-20--Ruthless killer jailed over shocking drug dealer murder is Birmingham YouTube rap star Lemz",
    "date": "4/20/2019",
    "source": "birminghammail",
    "title": "Ruthless killer jailed over shocking drug dealer murder is Birmingham YouTube rap star Lemz",
    "content": "A ruthless killer who knifed and beat to death a drug dealer in a shocking murder is a Birmingham YouTube rap star.\n\nCCTV footage captured the moment five hooded gangsters entered Przemsyslaw Golimowski's flat before murdering him in a brutal revenge killing.\n\nOne of the men convicted of his murder is 31-year-old Sparkhill drug dealer Taleb Hussain.\n\nThe 31-year-old, from Park Road, has been unmasked as a YouTube rap star who goes by the name of Lemz.\n\nHis video to his song On My Own has been more than 733,000 views on You Tube.\n\nIn the video which is filmed in Birmingham the blinged-up rapper is seen buying clothes from Selfridges and seen posing next to a £60,000 gold coloured BMW M4.\n\nHe is then seen walking out of a prison door as the video pans to the sign saying Welcome to HMP Birmingham.\n\nThe lyrics to his rap include: \"Most my friends still behind the door so I gotta go with the flow, never let them down 'cus I felt it, now the writings on the wall like a felt tip, I've got to be the next one to blow,  if I don't, f*** it, I'mma still invest into dope.\"\n\nit has also been revealed that Hussain was jailed back in 2012 as part of Operation Stalham, a long running operation in Bedford aimed at street dealers which saw nineteen people charged with drugs supply and firearms offences, resulting in total prison sentences of 54 years.\n\nHussain, whio was 24 at the time, had been running a drug dealing gang from Bedford. When arrested, he threw a loaded handgun from the front window of his house in Adelaide Square, along with another parcel containing heroin and cocaine worth £20,000. Police discovered £6000 cash in the house.\n\nThe CCTV footage taken just before Golimowski's murder shows Hussain pacing towards the Bedford home in the dead of night.\n\nHussain was later arrested in Birmingham after his bloodied palm print was found staining the stair banister in the victim's block.\n\nPrzemsyslaw, 30, was asleep in bed with his partner when the five intruders broke into his flat last September.\n\nHussain, 31, along with Damien Rooney, 25, Delpierro Mothersill, 20, Philip Mendy, 23, and Jamal Jeng, 21, then began attacking him with a knife and golf club.\n\nTheir victim fled to a neighbour's flat in a desperate bid to escape, but collapsed from his injuries.\n\nHe was pronounced dead at the scene.\n\nThe killing followed a dispute between rivalling drug dealers who were all linked to the supply of drugs.\n\nA day before the murder, Mothersill - a known drug runner for Hussain and Rooney - was attacked and robbed by Golimowski and another man.\n\nHe was injured with a pool cue during the assault at another address in Bedford.\n\nLater, police suggested that Golimowski was a drug dealer himself and had been behind a number of robberies from rival dealers.\n\nOfficers were able to track down Golimowski's five killers from the blood trail left by Jeng - who was stabbed in his leg during the killing.\n\nCCTV and analysis of mobile phone activity placed Jeng and the other four together in the run up to the attack.\n\nEarlier in the day, CCTV from Bicester Shopping Village clearly showed Hussain, Jeng and Mendy together at the site before heading back to Bedford.\n\nHussain, Rooney, Jeng, Mendy and Mothersill were captured together by CCTV at Wodka Live in St Paul’s Square less than two hours before the attack.\n\nAutomatic number plate recognition also captured a vehicle linked to Hussain driving around the town on multiple occasions.\n\nAs they entered Golimowski’s address through Duck Mill Lane, CCTV above captured five men matching the descriptions and clothing of the five men when they were caught on CCTV at Wodka Live.\n\nThe same camera also caught Hussain, Rooney, Mendy and Mothersill as they fled from the scene.\n\nHussain’s palm print was also found on the bannister leading up to the entrance to Golimowski’s flat.\n\nHussain, Rooney, of Wixams and Mothersill of Bedford, were convicted of murder at Luton Crown Court on Monday (April 15).\n\nEach were jailed for life - and ordered to serve a minimum of 26 years.\n\nMendy, from Bedford, and Jeng, from Clapham, were convicted of manslaughter and sentenced to 12 years each in prison.\n\nLenz isn't the first Birmingham rapper to be jailed.\n\nLast November Maher Ali, a YouTube rapper known as Young Smokes, an artist who bragged about drugs, cash, guns and girls was jailed.\n\nHe received a two-year sentence after cops stopped the 21-year-old in a dead-end street in Digbeth, only to find a stolen Beretta shotgun in the back of his VW Golf.\n\nOfficers also later found three machetes hidden under Ali's bed in Vaughton Street, Highgate.\n\nin March last year fellow grime star Cameron Wright - known as Killa Kam was locked up after leading an evil drugs ring which saw Class A drugs supplied on a huge scale.\n\nThe 28-year-old, from Sparkhill, provided over 100 customers with heroin and cocaine as he acted as king pin for the large-scale drugs operation in Cheltenham.\n\nKnown as Killa Kam on Birmingham's rap scene, Wright can be seen flicking through wads of cash while singing about \"getting paid\" and \"shifting gear on the space streets\" in one of his music videos.\n\nBirmingham rappers still serving time also include Reial Phillips, AKA Lynch, who was caged for 27 years over a series of gangland shootings.",
    "author": "Andy Richardson",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/ruthless-killer-jailed-over-shocking-16142071",
    "published": "2019-04-20 04:30:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}