{
    "data_id": "61458",
    "id": "birminghammail--2019-04-30--Lee Rigby killer Michael Adebowale wants to serve out sentence in Nigeria jail despite being born i",
    "date": "4/30/2019",
    "source": "birminghammail",
    "title": "Lee Rigby killer Michael Adebowale 'wants to serve out sentence in Nigeria jail despite being born in UK'",
    "content": "Lee Rigby killer Michael Adebowale \"wants to serve out sentence in a Nigeria jail\", it has been claimed.\n\nThe brazen desire from the savage terrorist comes despite him being born in the UK.\n\nRadical Michael Adebolajo and accomplice Adebowale spotted Lee wearing a Help for Heroes hoodie and mowed him down in their car.\n\nThey then jumped out and attacked him with knives and a meat cleaver, near the Royal Artillery Barracks in Woolwich on May 22, 2013.\n\n37-year-old Adebowale is currently in HMP Wakefield.\n\nHe has even written to immigration experts asking for their advice.\n\n\"It's stuffed full of lags who see him as a top target.\n\n\"He thinks he can spend the rest of his sentence in Africa.\"\n\nMr Rigby's mother Lynn reacted to the news, branding it an insult to her son.\n\nShe fumed: \"This is a disgrace and an insult to Lee.\n\n\"I'm sure he doesn't like Wakefield Prison but he has the luxury of being alive unlike my son who he stole from me.\n\n\"He should serve his sentence here and not try to exploit the law for a cushier life.\"\n\nLast year it was reported Lee's evil killer Adebolajo  has finally admitted he is \"sorry\" and told of his regret at taking the innocent soldier's life.\n\nAdebolajo has admitted his remorse in a dramatic u-turn after five years in jail - and plans on penning a letter of apology to Lee's family.\n\nThe former Christian claims he \"misinterpreted\" the holy Quran and no longer wants to be known by his Islamic name, Mujahid Abu Hamza.\n\nAdebolajo tried to behead the ­fusilier with a knife and spouted Islamic hatred as his innocent victim lay dying in the street.\n\nWith his hands covered in blood, he told witnesses to call the police, adding: \"The only reason we have killed this man today is because Muslims are dying daily by British soldiers.\n\n\"And this British soldier is one. It is an eye for an eye, a tooth for a tooth.\n\n\"Through many passages in the Koran, we must fight them as they fight us.\"\n\nBut after a stint at Belmarsh, Frankland and Wakefield jails, where staff moved him around to prevent him from influencing others, Adebolajo claims he \"feels guilty.\"\n\nA source told the Sun on Sunday that it was the first time he had ever wavered from his beliefs, making his confession \"remarkable.\"\n\nThey added: \"A month ago he approached a fellow inmate and member of prison pastoral staff to say he finally regretted the murder.\n\n“He told them he acknowledged for the first time he had taken an innocent life.\n\n“He even admitted he misinterpreted the Koran in trying to justify his horrific actions. It’s an astonishing rejection of his extremist beliefs.”\n\nHe also told prisoners he now rejects his extremist views, admitting he was \"brainwashed\" and the attack was \"misguided.\"",
    "author": "James Rodger",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/lee-rigby-killer-michael-adebowale-16200710",
    "published": "2019-04-30 08:52:07+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}