{
    "data_id": "61951",
    "id": "birminghammail--2019-05-08--Cold-blooded killers fled to Birmingham after JD Sports trip and Michael Caine movie",
    "date": "5/8/2019",
    "source": "birminghammail",
    "title": "'Cold-blooded' killers fled to Birmingham after JD Sports trip and Michael Caine movie",
    "content": "Two men who calmly shot a man dead in \"cold blood\" before watching a Michael Caine crime film have been found guilty of murder.\n\nHashim Abdalla Ali, 22, was hit in the chest while sitting in the passenger seat of a car outside his father's flat in Hayes, west London.\n\nThe driver attempted to take the victim to hospital, but crashed en route while trying to overtake traffic, the Old Bailey heard.\n\nA doctor flew in by air ambulance and performed open heart surgery at the scene, but the victim was pronounced dead shortly after.\n\nJuskiran Sidhu, 28, and Babatunde Philip Fashakin, 26, walked away from the scene on Central Avenue, before buying new outfits at JD Sports and watching true crime film King Of Thieves at a cinema, it was claimed.\n\nAn Old Bailey jury found both men guilty of murder and they were remanded into custody to be sentenced next Tuesday.\n\nProsecutor Crispin Aylett QC told jurors the motive for the \"cold blooded\" killing was not known, or whether the real target was the victim or the driver of the car.\n\nHe told how, on the afternoon of October 11 last year, shocked witnesses heard a loud bang as the victim was shot before the killers walked away.\n\nAfterwards, Sidhu and Fashakin travelled to a JD Sports in Staines in Surrey where they bought new outfits, dumped their old clothes in a bin then headed to the cinema.\n\nSidhu, of Hayes, was arrested in Birmingham nearly three weeks later on October 30, in a hotel room booked under a false name.\n\nFashakin, of Rothwell, Northamptonshire, was arrested at Aston University student accommodation in Birmingham on November 6.",
    "author": "James Rodger",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/cold-blooded-killers-fled-birmingham-16245856",
    "published": "2019-05-08 16:24:51+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}