{
    "data_id": "62105",
    "id": "birminghammail--2019-05-15--Thats justice bro - killers who shot man in car amid drugs feud FIGHT in dock as theyre jailed f",
    "date": "5/15/2019",
    "source": "birminghammail",
    "title": "'That's justice bro' - killers who shot man in car amid drugs feud FIGHT in dock as they're jailed for life",
    "content": "Two killers arrested in Birmingham fought in the dock after they were jailed for life for the cold-blooded murder of a car passenger who was shot in the heart.\n\nBabatunde Fashakin lunged at Juskiran Sidhu and shouted: \"You are a coward\" in astonishing scenes at the Old Bailey .\n\nFashakin repeatedly punched his fellow killer in the face before he was restrained by security guards.\n\nA member of the public could be heard saying: \"That's justice bro.\"\n\nIt happened after both were jailed for life and told they would serve at least 30 years.\n\nThe killers were both convicted of murdering 22-year-old Hashim Ali over a drugs feud following a trial, MyLondon reported .\n\nHe was shot dead as he sat in a friend's Mercedes C300 in Hayes, West London.\n\nFashakin, 26, went for Sidhu, 26, after they were sentenced.\n\nJudge Nigel Lickley QC concluded that Hashim was shot as part of an \"ongoing feud\" which was \"undoubtedly based on drug dealing\" .\n\nHe said the crime was made more serious as he was shot in public, \"in broad daylight\" and close to the busy Uxbridge Road.\n\nThe judge said the pair would have decided to carry out the \"assassination\" very quickly after seeing the car containing Hashim, estimating it was \"less than 50 seconds\".\n\nHe told them: \"You walked with purpose, with your hoods up. He was unable to defend himself, trapped by his position in the car. You ambushed him and shot him in a ruthless and brutal act of violence.\"\n\nThe judge concluded Sidhu was the gunman after video footage showed him \"overtake Fashakin\" so he was the first to reach the car.\n\nSidhu was also the first to dispose of his clothes after the murder, which Judge Lickley said \"could only have been because [he] believed the clothes were contaminated\" by evidence of gunfire.\n\nFashakin removed his clothes later and the pair bought matching tracksuits and went to the cinema to hide. The judge described how Sidhu re-enacted his crime in front of friends, in the proximity of members of the public, and that Fashakin was unmoved.\n\nJudge Lickley said: \"You showed no emotion or sign of anxiety. When Sidhu demonstrated the shooting to a friend, you did not react because you knew precisely what had happened.\"\n\nThe judge therefore concluded that, though he did not fire the gun,\n\nFashakin was \"party to the agreement to shoot and kill\" as the pair \"worked as a team\".\n\nHe also determined, from the fact that neither man has \"any means of supporting their life\", that they were \"part of an organised drug operation\" \n\nand that this was a \"dispute between criminal organisations which spilled on to the streets of London\".\n\nBoth men were on the run until they were arrested in Birmingham. Sidhu was arrested on October 13 at a hotel, whereas Fashakin was arrested at student accommodation on November 6.\n\nHe read out a long list of previous convictions for both men, who had both been offending since their teenage years.\n\nSidhu had previously been convicted of offences including dangerous driving, possession of heroin with intent to supply and conspiracy to produce a class B drug.\n\nFashakin, meanwhile, had previously committed drug offences, attempted robbery, possession of an offensive weapon and the theft of £10,000 in cash.",
    "author": "Vicky Munro",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/thats-justice-bro-killers-who-16277517",
    "published": "2019-05-15 09:03:25+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}