{
    "data_id": "622008",
    "id": "thedailymirror--2019-01-10--Payment giant PayPal is trying to make an innocent customer pay for the actions of online fraudsters",
    "date": "1/10/2019",
    "source": "thedailymirror",
    "title": "Payment giant PayPal is trying to make an innocent customer pay for the actions of online fraudsters",
    "content": "According to PayPal, it’s doing the decent thing by ­refunding a customer who was the victim of an online fraud.\n\nTrouble is, it’s doing this by trying to claw back money from another innocent victim of the same fraud.\n\nThe nightmare for Rosie Pritchard began with what appeared to be a Facebook message from a family friend asking for a favour: “I sold some things online and my account is currently limited. Can you receive a payment, withdraw it and then bank transfer to me?”\n\nRosie kindly agreed to help and £420 then appeared in her PayPal account, paid by someone called Nigel Stokes, and Rosie transferred it as requested.\n\nUnfortunately, she sent it to crooks who had compromised the friend’s Facebook page as well as the PayPal account of Nigel Stokes.\n\nWhen Nigel realised that the money had been stolen from his account, he complained to PayPal, who refunded him.\n\nThen the payment giant debited the money from Rosie’s account and, because her balance was zero, that left her £420 in the red.\n\n“I’m a single mum who simply doesn’t have this sort of money and I now face having to pay for the crimes of a scammer and PayPal’s insecure payment system,” said Rosie, from Leatherhead in Surrey.\n\nPayPal told Rosie, “You used those funds”, which seems to be unreasonably implying that she got some sort of benefit from this fraud.\n\nWhen she refused to repay the money, it emailed her: “This is an urgent matter that requires your immediate attention to ensure continued ­availability of your PayPal account to avoid ­additional collection efforts.”\n\nSure enough, it put debt collectors Wescot Credit Services on to her.\n\nPayPal confirmed to me that it had refunded Mr Stokes “after a thorough investigation”, but blamed Rosie for “removing the money from the PayPal network” when she inadvertently forwarded it to crooks.\n\nIt insisted: “We are working with Ms Pritchard to find a way of helping her manage this debt” – missing the point that Rosie does not believe it is her debt at all.\n\nI tried explaining to PayPal that she received the money in good faith and no longer has it, thanks to the actions of scammers, and is only in this position because Mr Stokes’ account had somehow been compromised.\n\n“Should she carry full, or even any, responsibility for what has happened?” I asked.\n\nPayPal responded by still blaming Rosie, saying: “We go to great lengths to protect our customers, but there are still some basic precautions we should all take to avoid scams.”\n\nI persisted, in a series of emails with PayPal, telling them: “This happened because of a ­compromised account. Shouldn’t PayPal take responsibility for this?”\n\nThey wouldn’t budge, saying: “We have taken responsibility for that unauthorised payment by returning the funds to the sender.\n\n“While Ms Pritchard was not responsible for receiving the ­unauthorised payment, she is responsible for sending the money to (presumably) the fraudster’s bank account.”\n\nStrangely, Rosie has received a letter from the debt collectors saying they are no longer chasing the money, but she’s had no further word from PayPal.\n\nLast summer, the Financial Ombudsman Service said that banks too often claimed that frauds were the fault of customers.\n\n“The evolution of criminals’ methods, in particular, sophisticated use of technology and manipulative ‘social engineering’, means it’s an increasingly difficult case to make,” said Caroline Wayman, chief ombudsman. Maybe that should apply to payment facilities like PayPal as well as banks.",
    "author": "Andrew Penman",
    "url": "https://www.mirror.co.uk/news/uk-news/payment-giant-paypal-trying-make-13835175",
    "published": "2019-01-10 07:13:30+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}