{
    "data_id": "62340",
    "id": "birminghammail--2019-05-28--Convicted killer threatened to rape woman before murdering nail technician mum-of-two",
    "date": "5/28/2019",
    "source": "birminghammail",
    "title": "Convicted killer 'threatened to rape woman before murdering nail technician mum-of-two'",
    "content": "A convicted killer threatened to attack and rape a woman about a month before he murdered a \"beautiful\" Vietnamese mother-of-two, an inquest has heard.\n\nNail technician Quyen Ngoc Nguyen was murdered by Stephen Unwin and William McFall on August 15 2017 before being dumped in her own car and set alight on Shiney Row, near Sunderland.\n\nThe pair, who were convicted of the 28-year-old's murder and sentenced to full-life terms in April last year, had previously committed separate murders and met while in prison for those offences.\n\nThey met Ms Ngoc Nguyen while working as handymen on several flats she was renting out, their trial at Newcastle Crown Court heard.\n\nAn inquest into her death started on Tuesday at Sunderland Coroners' Court after coroner Derek Winter decided it was necessary to look into whether the police and probation service missed opportunities to prevent the murder.\n\nFor the latest on trials and court cases from across Birmingham and the West Midlands, join BirminghamLive's Court Facebook group .\n\nThe court heard that Unwin, of Houghton-le-Spring, Sunderland, was released from jail on licence on December 20 2012, with Northumbria Police receiving 26 \"items of intelligence\" between his release date and the murder of Ms Ngoc Nguyen.\n\nDetective Inspector Edward Small told the court one of those items related to a complaint from a woman that, on July 2 2017, Unwin had sent her a Facebook audio message threatening to \"smash her jaw in\" and take turns with another man to rape her.\n\nThe court heard that the complainant in that incident had mentioned to officers over the phone that Unwin had served prison time for murder.\n\nThe officer who looked into the complainant's report the following day, Pc Sarah Strong, told the inquest she \"can't remember\" whether she was aware the alleged offender was a convicted murderer at the time.\n\nPc Strong said it was probable that she would have only briefly read the force's report on Unwin before speaking with the complainant on July 3 2017, due to the time pressure caused by having to investigate numerous cases on a day-to-day basis.\n\nShe told the inquest the alleged victim had not taken the complaint any further, and the investigation effectively ended then.\n\nAsked whether an alleged threat from a convicted murderer should have prompted more action, Pc Strong said: \"Unfortunately these types of threats are not uncommon and are the kind of things that people do say on Facebook.\"\n\nMr Small said a change in how the force logged \"flags\", meaning relevant intelligence, regarding prisoners out on licence would have meant that incidents like Unwin's alleged threat were not automatically passed to probation services.\n\nFrom 2013 the force operated a system where flags on an on-licence offender's record would be passed to probation officers through the force's Multi-Agency Public Protection Arrangements (Mappa).\n\nBut he said that, in a bid to reduce workload, from April 24 2015 warnings about an offender's behaviour would have to be reported to probation officers through a police officer at their own discretion.\n\nMr Small said that, in December last year, Northumbria Police introduced a system whereby flags against an offender would be passed to a \"multi-agency safeguarding hub\", as well as to probation services through the investigating officer.\n\nDetective Chief Inspector Lisa Laverick told the inquest that, despite the change in 2015, a message on Unwin's report incorrectly said that flags would be passed on to probation through Mappa.\n\nDiscussing the scope of the inquest, which is expected to last nine days, the coroner said he will consider whether the killers' levels of risk were properly assessed.\n\nHe said witnesses will also be questioned on whether information relevant to a \"potential recall\" of the men before Ms Ngoc Nguyen's death was brought to the attention of the relevant parties.",
    "author": "James Rodger",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/convicted-killer-threatened-rape-woman-16345129",
    "published": "2019-05-28 20:13:16+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}