{
    "data_id": "62493",
    "id": "birminghammail--2019-05-29--Police still hunting killer of Keelan Wilson 15 despite arresting NINE people",
    "date": "5/29/2019",
    "source": "birminghammail",
    "title": "Police still hunting killer of Keelan Wilson, 15, despite arresting NINE people",
    "content": "Twelve months on from the tragic death of a Wolverhampton schoolboy the police manhunt for the killer continues.\n\nDetectives investigating the murder of Keelan Wilson have launched a fresh plea for information a year on from his death.\n\nThe 15-year-old was discovered with fatal stab wounds following reports of disorder in Langley Road, Merry Hill, at around 11pm on May 29, last year.\n\nWest Midlands Police issued a statement on the anniversary of the murder to say detectives continue to work on the case in the pursuit of Keelan's killer or killers. \n\n  \n\nSo far, nine teenagers have been arrested in connection with his murder and released under investigation as enquiries continue. \n\n\n\n\n\nOfficers are now re-appealing, on the 12-month anniversary of his sad death, for anyone with information to come forward. \n\n  \n\nDetective Chief Inspector Chris Mallett, from the force's homicide team, said: \"It is exactly a year on from Keelan's tragic death and we are just as determined now, as we were then, to get justice for his family. \n\n  \n\n\"This is a complex investigation and there is ongoing work which is not always visible to the public. \n\n  \n\n\"However, we continue to need your help in catching Keelan's killer or killers. I appreciate there may have been people who didn't feel they could speak to officers at the time due to a sense of misguided loyalty.\n\n\n\n\"But this a 15-year-old boy, who had his life ahead of him, who has been taken away at the hands of a knife and we need to ensure justice prevails. Any piece of information, however insignificant you feel it is, could be crucial in cracking the case.\" \n\n  \n\nAnyone with any information should call police on 101, or via Live Chat at west-midlands.police.uk between 8am and midnight. Alternatively, information can be given anonymously to Crimestoppers on 0800 555 111.",
    "author": "Oprah Flash",
    "url": "https://www.birminghammail.co.uk/black-country/police-still-hunting-killer-keelan-16345795",
    "published": "2019-05-29 09:15:14+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}