{
    "data_id": "6253",
    "id": "activistpost--2019-12-13--“Drug Recognition Experts” Arresting Innocent, Sober People for DUI at Alarming Rate All Based on a ",
    "date": "12/13/2019",
    "source": "activistpost",
    "title": "“Drug Recognition Experts” Arresting Innocent, Sober People for DUI at Alarming Rate All Based on a Hunch",
    "content": "As TFTP has reported on numerous occasions, motorists in police state USA are snagging DUI charges for being stone-cold sober. Roadside extortionists with badges calling themselves “experts” are the main culprits, according to several sources. Now, it seems, mainstream news media outlets are catching up on the sanctioned extortion and bravely reporting on the phenomena.\n\nAccording to ABC 15 Arizona, stone-cold sober drivers in Phoenix, AZ are getting DUIs and have to spend thousands of dollars proving their innocence. It seems the source of the misunderstandings and illegitimate arrests, once again, come from Drug Recognition Experts (DRE), cops with badges and fancy titles who claim they can look at a motorist and on observation alone determine if someone is impaired.\n\nYou’d have to be God to know if someone is under the influence by simply looking at them. With that being the issue, worse still is the fact the DRE’s testimony often holds up in court without so much as a failed breathalyzer or a dirty toxicology report showing alcohol and drugs in someone’s system.\n\nOne Phoenix cop in particular, Officer David Morris, has made 56 DUI arrests since April 2018. In a state which annually doles out over 21,000 DUIs per year, Morris’ numbers are not all that astounding. It’s just that several of his alleged perpetrators whom he arrested for DUI were absolutely, completely, 100 percent, sober.\n\nTasha McConnell said her DUI was traumatizing. She said she was pulled over for failing to come to a complete stop at a stop sign but that Morris wanted to dig into her drug history immediately asking her what drugs she was taking, prescription or otherwise. He told her that “eye tremors” were giving her away and his supposed DRE experience made an expert at determining impairment. McConnell told the press:\n\nMike Toth also got arrested and charged for DUI after revealing to Morris he was taking antacids for his acid reflux. The officers involved in his arrest allegedly told him even acid pills could impair his judgement. Seriously. Originally pulled over for failing to maintain his lane, Toth described what happened next.\n\nIncredulously, Phoenix PD and its leaders fail to see a problem in their officers’ actions in depriving people of their freedom, humiliating them, forcing them to lose sleep, and fight for their good name. No, the chain of command seems more content with business as usual than ensuring the public is fairly protected against unlawful arrests, searches, and seizures. Phoenix PD Detective Kemp Layden defended his DRE officers’ actions saying, in effect, even though the motorists’ blood tests were clean, there’s still doubt as to whether or not they’re impaired. Layden said:\n\nKemp and his so-called “experts” (phony experts according to many police accountability activists) quite possibly may be the latest iteration in policing for profit. Here’s the possible scam. Get enough cops certified as “experts” at detecting drugs and the system can be flooded with many more DUI cases, fattening the wallets of DUI lawyers, filling the prosecutors’ dockets, enriching the court by way of court fees, and getting the crooked judges who go along with it to easily get reelected for being “tough on crime”. Yeah right! It’s the antithesis of being tough on crime. It’s actually condoning highway robbery!\n\nLet’s face it. Experts are developed, not rubber stamped. They’re learned, educated people who can lecture on a topic without referring to their notes. What they are not are high-school graduate cops who can sniff out drugs better than a drug dog by filling out a checklist and declaring someone to be under the influence. It’s one of the scariest scams we’re aware of, and we’ve reported on it many times before in states all across the union.\n\nOur readers may remember a Buckeye, AZ cop who was also a DRE. He believed a child with Autism was under the influence of drugs while he was stimming, fidgeting with his string. It’s what some autistic kids do to de-stress. Officer David Grossman threw the boy down to the ground, injuring him to the point of surgery, and costing the taxpayers $5 million dollars when they sued. Yeah…that kind of expert…the kind who cannot tell an autistic kid from a meth head.\n\nWe interviewed a mid-30s Colorado man who got a DUI in Phoenix while as sober as the day is long. He stated he got a DUI one evening while serving as the designated driver for his friend squad. Unfortunately for David (not his real name for fear of retaliation), a Phoenix police officer pulled him over, gave him a field sobriety test, which he failed, and cited him for DUI.\n\nDavid says he failed the roadside tests because he has a debilitating physical condition called vertigo and he simply has difficulty balancing on his feet. David claims his ailment in no way affects his driving. He says he blew .000 on the breathalyzer, and even with a clean toxicology report, the DUI stuck.\n\nThat’s right America. The cops who are sworn to protect and serve your constitutional rights are the same ones who can lie and say you’re impaired without any proof, and it will stand up in a court of law. That’s precisely why we need police activists and accountability advocates. The DRE scam is one such example of how cops are getting away with expert extortion and there’s not a damn thing anyone can do about it.\n\nJack Burns is an educator, journalist, investigative reporter, and advocate of natural medicine. This article was sourced from The Free Thought Project.\n\nSubscribe to Activist Post for truth, peace, and freedom news. Become an Activist Post Patron for as little as $1 per month at Patreon. Follow us on SoMee, Flote, Minds, Twitter, and Steemit.\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.",
    "author": "Activist Post",
    "url": "https://www.activistpost.com/2019/12/drug-recognition-experts-arresting-innocent-sober-people-for-dui-at-alarming-rate-all-based-on-a-hunch.html",
    "published": "Fri, 13 Dec 2019 18:11:34 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}