{
    "data_id": "62806",
    "id": "birminghammail--2019-06-02--EXCLUSIVE - Drugs kingpin John Anslow batters Lee Rigby killer in jail feud",
    "date": "6/2/2019",
    "source": "birminghammail",
    "title": "EXCLUSIVE - Drugs kingpin John Anslow batters Lee Rigby killer in jail feud",
    "content": "BLACK Country drugs baron John Anslow – the mobster whose jail escape made national headlines – has been involved in a violent prison clash with the killers of soldier Lee Rigby.\n\nAnd the underworld kingpin, sentenced to 22 years for orchestrating a coke and cannabis distribution network, got the better of the brawl, his father, John Snr, claimed.\n\nThe fight was the culmination of simmering bad blood between Tipton’s Anslow, who spent 439 days on the run before being snared in Northern Cyprus, and Michael Adebolajo and Michael Adebowale.\n\nAnslow, whose cell in high-security nick Belmarsh neighboured the terrorists’ lock-ups, had become increasingly agitated over the pair’s loud, all night conversations.\n\nHis dad said: “All night and all day they were shouting. One each side of him. One tried to put it on him and came off worst. John got him on the floor and was throwing punches before the screws pulled him off. He gave it to him. He stood his ground and had a go back.”\n\nHe added: “They (Adebolajo and Adebowale) are the worst of the worst. I’d like to do to them what they did to Lee Rigby.”\n\nA spokesperson from the Ministry of Justice questioned the claim, although, without a date for the incident, admitted a probe into the allegation was near impossible.\n\nShe stressed strict conditions were in place to prevent Adebolajo and Adebowale mingling with other Belmarsh inmates. Such a confrontation would be ‘unlikely’, she claimed.\n\nThe extremists’ savage crime revolted the nation. On May 22, 2013, they mowed down 25-year-old Lee near Woolwich’s Royal Artillery Barracks, in London, then hacked him to death with knives and a cleaver in the road. They yelled to passers-by that Lee had been targeted in retaliation over the killing of Muslims by British soldiers.\n\nIn February 2014 both men were sentenced to life: Adebolajo, aged 28, is one of the few UK prisoners serving a whole life term. He is destined to die behind bars.\n\nBefore being snared, father-of-three Anslow posted message of support for our troops. But John Snr questions why the 38-year-old was placed in close prison proximity to the extremists – and in earshot of their radical views. Following the incident, which occurred a couple of years ago, Anslow was transferred to Frankland Prison, County Durham, and is currently incarcerated at HM Prison, Wakefield, the largest high security prison in Britain.\n\nHe and his father are glad to see the back of Belmarsh’s ultra-strict regime. The Thamesmead, London, institute is used for the detention of terrorists.\n\n“It was a joke,” said John Snr, who now lives in London, “there was no sympathy (towards visitors).” He previously dubbed the prison barbaric.\n\n“He is OK and half way through (his sentence). He can get out more and mix with the general prison population.”\n\nIn 2012 Anslow was convicted, while still in hiding, of conspiracy to supply Class A drugs, appealed over his long sentence three years later – and failed.\n\nHe gained a global reputation as a gangster after being sprung from a prison van taking him to crown court.\n\nKnown on the streets as Skitz, the hardman was liberated from outside Redditch’s Hewell Prison in January, 2012, by a masked gang armed with sledgehammers. They drove off in a silver Merc.\n\nAnslow was the first Category A prisoner to escape since 1995 and the break-out earned him an additional seven years.\n\nHe was no shrinking violet while evading the long arm of the law, taunting police on social media sites. Threads on one Twitter account - OutOntheRun – included: “Lapping it up in the sun! I hear they don’t even talk about me on the news back home anymore.”\n\nOn Facebook he posted a defiant message: “Go on, jog on, walk on, goodbye, bon voyage, f*** off - and **** everybody that got a problem with me.”\n\nAnother site titled ‘John Anslow Is An Innocent Man Being Set Up’ has clocked up more than 300 ‘likes’.\n\nThe villain’s whereabouts gripped the nation, with reports of sightings in Spain, Morocco and the UK - including Birmingham city centre.\n\nChillingly, at the height of the manhunt, our newsdesk received a gloating, anonymous call pin-pointing the fugitive’s location.\n\n“You’re not even close,” the underworld figure told this reporter. “John’s in Northern Cyprus.”\n\n“You think you know everything,” he laughed.\n\nPolice asked the Sunday Mercury not to report the information in the name of “responsible reporting”. We agreed.\n\nAnslow was collared in March 2013 in the desolate Alsancak district of Northern Cyprus – a country which has become the criminal fraternity’s new bolthole because it shares no extradition treaty with the UK.\n\nBut he was arrested on suspicion of immigration offences and deported by the Turkish Cypriot authorities.\n\nLike his prison breakout, Anslow’s escape from the UK – despite airports and ports being placed on high alert – was the stuff of big screen gangster blockbusters.\n\nSources informed this paper he was smuggled out of the country in a metal freight box.\n\nHe spent three days in the box, briefly seeing daylight when the tanker docked in Italy. He only emerged when the cargo was finally unloaded in Turkey.\n\nFrom there, Anslow – subject of an international hunt and with a £10,000 reward on his head – travelled to the gangster paradise of Northern Cyprus.\n\nJohn Snr has always maintained his son’s luxury lifestyle – the Wolverhampton Wanderers fanatic spent £36,000 on sponsorship at Molineux – was built on elaborate gambling scams, not narcotics.\n\nBack in 2014, he said: “Yes, he’s dabbled in drugs, but not to the extent that’s been said. My son’s no angel – far from it – but he’s not what they’ve made him out to be.\n\nClaims that Anslow was a mere minnow in the illicit drugs trade were not borne out by information and evidence gathered by the police.\n\nA bug in his Bradley flat revealed a far-reaching drugs network. A subsequent raid uncovered a Rolex watch and tell-tale signs of a luxury lifestyle funded by thousands of pounds of cocaine and cannabis.\n\nFrom Anslow’s Tipton manor, large quantities of drugs were distributed nationally.",
    "author": "newsdesk@birminghamlive.co.uk (Mike Lockley)",
    "url": "https://www.birminghammail.co.uk/black-country/exclusive-drugs-kingpin-john-anslow-16367124",
    "published": "2019-06-02 10:29:51+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}