{
    "data_id": "62907",
    "id": "birminghammail--2019-06-03--Lee Rigbys killers battered in prison by John Anslow and everyone is saying the same thing",
    "date": "6/3/2019",
    "source": "birminghammail",
    "title": "Lee Rigby's killers 'battered in prison' by John Anslow and everyone is saying the same thing",
    "content": "BirminghamLive readers have flocked to social media after it emerged John Anslow – the mobster whose jail escape made national headlines – was allegedly been involved in a violent prison clash with the killers of soldier Lee Rigby.\n\nThe fight was the culmination of simmering bad blood between the underworld kingpin , sentenced to 22 years for orchestrating a coke and cannabis distribution network, and Michael Adebolajo and Michael Adebowale.\n\nAnslow, whose cell neighboured the terrorists’ lock-ups, had become increasingly agitated over the pair’s loud, all night conversations and ultimately got the better of the brawl, his father, John Snr, claimed.\n\nAnslow became infamous after being the first category A prisoner to escape custody in more than 17 years.\n\nThe underworld kingpin was sprung from a prison van in a \"well-orchestrated armed ambush\" in January 2012 whilst he was being taken from Hewell Prison in Redditch to Stafford Crown Court.\n\nThe Black Country criminal, then 35, went on the run after a gang of three masked men stopped the prison van, smashed its windows with sledgehammers and punched its driver.\n\nAnslow had led a lavish lifestyle as head of a major drugs ring selling cocaine and cannabis across the West Midlands, and he was due to be transferred to a high security jail.\n\nHis dad said: “All night and all day they were shouting.\n\n\"One each side of him.\n\n\"One tried to put it on him and came off worst.\n\n\"John got him on the floor and was throwing punches before the screws pulled him off.\n\n\"He gave it to him.\n\n\"He stood his ground and had a go back.”\n\nHe added: “They (Adebolajo and Adebowale) are the worst of the worst.\n\n\"I’d like to do to them what they did to Lee Rigby.”\n\nBefore being snared, father-of-three Anslow posted message of support for our troops.\n\nBut John Snr questions why the 38-year-old was placed in close prison proximity to the extremists – and in earshot of their radical views.\n\nFollowing the incident, which occurred a couple of years ago, Anslow was transferred to Frankland Prison, County Durham, and is currently incarcerated at HM Prison, Wakefield, the largest high security prison in Britain.\n\nHe and his father are glad to see the back of Belmarsh’s ultra-strict regime.\n\nThe Thamesmead, London, institute is used for the detention of terrorists.\n\n“It was a joke,” said John Snr, who now lives in London, “there was no sympathy (towards visitors).”\n\n“He is OK and half way through (his sentence). He can get out more and mix with the general prison population.”\n\nBirminghamLive readers have flocked to have their say on social media.\n\n\"Great news, this man deserves an award\" wrote Rose Richardson, while Paresh added: \"Good news 100% proud of him!\"\n\n\"Well done lad! We are all super proud of you,\" added Alison.\n\nJohn Nooman added: \"As a former soldier, thank you.\"\n\n\"Should have his sentence reduced,\" Steve Morgan said.\n\nBut not everybody agreed, with one BirminghamLive reader condemning those lauding his actions.\n\n\"An eye for an eye makes us all blind,\" they wrote.\n\nA second concurred, writing: \"I can't believe people are condoning violence.\"\n\nDetails of the drugs empire that Anslow led were revealed by police after he was cleared of a murder charge.\n\nWest Midlands Police said he used drugs cash to fund a lavish lifestyle of fast cars and luxury holidays.\n\nBetween July 2010 and March 2011 he splashed out £24,000 on holidays to the Dominican Republic, St Lucia and Bangkok, which were paid for in cash.\n\nHe also owned several high-value cars and showered his partner with Rolex watches and diamond jewellery that were collectively valued at £26,440.\n\nThe avid Wolverhampton Wanderers fan also spent more than £36,000 in sponsorship at the Molineux Stadium between 2008 and 2011.\n\nPolice also found £107,900 in cash hidden inside two safes at his home.\n\nOn 11 February 2011, two days after the Liverpool drugs find, West Midlands Police officers uncovered half a kilo of 100 per cent pure cocaine along with cutting agents and a drugs press at a Tipton business premises belonging to one of Anslow’s associates.\n\nHe was caught when police in Liverpool tracked a local drug dealer to an address in February 2011 and uncovered cannabis with a street value of more than £1.1 million.\n\nThe drugs courier linked back to Anslow’s Tipton home and phone analysis revealed regular contact between Anslow and the men monitored by Merseyside Police.\n\nRealising he was wanted for questioning, Anslow sent West Midlands Police a Spanish postcard in an attempt to convince detectives he’d fled to the continent.\n\nBut police didn’t fall for the trick and found him lying low on August 12, 2011 in a Bewdley caravan park.",
    "author": "newsdesk@birminghamlive.co.uk (James Rodger)",
    "url": "https://www.birminghammail.co.uk/black-country/lee-rigbys-killers-battered-prison-16369521",
    "published": "2019-06-03 07:51:45+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}