{
    "data_id": "63005",
    "id": "birminghammail--2019-06-17--Horror moment killer neighbour climbs window before trio beat Kevin Shepperson to death",
    "date": "6/17/2019",
    "source": "birminghammail",
    "title": "Horror moment killer neighbour climbs window before trio beat Kevin Shepperson to death",
    "content": "This was the horrifying moment a man climbed from one flat to another - before \"viciously\" pulverising a man to death with a dumbell.\n\nWayne Kendall climbed from his own flat in Bloxwich Road South, Willenhall into the home of victim Kevin Shepperson who lived directly above.\n\nThe 22-year-old sneaked into Mr Shepperson’s flat via a window before letting cousin Nazeem Kendall, aged 22, and Camerron Mackenzie, 21, into the property. The video can be viewed above.\n\nOnce inside, the trio battered Mr Shepperson with a dumbbell weight.\n\nMr Shepperson was later discovered the following day by a friend.\n\nThe 39-year-old was found with his hands and feet tied and a belt strap around his neck; his TV and PlayStation had also been taken.\n\nA post mortem examination revealed he was repeatedly stamped on, suffered rib fractures and brain injuries.\n\nWest Midlands Police discovered the tragic victim's bank card had been taken and used to pay for a hotel stay hours after he was killed.\n\nIn December 2018, Camerron Mackenzie, of Richmond Street, Walsall, pleaded guilty to murder and today (June 17), following a three-week trial at Wolverhampton Crown Court, Wayne of Bloxwich Road South, Walsall and Nazeem, of no fixed abode, have been found guilty of murder and robbery.\n\nThe three men will be sentenced at a later date.\n\nThe three men will be sentenced at a later date.\n\nMackenzie, following the killing on August 21 last year , used his own details for a hotel reservation.\n\nBoth Mackenzie and Wayne Kendall were arrested just two days after Mr Shepperson’s body was discovered. Nazeem Kendall was detained two weeks later.\n\nDetectives found the victim’s blood on a dumbbell in Wayne Kendall’s flat – along with the stolen electrical items – and DNA recovered from skin scrapings found under the victim’s fingernails failed to rule out Nazeem as a potential suspect.\n\nIn an emotional tribute, Mr Shepperson’s family said: \"On 22 August 2018 our lives were torn apart when we were informed that our son Kevin had died.\n\n\"To find out this information was bad enough but to have someone deliberately and viciously beat and stamp on him until his injuries caused his death is unbearable.\n\n\"Kevin has had his struggle over the years with addiction but the only person he hurt was himself. At the time of Kevin’s death he had turned his life around.\n\n\"We are pleased that the people responsible for Kevin’s death, whose only aim was to profit from stealing his property for their own enjoyment, have been found guilty of his killing.\n\n\"The past ten months have been a nightmare and have been an emotional and painful time. No parent should ever have to bury their child.\n\n\"We would very much like to thank the Police, specifically the Homicide Department who completed a thorough investigation into what happened to our son and we cannot thank them enough.\n\n\"They stood up for Kevin when he was unable to have a voice.\n\n\"The amount of work and hours spent on the investigation has been extensive and we really appreciate everyone’s efforts.\n\n\"We have been supported throughout our ordeal by our family liaison officers who have been our rock.\n\n\"We would like to thank Mr Kent and Ms Wolf, our legal team, for presenting the evidence provided by the police and successfully getting the right outcome for Kevin.\n\n\"No sentence given will ever be enough for our son’s life but it is a comfort that the people responsible are now behind bars and unable to hurt other innocent people.\n\n\"We miss Kevin terribly and I can’t imagine that this will ever go away.\"\n\nDetective Sergeant Tim Longbottom, from force CID said: \"This was a brutal attack on a man in his own home.\n\n\"Mr Shepperson was very security conscious and yet they managed to climb up via the window to pursue their attack.\n\n\"The cowardly group not only killed him, they stole his belongings and continued to spend the dead man’s money.\n\n\"Fortunately CCTV enabled us to track them down and we are very pleased to see them all behind bars.\"",
    "author": "newsdesk@birminghamlive.co.uk (Ashley Preece)",
    "url": "https://www.birminghammail.co.uk/black-country/horror-moment-killer-neighbour-climbs-16444164",
    "published": "2019-06-17 18:48:39+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}