{
    "data_id": "6327",
    "id": "activistpost--2019-12-20--Watch as Cops Frame Innocent Brothers for Cocaine, Try to Destroy Video — But it Survived",
    "date": "12/20/2019",
    "source": "activistpost",
    "title": "Watch as Cops Frame Innocent Brothers for Cocaine, Try to Destroy Video — But it Survived",
    "content": "New York, NY — To all those who make the bogus claim of “if you don’t do anything wrong, you have nothing to worry about,” consider the following case as even more evidence of how ridiculous that assertion is. Two innocent brothers were framed by NYPD cops who were caught on video destroying video evidence of their egregious act. Luckily for the brothers, the hard drive in the video recorder survived and it caught these badged criminals in the act.\n\nEarlier this year, apparent criminals with the NYPD’s gang unit executed a search warrant on a store owned by two brothers. The entrepreneurs had committed no crime, were conducting 100% legal business, yet they were kidnapped by officers and caged for over a month on false charges.\n\nThe cops accused the brothers of having a large amount of cocaine and when they were booked into jail, the DA’s office provided no documentation and asked for the two brothers to be held without bail.\n\n“It was the worst day of my life,” said one of the brothers, who asked not to be identified by name, according to NBC 4. “We never had drugs in the store,” he added.\n\nHighlighting the level of criminality associated with this raid is the fact that the cops used the notoriously faulty field test kits to test the “cocaine.” As TFTP has reported on numerous occasions, tens of thousands have been convicted and served time for crimes they didn’t commit because the cases against them relied on horribly unreliable field drug test kits. So prone to errors are the tests, courts won’t allow their submission as evidence. However, they are continued to be used by law enforcement, needlessly ruining thousands of lives.\n\nThis time, however, the test kits showed that the substance tested was not drugs. Yes, you read that correctly. The cheap faulty kit actually returned a negative result for cocaine, but the cops arrested the innocent brothers anyway and had them locked up without bail.\n\nThe brothers would spend over a month in jail before lab tests for cocaine came back negative. All the charges were then dropped, but their lives and business had been ruined by their absence. When the brothers finally went back to their store, they found that cops had left behind the field test kits — which all showed negative results. That wasn’t the only thing cops left behind either. As NBC New York reports:\n\nAttorney Marvyn Kornberg, a criminal attorney who represents the brothers, said, “It’s a unit gone wild, that’s what it says to me. They think they’re above the law. They’re ripping out cameras. What are they afraid of the public seeing?”\n\nNaturally, the NYPD, who claims this incident is “under investigation,” said they destroyed the cameras for “tactical” reasons.\n\n“That’s ridiculous,” said Richard Rivera, a former police officer in West New York, New Jersey, who is now a police tactics expert, according to NBC 4.\n\n“They could have covered the cameras. The way they come in doesn’t indicate that any of them is concerned about a remote feed. They’re not worried about security. It’s like a walk in the park to them,” he said, noting that there is no legitimate reason to destroy evidence in that manner.\n\n“This whole incident is a huge mess for them,” he said. “If this is an ongoing drug case, they would want to preserve the evidence, not destroy it, and that’s exactly what they did.”\n\nWhen asked why they would recommend no bail for the brothers, the DA’s officer pointed the finger back at the NYPD, saying they relied on their word that the claims were true. Unfortunately for the brothers, this blind trust in badged criminals would land them in a cage for over a month.\n\nTo date, the brothers still have no idea why these criminals from the NYPD showed up at their store that day. As part of their lawsuit against the city, they have demanded prosecutors turn over the underlying basis for the search warrant. They have also filed a notice of claim to sue the city and the taxpayers will undoubtedly be held liable for these criminal cops.\n\nMatt Agorist is an honorably discharged veteran of the USMC and former intelligence operator directly tasked by the NSA. This prior experience gives him unique insight into the world of government corruption and the American police state. Agorist has been an independent journalist for over a decade and has been featured on mainstream networks around the world. Agorist is also the Editor at Large at the Free Thought Project. Follow @MattAgorist on Twitter, Steemit, and now on Minds.\n\nSubscribe to Activist Post for truth, peace, and freedom news. Become an Activist Post Patron for as little as $1 per month at Patreon. Follow us on SoMee, Flote, Minds, Twitter, and Steemit.\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.",
    "author": "Activist Post",
    "url": "https://www.activistpost.com/2019/12/watch-as-cops-frame-innocent-brothers-for-cocaine-try-to-destroy-video-but-it-survived.html",
    "published": "Fri, 20 Dec 2019 16:14:49 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}