{
    "data_id": "634536",
    "id": "thedailymirror--2019-06-19--Woman falsely accused innocent cabbie of rape after she lost phone on night out",
    "date": "6/19/2019",
    "source": "thedailymirror",
    "title": "Woman 'falsely accused innocent cabbie of rape after she lost phone on night out'",
    "content": "A young woman falsely accused an innocent taxi driver of rape after she lost her mobile phone and became separated from her friends during a drunken night out, a court heard today.\n\nLaura Hood, 27, wrongly told police the driver had stopped his cab at the side of the road and sexually assaulted her in the back seat whilst he was giving her a lift home at the end of the evening, it was said.\n\nDetectives investigated Hood's claims during which they arrested Haroon Yousaf and also the driver of a different taxi with a similar number plate.\n\nMr Yousaf, 29, who was detained in front of colleagues at a cab rank spent a total 20 hours in custody and had to give intimate samples before he was released without charge and exonerated of any wrongdoing.\n\nIt was claimed police suspected he had been falsely accused when he gave details of a tracking device linked to the black cab which showed the vehicle had been driven straight to Hood's home in Stockport, Greater Manchester without stopping.\n\nThere was also no evidence of physical contact between them.\n\nThe other suspect was also cleared of any wrongdoing and Hood was subsequently charged with faking her account.\n\nDetails emerged at Minshull Street Crown Court, Manchester, as she denied perverting the course of justice.\n\n\"If it were not for that tracker data Mr Yousaf may have found himself on trial for rape because the defendant made up a story about him,\" said Geoff Whelan prosecuting.\n\n\"Perhaps only the defendant knows why she would fabricate such an allegation, but make it up she did. A false allegation is a very serious matter.\n\n\"She accepts that she was in Mr Yousaf's taxi and she accepts that he drove her home. She further accepts that Mr Yousaf did not rape her - but says, somehow that she honestly believed she was raped whilst in that taxi.\"\n\nThe incident occurred on January 7 2017 after Hood, from Stockport had been out with friends at Revolution bar at the Deansgate Locks complex in Manchester city centre.\n\nMr Yousaf had just dropped off a fare when Hood got into his vehicle at 1.10am and asked to be taken home.\n\nMr Whelan added: \"She appeared to be drunk as she did so and said she just wanted to go home as she had lost her friends and her mobile phone. She said she had £20 and asked how much it was going to be.\n\nMr Yousaf gave her an estimate of about £25 and she asked to be taken to a bank.\n\n\"Mr Yousaf drove her to a Tesco Express where CCTV footage showed the taxi stopping there at 1.22am with the defendant getting out to use the cash machine.\n\n\"By 1.23am the taxi was driving off again and Mr Yousaf followed the directions on his satnav and took her straight home and reached the destination.\n\n\"The fare was around £26, and the defendant gave him £30 and said \"keep the change\" and paid the money through the slot in the middle of all black cab taxis.\n\n\"Mr Yousaf then thanked her then turned around and drove back to town. That 26 minute journey was in all respects entirely unremarkable.\n\n\"But at 1.40 when the defendant got home, it seems she was quite noisy and her mother asking if she was ok. The defendant then went upstairs to her mother and stepfather's bedroom where she was sobbing uncontrollably as she came into the room.\n\n\"Her mother asked her what was wrong and she had lost her phone. She was crying, shaking and unable to breathe and then said that she had been raped.\n\n\"Her stepfather phoned the police and the defendant said she had lost her phone in Revolution and had started to panic and asked a taxi driver take her to Stockport.\n\n\"She said that they were going down the road and thought it was strange because he turned left when they live on the right.\n\n\"She said that he stopped and the driver got in the back of the cab, grabbed her and pulled her knickers down.\n\n\"Her mother asked her why she didn't fight back and the defendant said that she was scared and that she thought that it would get worse if she tried to fight back.\n\n\"She said that he dropped her off at the end of the road and that he wouldn't drop her off outside the house. The defendant was hysterical as she was speaking to her mother.\"\n\nDuring her account, Hood claimed her assailant was an Asian male, aged about 58 with a thin face, no beard and no facial hair and claimed she was attacked about five minutes after stopping at the cash point.\n\nShe said that she was convinced the taxi driver was wearing a condom and said he charged her £30 for the fare.\n\nA specially trained officer attended the family home where Hood was found to be \"extremely distraught\" and hiding under her bedding, the court heard.\n\nShe was said to be \"crying loudly and was reluctant to engage.\"\n\nIn a statement to police Hood said: \"I was out with my friends in Manchester, I lost my phone, I saw people getting out of a taxi I went over to it asked how much to Stockport.\n\n\"He indicated left and I knew he was going the wrong way. He pulled up, got in the back of the taxi and I was scared - he put on a condom and pulled my knickers down to my knees kissing me all over. His hands were all over me - he then tried to have sex with me it was hurting.\n\nI didn't say anything, I was so scared, I couldn't fight him off, I just wanted it to end.\n\n\"When he finished he just got off me and drove me back to the top of my road. He was pulling me towards him as he was having sex with me.\"\n\nPolice tracked down Mr Yousaf and arrested him at a cab rank at Piccadilly railway station after checking the CCTV at the Tesco Express cashpoint.\n\nMr Whelan added: \"He was interviewed and was able to give a full account of his actions. He said he didn't take any detours, he didn't stop off on any side streets and he dropped her where she asked him to on her road. He denied any sexual contact with the defendant.\n\n\"He then disclosed something that would turn out to be both very important in the course of the investigation and extremely fortunate for Mr Yousaf. His taxi was fitted with a tracker device that very precisely records the movements of the vehicle.\n\n\"The investigating officer spoke to the Tracker company which holds all the data for the tracker and they confirmed that the data cannot be changed by the user, and they provided the same data.\n\n\"They were able to add that if the taxi had turned off at any 90 degree angle it would have recorded it on the tracker.\"\n\n\"Mr Yousaf was released from custody at 5:32pm on 09/01/17 having spent nearly 20 hours in detention. His taxi had been forensically recovered, he was given bail to return two days later and was given a condition not to drive any taxi.\n\n\"Intimate samples were also taken from him and he suffered the indignity of being arrested in a public place in front of his colleagues. Fortunately the tracker data meant the police took no further action against Mr Yousaf.\"\n\nDetectives subsequently tried to interview Hood but at home she initially stayed in her bedroom and did not come downstairs. When she eventually agreed to speak to officers there was said to be 'little or no eye contact' and she appeared 'withdrawn.'\n\nWhen confronted with the evidence of the tracker and the fact Mr Yousaf did not match the description of the suspect, she maintained she had been raped.\n\nHowever, she accepts she wasn't raped by Yousaf.",
    "author": "mirrornews@mirror.co.uk (Neil Murphy)",
    "url": "https://www.mirror.co.uk/news/uk-news/woman-falsely-accused-innocent-cabbie-16543817",
    "published": "2019-06-19 21:01:36+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}