{
    "data_id": "63504",
    "id": "birminghammail--2019-06-24--Watch as killer gunman hands himself in after accidentally blasting best friend in the head",
    "date": "6/24/2019",
    "source": "birminghammail",
    "title": "Watch as killer gunman hands himself in after 'accidentally' blasting best friend in the head",
    "content": "This is the moment a killer handed himself into police after 'accidentally' shooting his best friend dead.\n\nJordan Bassett can be seen surrendering himself to officers at a station after he blasted his pal at a flat in Chepstow Close, Willenhall, Coventry.\n\nThe 25-year-old was caught in the above bodycam footage as police came out to arrest him.\n\nJust days before, on December 7 last year, Bassett had been 'messing around' with a gun and shot Addison Packeer in the head.\n\nA witness described told the pair were talking about drugs before Bassett told the 27-year-old victim he had only paid him £200 of a £2,000 debt.\n\nHe heard a ‘pop’ and walked into the room to find Bassett with his arms around the Addison pleading: “Addi, addi, what’s happening? What did I do, what did I do?\"\n\nPolice to spend £7 million on tackling knife crime and youth violence\n\nBassett threatened to kill that witness if he called police before he could flee the scene.\n\nArmed police raced to the property to find the 27-year-old lying in a pool of blood on a settee in the living room.\n\nHe was pronounced dead at the scene, and Bassett was quickly identified as the killer.\n\nPolice launched a hunt for him, but before they could trace him, he handed himself in Little Park Street police station in the early hours of December 10.\n\nHe pressed the intercom button at the station and told officers he wanted to confess, but that it had been an accident.\n\nAccording to Bassett, the 9mm Luger pistol had belonged to the victim, who had claimed that it was not loaded.\n\nBassett, of Tintagel Close, Willenhall, had been playing about with the deadly weapon when it fired.\n\nPanicking, he tried to stem the flow of blood before riding his motorbike to a quarry in Willenhall to throw the gun and magazine into the water.\n\nAs he confessed to his crime, he told officers exactly where he had tossed the gun.\n\nWithin hours of the arrest, officers uncovered the firearm and a magazine containing a bullet.\n\nBassett admitted manslaughter, and today (June 24) at Warwickshire Justice Centre, he was found not guilty of murder.\n\nHe was found guilty of possession of a firearm with intent to endanger life.\n\nHe will be sentenced on Wednesday, June 26.\n\nDet Insp Caroline Corfield, who led the investigation, said: “We might never know exactly what happened in the flat, but the reality is that anyone who gets involved with firearms is putting themselves and others in serious danger.\n\n\"There is only one purpose to an illegally held, loaded handgun and that is to shoot someone.\n\n“Sometimes the person shot is not the intended target.\n\n\"Here we have a man who has shot dead his best friend. Two families will have to live with the consequences of that for the rest of their lives. Our thoughts remain with family of Addison Packeer.\"",
    "author": "newsdesk@birminghamlive.co.uk (Stephanie Balloo)",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/watch-killer-gunman-hands-himself-16479812",
    "published": "2019-06-24 18:21:15+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}