{
    "data_id": "635548",
    "id": "thedailymirror--2019-06-30--Evidence which proves labourer hanged for murder 81 years ago was innocent",
    "date": "6/30/2019",
    "source": "thedailymirror",
    "title": "Evidence which 'proves' labourer hanged for murder 81 years ago was innocent",
    "content": "It was 54 years ago that the death penalty was abolished in Britain, after public opinion turned against the ultimate form of punishment, fearing that innocent people were being sent to the gallows.\n\nAmong the cases which swung feelings was that of Derek Bentley, who was hanged for the murder of a policeman - but won a posthumous pardon in 1998, 45 years after he was hanged in 1953.\n\nBut there could now be another case to be added to the list of Brits who were executed for crimes they didn't commit.\n\nOn May 26, 1938, Robert Hoolhouse was hanged on the scaffold in Durham after being found guilty of the rape and murder of a farmer’s wife.\n\nThe labourer, who had just turned 21, died protesting his innocence right up until his last breath.\n\nNow, however, historians who have reexamined his case have concluded that Robert’s conviction was just as dubious as others who faced the hangman’s noose and were later declared innocent.\n\nAnd many now believe his death was yet another miscarriage of justice which proves that the death penalty should never be allowed to return in the UK.\n\nIt was on January 18, 1938 that the village of Wolviston, Stockton-on-Tees, was shocked by the discovery of the body of Margaret Dobson, on a cart track leading to her home at High Grange Farm.\n\nThe 67-year-old wife of farmer Henry had been raped and then “severely battered” before being stabbed twice - once in the chest and once in the neck.\n\nThe murder gripped the community, with women so scared of the vicious murdered they would not leave their homes alone and children were kept indoors.\n\nMr Dobson had last seen her wife and mother of their three children earlier that day when they had shared a tea of beef sandwiches at around 3pm.\n\nShe then left the house to visit her sister in Hartlepool, walking along the cart track through field to the main road to catch her bus.\n\nShe was known to wear old boots on the muddy track and then change into a smarter pair of shoes before boarding.\n\nBut on this day Mrs Dobson never made it to the main road.\n\nWhen she hadn’t returned that evening, Mr Dobson waited at the bus stop until the final bus had passed by at 11pm, then walked home and had a sleepless night.\n\nThe next morning he found his wife’s body dumped in one of his fields.\n\nThe North Eastern Gazette reported: \"In the morning the animals had to be fed and work had to be done,\" reported the North Eastern Gazette.\n\n\"He started his work at about 5am. Somewhere between 7am and 8am men arrived to thrash his corn.\n\n\"At about 10am, after completing his work, he set out to make inquiries.\n\n\"He took a short cut to Wolviston through some fields. Something prompted him to look back.\n\n\"He saw something on the ground he could not understand and found the body of his wife lying on her back with head towards the farm and her feet toward the main road.\"\n\nAn autopsy found that the mum-of-three died within an hour and a half of eating her tea.\n\nAs police swarmed into Wolviston and the brutal murder made newspaper front pages, Durham County Constabulary released a statement saying they wanted to speak to a man aged around 30 with the appearance of a farm worker and had been seen on a bike in the area.\n\nThe next day 20-year-old Robert William Hoolhouse was arrested and charged with Mrs Dobson’s murder.\n\nThe police had based their belief that he was the murderer on an incident that had happened three years earlier, when the Hoolhouse family had been working on the Dobsons’ farm and lived in a cottage on the land.\n\nBut following an argument Mr Dobson sacked them and thew them off the land, warning them never to return.\n\nAt the time of his arrest, police also noted marks on Robert’s face which he blamed on “a spill he had with his bicycle”, while he blamed blood on the cuffs of his shirt on a shaving cut.\n\nHis trial later heard that the scratches could have be caused as Mrs Dobson tried to defend herself.\n\nPolice also claimed the timings of Robert’s alibis on the day the farmer’s wife died didn’t tally with the statements given by people he said he had been with.\n\nHowever, other evidence and the statements of other witnesses which later emerged throw more than a little doubt on his guilt.\n\nOne, Margaret Barker, said she had travelled on the same bus as Robert had taken to go to the pictures at 6pm on January 18, which would have been after Mrs Dobson had been murdered.\n\nBut she said she hadn’t noticed any scratches to his face.\n\nPerhaps even more importantly, when Margaret had been found she was still wearing heavy wooden gloves.\n\nThe police had experimented with these gloves, trying to cause similar scratches on a volunteer's face. A secretary with long nails was unable to inflict the slightest wound.\n\nThe other witness was Doris Teale, who lived next to the Hoolhouses, and said she had seen Robert standing outside his house at the time he was supposed to be murdering Mrs Dobson.\n\nEven more conclusive was the footprint evidence. Henry Dobson had stepped around the body and his prints were clearly seen.\n\nOther prints, presumably from the killer, were underneath Henry's. Plaster casts of those prints had been made, but they did not match any of Robert’s footwear.\n\nAnd the description of a man seen at the farm at around 5pm on the night of the murder was also at odds with the young labourer’s appearance and the clothes he had been wearing that day.\n\nFinally, there was the fact that no semen stains were found on Robert’s clothing, despite extensive stains being found on Margaret’s.\n\nDespite the cast contradictory evidence, though, police were convinced they had the right man.\n\nAt his trial at Leeds Assizes Court, prosecutor Mr Paley-Scott KC described the brutality of the crime.\n\nHe said: \"You will hear that whoever it was who had attacked her had battered with his fists into insensibility or, at any rate, into a state in which she, a woman 67 years of age, was no longer able to resist and had then ravished her and, one would suppose, had then decided to kill the only witness of his deed.\"\n\nRobert was found guilty by a jury after four hours and sentenced to death.\n\nFollowing the conviction an appeal was launched back with a petition of 14,000 signatures, but the last-ditch attempt to save him was rejected.\n\nProtesting his innocent to the end, Robert was hanged at Durham by famous executioner Thomas Pierrepoint.\n\nYears later, his father reportedly made a deathbed confession that it was he who was responsible for Mrs Dobson’s murder.\n\nBut he was not seen around the murder scene and it was thought he was making an attempt to posthumously clear his son.",
    "author": "mirrornews@mirror.co.uk (Matt Roper)",
    "url": "https://www.mirror.co.uk/news/uk-news/evidence-proves-labourer-hanged-murder-16461838",
    "published": "2019-06-30 09:00:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}