{
    "data_id": "637871",
    "id": "thedailymirror--2019-08-30--Woman who spent 35 years in prison for murders she didnt commit awarded 25m",
    "date": "8/30/2019",
    "source": "thedailymirror",
    "title": "Woman who spent 35 years in prison for murders she didn't commit awarded £2.5m",
    "content": "A woman who spent 35 years in prison for two murders she didn't commit has been awarded $3million in damages.\n\nCathy Woods, 68, claims detectives coerced her into admitting she killed a student in 1976.\n\nDNA at the scene of the murder proved she was not the killer, and another man has since been convicted.\n\nShe was in a mental health hospital in Louisiana when the fabricated confession happened, her lawyer said.\n\nRodney Halbower was convicted of the two killings in the Bay Area, and Woods was released from prison in 2015.\n\nShe is the longest-ever wrongly imprisoned woman in US history, the National Registry of Exonerations says.\n\nLawyer Elizabeth Wang said Woods was \"extremely psychotic\" and should not have been questioned about the murder of student Michelle Mitchell.\n\nShe was also wrongly found guilty of killing Paula Baxter, 17.\n\nThis week the Washoe County Commission voted to award $3million in compensation to settle a portion of a lawsuit brought by Woods.\n\nA further claim is still ongoing.\n\nAccording to the Daily Mail , Ms Wang stated: \"Although no amount of money will compensate Ms. Woods for what she endured, this will go at least some way toward providing care for her.\"\n\nWoods' conviction has long been controversial. She was found guilty in 1980, but this was overturned by the Nevada Supreme Court.\n\nHowever she was re-convicted in 1984, and in 1988 this was upheld.\n\nIt wasn't until 2014 that Halbower's guilt was confirmed thanks to DNA evidence.\n\nAuthorities believe he raped and killed four women and girls, but has only been convicted of two.\n\nIn a statement the county said: \"The conviction and subsequent incarceration of Woods for murder is a tragic situation that Washoe County hopes is never repeated.\n\n\"While money can rarely compensate an individual for loss of freedom, Washoe County sincerely hopes that this monetary settlement will be utilized for the best possible care of Woods.\"",
    "author": "mirrornews@mirror.co.uk (Dave Burke)",
    "url": "https://www.mirror.co.uk/news/us-news/woman-who-spent-35-years-19101686",
    "published": "2019-08-30 17:02:47+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}