{
    "data_id": "63998",
    "id": "birminghammail--2019-06-30--Mums daily torment as daughters killer walks the streets",
    "date": "6/30/2019",
    "source": "birminghammail",
    "title": "Mum's daily torment as daughter's killer walks the streets",
    "content": "The mother of a woman brutally murdered by her partner says she can’t get her daughter’s killer out of her head.\n\nTina Moore was just 30 years old when she was strangled by her then partner Toby Norris.\n\nBut her killer is now a free man after being released from prison.\n\nAnd her mum Sonia says she thinks about evil Norris every single day, six months since he was let out.\n\nTina was found dead in a downstairs bedroom in her Uttoxeter home by her father, Kenneth, on October 4, 2003.\n\nIt was later revealed that the mother-of-two had been strangled by Norris following a night out.\n\nThe then 23-year-old was handed a life sentence in 2004 and served 12 years behind bars for the crime.\n\nSonia had campaigned for years against Norris’ release – but says that now he is free to walk the streets, she finds herself thinking about him all the time.\n\n“He’s currently in a hostel down south but they won’t tell me any more than that,” she says.\n\n“We’ve not had any problems with him, and I don’t think we will. It sounds like he has been behaving himself .\n\n“But, of course, he’s going to be behaving himself – he wants to get out of the hostel.\n\n“I hope he will continue to behave and that he has changed, but I have my doubts about him, and wonder whether he would come back around here.\n\n“I honestly don’t know if he would. He is certainly hard-faced enough to, but he knows if he does he’ll go straight back to prison.”\n\nNorris, from Chipping Norton in Oxfordshire, met Tina while he was working in Uttoxeter for a company that erected marquees for events.\n\nOn the evening before Tina’s death, the couple had been seen arguing. The row was over Norris meeting with a woman he had been seeing before he met Tina.\n\nDuring a five-day trial at Stafford Crown Court, it was said the couple seemed to have smoothed it over and were later seen enjoying themselves at the former 9B bar, in High Street, Uttoxeter, before returning home.\n\nWhen at home, however, the argument started again and Norris pushed Tina onto the bed, holding her by the neck until she died. He said he did not mean to kill her, but merely to “shut her up” during the argument.\n\nWhen police arrived at the scene, Norris was nowhere to be found. He had fled to Belgium to escape capture but finally faced justice in 2004, when he was jailed for life .\n\nSonia and Kenneth have since raised their late daughter’s children, Tyler and Ben, but say they have never been able to move on.\n\nShe says she thinks about Norris every day, worrying where he could be, or if he may return to Uttoxeter.\n\nThe conditions of the killer’s release state that he cannot travel anywhere near Tina’s family.\n\nIf he visits Uttoxeter, Burton, Stafford, Derby or Stoke, he could be sent back to prison.\n\nAnd Sonia admits part of her wants him to return to the area – purely so he will be put back behind bars.\n\n“I am certainly going to keep tabs on him,” she says. “One of the family liaison officers told me that if I ever see him, I should take a photo of him.\n\n“Now, I carry my phone on me at all times. I won’t go out of the house without it. I wouldn’t do that if it wasn’t for him.\n\n“I never trusted him, and I don’t know if he will come back.”\n\nA Parole Board spokesman said : “We can confirm that a panel of the Parole Board directed the release of Toby ­Norris following a hearing in October 2018.\n\n“Parole Board decisions are solely focused on whether a prisoner would represent a significant risk to the public after release. The panel will have looked at a whole range of evidence, including details of the original evidence and any evidence of behaviour change. We do that with great care and public safety is our top priority.”",
    "author": "newsdesk@birminghamlive.co.uk (Beth Pridding)",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/torment-daughters-killer-walks-streets-16503121",
    "published": "2019-06-30 09:20:24+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}