{
    "data_id": "64720",
    "id": "birminghammail--2019-07-19--Dad-of-two Tank shot to death in broad daylight - before killer went to pub",
    "date": "7/19/2019",
    "source": "birminghammail",
    "title": "Dad-of-two 'Tank' shot to death in broad daylight - before killer went to pub",
    "content": "A dad nicknamed 'Tank' was gunned down in a hail of bullets - before his killer went to the pub.\n\nDepraved Wade Cox has been jailed after shooting a dad-of-two dead in broad daylight.\n\nThe 29-year-old, from the North West, was found guilty of the senseless killing of Luke Graham.\n\nGraham - known as 'Tank' - was gunned down in a hail of bullets in Ashton-under-Lyne.\n\nThe shooting, Manchester Crown Court heard, came as children played nearby last summer.\n\nAfter murdering Mr Graham, Cox spent the night in his local pub.\n\nPolice say he acted 'as though nothing had happened'.\n\nFour other men have been jailed in relation to the brutal murder, reports the Manchester Evening News.\n\nA sentencing hearing heard that Cox lured Mr Graham and another man to a house in Ashton before shooting at them.\n\nMr Graham suffered a fatal gunshot wound to his shoulder but the other man survived, after being shot to the leg as he ran away.\n\nHe went to hospital, but discharged himself later.\n\nCox, who was wearing a balaclava and gloves, fired a total of five shots.\n\nThe court heard that Cox, as well as Mr Graham and the other man who arrived on Birch Street in a Volkswagen Caddy were all involved in drug dealing.\n\nCox claimed that Mr Graham had been dealing on his patch.\n\nHe hatched a plan to trick the man who was with Mr Graham into heading to the house on Birch Street, where Cox would lay in wait for his victim to arrive.\n\nProsecutors said it was more likely that the man with Mr Graham was the target of Cox's scheme.\n\nCox ordered addicts who lived in the house to call the man, and pretend they wanted him to come round to sell them some drugs.\n\nWhen he arrived with Mr Graham, Cox burst out of the house and began shooting at them on June 13 last year, at about 4.50pm.\n\nSentencing, Mrs Justice Cutts said: \"This must have been a terrifying event. Gang violence had broken out in a place where young families lived.\n\n\"Mothers told of their fears for their children who were playing innocently in the street.\"\n\nThe other man was shot to the leg, but was able to flee. Cox fired two more shots in his direction but missed.\n\nHe returned to Mr Graham, who lay on the floor dying, shooting at him again, but missed.\n\nCox fled to a house in Openshaw before being picked up by Jack West.\n\nBenjamin Dodd was then told by Conor Cornforth to destroy the Audi.\n\nDodd set fire to the Audi later on a street near houses, managing to set himself on fire in the process.\n\nHe lied about how he suffered burn injuries to his hands and face when he went to hospital.\n\nCox was arrested in the early hours of the following day.\n\nA jury at Manchester Crown Court spent two weeks considering their verdicts before finding Cox, of Rainow Avenue, Droylsden, guilty of murder and wounding with intent.\n\nAnother man, Jordan Atkinson, 26, of Stamford Drive, Stalybridge, was found guilty of encouraging or assisting an indictable offence and was jailed for eight years.\n\nWest, 29, of Parrenthorn Road, Prestwich; Cornforth, 27, of Calder House, Old Mill Wharf, Droylsden; and Dodd, 28, of Easton Road, Droylsden, were found guilty of assisting an offender.\n\nWest was jailed for 42 months, Cornforth received 37 months; and Dodd for 30 months.\n\nIn a victim impact statement read in court, Mr Graham's father Peter Graham said: \"Luke and his murder will be a part of my life forever. I was left numb and I will miss him.\"\n\nJust before he was murdered, Mr Graham passed his driving test, and his father said he felt that could have been a turning point for his son.\n\nAt the time of his death, Mr Graham said: \"Luke was a loving son, dad and brother, who was always there for his family and friends.\n\n\"He was the type of person who would go out of his way to help others and now we are broken as a family.\n\n\"We can’t believe that he’s gone and that he has been taken from us in such a horrific and cowardly act of violence.\n\n\"Losing Luke has devastated me as a father, and I wouldn’t want any other parent or family to go through the hell that I am living in at the moment.\n\n\"I would just like to thank the police for their tireless efforts in trying to piece together what has happened and would especially like to thank the community at Birch Street in Ashton where Luke passed away.\n\n\"People there risked their own safety and tried their best to save Luke when he was killed that evening.\n\n\"It is a great comfort to me as a dad that he did not pass away alone and that there were people there for him.\"\n\nAfter the hearing, Detective Chief Inspector Liz Hopkinson, of GMP’s Major Incident Team, said: \"This was a painstaking investigation to root out those involved in the brutal murder of Luke Graham and I would like to thank my team who have been dedicated to bringing those responsible to justice for over a year.\n\n\"After their despicable actions, Cox and West even dared to venture to their local pub in Droylsden later that evening as though nothing had happened, proving their callousness knew no bounds.\n\n\"As the Judge sentenced them today, she stated that they were part of an organised crime group who were selling Class A drugs and they were doing this to vulnerable people in the community on a daily basis, which is why I am glad we have removed them from our streets for some time.\n\n\"These men have ripped Luke from his family and friends in the cruellest way imaginable and I hope they can take some comfort from today’s result.\n\n\"A collective 53 years behind bars where there is no doubt in my mind that each and every one of them deserves to be.\"",
    "author": "newsdesk@birminghamlive.co.uk (Andrew Bardsley, James Rodger)",
    "url": "https://www.birminghammail.co.uk/news/uk-news/dad-two-tank-shot-death-16616989",
    "published": "2019-07-19 16:57:45+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}