{
    "data_id": "64811",
    "id": "birminghammail--2019-07-21--How Birmingham public schoolboy turned into evil rapist and killer - and his links to Suzy Lamplugh",
    "date": "7/21/2019",
    "source": "birminghammail",
    "title": "How Birmingham public schoolboy turned into evil rapist and killer - and his links to Suzy Lamplugh",
    "content": "He was the Sutton Coldfield schoolboy who appeared to have the world at his feet.\n\nJohn Cannan was brought up in a respectable middle-class family who sent him to private school for the best possible start in life.\n\nBut the smooth-talking son of an engineer had demons - dark demons - which first surfaced when he was just 14.\n\nIt was in 1968 that the then teenager first attacked a woman, indecently assaulting her in a telephone box in Erdington.\n\nThe young offender was placed on probation but went on to join the Merchant Navy aged 17 before later leaving and becoming a car salesmen.\n\nYet that facade of respectability was destroyed when the charming but shirt-tempered Cannan embarked on a depraved crimewave through the early 1980s - which ended with rape, kidnapping and murder.\n\nIn 1981, he robbed a petrol station and a clothes shop at knifepoint and brutally raped a store assistant after threatening to stab her baby.\n\nThe former public schoolboy was jailed for eight years.\n\nHe was on day release from Wormwood Scrubs in London in 1986 when estate agent Suzy Lamplugh went missing.\n\nIn her work diary, the 27-year-old had written she was due to meet a mysterious Mr Kipper at a house - but she was never seen again.\n\nAn artist impression of Mr Kipper bore an uncanny resemblance to Cannan, who has always denied any involvement in her disappearance.\n\nIt was claimed that his nickname in prison was \"Kipper\".\n\nCannan was questioned by police regarding the disappearance of Suzy in 1989 and 1990 after he was jailed for life for the abduction and murder of newlywed Shirley Banks.\n\nThe 30-year-old had been on an evening shopping trip to Bristol when she vanished. Her naked body was later found at Dead Women's Ditch in the Quantock Hills in 1987.\n\nThere were rumours Cannan may have briefly dated Suzy and killed her when she tried to end the relationship.\n\nStatements from her family and friends and his former lovers and fellow inmates  suggested the pair may have had a fling in the months before she vanished.\n\nCops believe Suzy may have been planning to tell him it was over when she vanished.\n\nThe much-loved daughter of Diana and Paul Lamplugh was officially declared dead in 1994.\n\nIn December 2000, Cannan was arrested again for her murder and questioned, but was not charged.\n\nTwo years later detectives said publicly that they believe he killed Suzy and confirmed this in 2006 when arguing against any reduction in his tariff.\n\nCannan subsequently complained via his solicitors about the police publicly naming him, saying he was \"devastated and distressed\".\n\nYet what is not in doubt is that Cannan is a cold-blooded killer, who targeted professional women.\n\nHe was given three life sentences with a recommendation never to be released for the murder of Shirley Banks, the attempted kidnapping of another woman on the previous night and the rape of a third woman in Reading in 1986.\n\nAnd the evidence of his involvement in the disappearance of Suzy Lamplugh has grown over the years.\n\nA former girlfriend Gilly Paige told police that he had once suggested the estate agent's body was buried at Norton Barracks, a former army barracks in Worcestershire, as they drove past.\n\nYet Cannan later wrote a letter to the local paper Sutton News denying the claims.\n\n“May I please assure you, that whilst it is perfectly true that I did give ice-skater Gilly Paige a lift from Bristol to Birmingham, where both our families live, I did NOT at any time say that I had raped and killed Miss Lamplugh,” he said.\n\nOne of his fellow prisoners also told police that Cannan had buried the body of Suzy under the patio of his mother's former house in Sutton Coldfield.\n\nA search of that property last year revealed nothing.\n\nHuman remains were discovered in a Worcestershire village last Friday - eight miles from where police had begun another search for missing Suzy.\n\nWest Mercia Police said they received reports of bones being found in the village of Kempsey.\n\nWeeks earlier detectives had been searching for evidence of missing Suzy in Pershore - some eight miles away.\n\nWest Mercia Police later said the remains could be linked to the disappearance of a woman in 1982.\n\n“This discovery is currently being treated as an unexplained death and we will be following many lines of enquiry,” the force said.\n\n“Included within this is to establish if this is connected to the disappearance of a woman from the village of Kempsey in the 1980s.”\n\nIn a statement, the force added: “We are aware there is some speculation that this discovery may be linked to the disappearance of Suzy Lamplugh, who also went missing in the 1980s.\n\n“Although we don’t believe it to be, until we have the post-mortem results we are not in a position to link the bones to any particular person at this stage and are keeping an open mind.”\n\nSupt Damian Pettit, South Worcestershire’s Local Policing Commander said: “This is understandably a concerning discovery for the people living in and around the village of Kempsey. Thankfully, findings of this nature are very rare and I would like to take this opportunity to reassure the community that this is very unusual for the area.\n\n“We are conducting a very thorough investigation and have multiple lines of enquiry to explore and one of which is into the disappearance of a woman from Kempsey that was launched in 1982.\n\n“At this stage we don’t believe the remains to be connected to the Met Police’s missing person investigation for Suzy Lamplugh.\n\n“Until we receive the post-mortem results we are not in a position to clarify any further details. I would like to reassure you that we are moving as fast as we can and will keep you informed with any significant updates.”\n\nMeanwhile on Wednesday police said they had called off the Pershore dig after finding no new evidence.\n\nScotland Yard said in a statement: \"We remain committed to securing justice for Suzy and her family, and officers will continue to assess any new information received in connection with this case.\n\n\n\n\"Anyone that knows anything that could assist the investigation is asked to call officers on 0207 230 4294.\"\n\nAs for Cannan, he is now 65-years-old and is unlikely to ever be freed from prison for the crimes he has proven to have committed.\n\nThe mystery of the disappearance of Suzy Lamplugh continues, a mystery police are determined to one day solve.",
    "author": "newsdesk@birminghamlive.co.uk (Tony Larner)",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/how-birmingham-public-schoolboy-turned-16598686",
    "published": "2019-07-21 04:30:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}