{
    "data_id": "64835",
    "id": "birminghammail--2019-07-21--This week in Midlands courts Teenage killer county lines drugs gang and a police officer - among",
    "date": "7/21/2019",
    "source": "birminghammail",
    "title": "This week in Midlands' courts: Teenage killer, county lines drugs gang and a police officer - among others",
    "content": "A teenager has been sentenced to 19 years in prison for stabbing Mohamed Sidali to death outside Joseph Chamberlain College. Louai Ali, 17, plunged a two pronged knife into Sidali’s chest in front of terrified students outside the gates in Belgrave Road, Highgate, on February 13.\n\nA depraved man - branded a \"sexual predator\" - has been jailed after abusing seven children over two decades. The Midlands man has been locked up after abusing kids over a 20-year period. Derek Stevenson, from Staffordshire, raped one victim on numerous occasions and indecently and sexually assaulted the others.\n\nA county lines gang flooding Warwickshire with drugs from Birmingham has been busted - and its members will serve 68 years in jail. Five men and two women were jailed for more than 44 years on Thursday, July 11.\n\nThree friends who appeared in a YouTube video glamorising drugs and guns have been jailed for a total of nearly 40 years. In the video, which has been viewed by more than 48,900 times, the Birmingham men rap about shootings, cash, drugs and the police.\n\nThis is a round-up of some of the biggest cases dealt with across the region as we name and shame a number of those up in court this week.\n\nSee more BirminghamLive crime stories here\n\nClick on the links below to see the offenders and details of their crimes .\n\nA teenager has been sentenced to 19 years in prison for stabbing Mohamed Sidali to death outside Joseph Chamberlain College. Louai Ali, 17, plunged a two pronged knife into Sidali’s chest in front of terrified students outside the gates in Belgrave Road, Highgate, on February 13. A security guard who tried to intervene and grab the knife was stabbed in the back.\n\nFollowing a trial, the defendant, of Hodnet Grove, Highgate, was found guilty of wounding with intent, unlawful wounding and two charges of having an offensive weapon. This morning, he was jailed for a minimum of 19 years for his crime which have left Mr Mohamed’s family ‘devastated.’\n\nSentencing Judge Mark Wall QC said: “Your actions have left devastation In their wake. “Sidali’s loss has been deeply felt by his family and friends. “His mother has anxiety attacks and his brothers now fear going to school. “His death is described as leaving a huge void in their lives.”\n\nThree men have been jailed after a vigilant CCTV operator saw them with a sawn-off shotgun on a busy shopping street in Birmingham. Armed cops were alerted and raced to Farnborough Road, Castle Vale , and arrested the group who had been handed the weapon from a BMW.\n\nJordan Kibuka, 19, and Darnell Duquesney, 20, had previously admitted possessing a prohibited firearm while Makenzie Blackburn, 20, was found guilty of the same charge.\n\nKibuka, of Hawker Drive, Castle Vale, was sentenced to six years and eight months detention after he had also pleaded guilty to possessing a class A drug with intent to supply. Duquesney, of Alcott Grove, Kitts Green , had also admitted possessing cannabis. He was handed a sentence of five years and one month. Blackburn was sentenced to five years and three months after also being found guilty of two charges of possessing a knife.\n\nA drug dealer is now behind bars - after he came clean to his mum and dad after police busted him.\n\nThe dealer, from the Midlands, was caught by cops as police netted cocaine and cannabis. He has subsequently been jailed for three years - after being caught with more than £1,000.\n\nStoke-on-Trent Crown Court heard how Liam Frimpong had been preparing to bag the loose cannabis at his  Newcastle  home, reports StokeonTrentLive. But police carried out a search warrant and discovered the stash of drugs, along with a trail of text messages.\n\nNow the 33-year-old dad, of Quinton Grove, Milehouse, has pleaded guilty to possession with intent to supply cannabis and possession with intent to supply cocaine.\n\nFor the latest on trials and court cases from across Birmingham and the West Midlands, join BirminghamLive's Court Facebook group .\n\nA dangerous driver crashed his 'pool car' into a taxi carrying four people. The banned motorist, from the Midlands, went the wrong way up a street before crashing into a lorry and taxi.\n\nIt came as he tried to evade the police. Sean Hambleton was being chased by cops when they lost sight of him. He was careering along Lichfield Street, in Hanley, when he was spotted by officers.\n\nThey picked up the Vauxhall Astra again when it was nearing the A500 on the wrong side of the carriageway, reports StokeonTrentLive. Hambleton, of Preston Street, Smallthorne, then crashed into the two other vehicles.\n\nNow he has been jailed at Stoke-on-Trent Crown Court after pleading guilty to dangerous driving, driving while disqualified, and driving without insurance.\n\nA monkey dust addict mum-of-two repeatedly stabbed a man in back during a vicious robbery after tricking her way into his home. And her partner sprayed the victim with lighter fluid, reports StokeonTrentLive , our sister title.\n\nWayne Ferns and Vanessa Malpass subjected a man to a vicious robbery which saw him sprayed with lighter fluid and stabbed several times with a kitchen knife. The pair tricked their way into the victim’s home before attacking him and stealing his property.\n\nStoke-on-Trent Crown Court heard Ferns - who tried to hide his identity by wearing a beanie hat fashioned into a mask - later told police he had gone to the house in Leek to ‘enforce a drugs debt’. The 40-year-old has now been jailed for seven-and-a-half years, while his accomplice Malpass received a four-and-a-half year sentence.\n\nProsecutor Richard McConaghy said the victim heard knocking on his back door on the night of the offence. He looked out to see 32-year-old Malpass and, mistaking her for someone else, went down to let her in.\n\nA Burntwood man has been jailed for defrauding an elderly woman out of thousands of pounds. David Cope, aged 68, was sentenced to a total of 32 months at Stafford Crown Court after he pleaded guilty to fraud by false representation and theft at an earlier hearing.\n\nHe was sentenced to 16 months for fraud, with 16 months for theft to be served concurrently.\n\nIn a separate matter Cope was sentenced to a further 16 months for sexual offences. He pleaded guilty to causing a child to watch or look at an image of sexual activity and two further counts of attempting to cause a child to watch or look at an image of sexual activity. These offences were committed between in 2016.\n\nThe court heard that Cope, of Bells Lane, Boney Hay, had been entrusted with an elderly woman’s bank card to assist with purchasing small items such as sweets when she went into a care home.\n\nA county lines gang flooding Warwickshire with drugs from Birmingham has been busted - and its members will serve 68 years in jail. Five men and two women were jailed for more than 44 years on Thursday, July 11.\n\nThe sentences, handed down at Warwick Crown Court, follow five men being jailed for more than 23 years back in November 2018 for their part in the operation. The jail terms come after an investigation by the Warwickshire Police Serious and Organised Crime Unit (SOCU).\n\nBetween February 2015 and November 2017, detectives identified 429 class A drug deliveries made by the gang into Warwickshire. The drugs had an estimated street value of more than £400,000.\n\nThe venture was headed by Meshach Duncan who recruited a team - including Mateuz Frasunkiewicz, Dajon Donaldson and Kirean Aldred - to ship the drugs into Warwickshire. Rebecca Mannix, Kyle Crossley and Debra Walsh were also recruited to help deal the drugs in the county.\n\nA \"naive\" woman who took almost £3,000 in cash and a mobile phone to Holland to help an on-the-run killer has been jailed for two years. Melisa Birkinshaw pleaded guilty in June to perverting the course of justice by helping Tyrone Andrew after he had stabbed Reagan Asbury in the neck following a boxing match at Walsall Town Hall in 2017. Andrew, of St Helen's Street, Derby, fled to Amsterdam and then Spain but was jailed for 14 years in August last year after being found guilty of manslaughter.\n\nBirkinshaw, formerly of Cavendish Court, Derby, looked at the floor but remained composed in the dock at Birmingham Crown Court on Friday as she was jailed. The 22-year-old admitted doing acts intending to pervert the course of justice between October and December 2017 by permitting her bank account to receive cash intended for Andrew, and giving money and a phone to him in Holland.\n\nThe court heard that Andrew was in phone contact with Birkinshaw while he was still in Walsall, and later met her outside her flat. She flew from Luton Airport to Amsterdam three days after the killing with cash that had been deposited into her building society account by associates of Andrew.\n\nA drug dealer was caught with three air guns, two coshes and a knuckle-duster at his home - and has subsequently been locked up. The dealer was also found with pepper spray at his house in the Midlands. And police also discovered crack and heroin worth a staggering £2,400.\n\nKhalid Jones left two police officers fearing for their safety after grabbing a pistol from a shelf when they called at his home. The female officers had to wait three minutes for armed police back-up to arrive at the scene, Stoke Crown Court heard. Jones, 26, of Minshall Street, Fenton, denied ever intending to threaten them with the weapon, according to StokeonTrentLive , our sister title.\n\nHe was subsequently arrested. Police recovered 12.8 grams of crack cocaine, with a street value of around £1,080, and 13.5 grams of heroin, worth around £1,350.\n\nProsecutor Paul Spratt said they also seized 18 boxes of diazepam, three mobile phones ‘which showed some indication of drug supply’ and a total of £4,000 in cash. Several weapons were found during the search as well, including two coshes, a knuckle-duster, three air weapons and pepper spray. They were items associated with his 'trade' as a dealer, Mr Spratt told the court.\n\nNow Jones has been jailed for three years after admitting two charges of possession of class A drugs with intent to supply, possession of the diazepam and two counts of possession of a prohibited weapon.\n\nA 20-year-old who was left needing more than 40 stitches after being brutally attacked in a pub in the Midlands has spoken out. Jack Robinson, 20, required stitches around his eye being viciously attacked inside a heaving pub in Staffordshire.\n\nThe joiner was on a night out with friends from the Potters Bar football team. Jack had to quit his job and faces more surgery in the next 18 months after being brutally glassed in a pub.\n\nThe Stoke City fan has spoken out after seeing his attacker - 25-year-old Christian Peach - locked up for two years at Stafford Crown Court, reports StokeonTrentLive. Jack, from Meir Park, has welcomed the sentence handed down to Peach, of Hemlock Road, Meir, after he pleaded guilty to a charge of wounding.\n\nHe said: \"There are no winners in this case. \"Both families have suffered and I'm just happy there's been a bit of justice given. \"It wasn't particularly about what he got, it was just that he paid for what he did. \"It's given me a bit of closure because it's affected my family and now we can put this behind us, deal with it and move on.\"\n\nThis is the first picture of illegal immigrant Warsame Mohammed, who was part of a gang who stabbed a dad-of two following a row about a minor prang.\n\nTragic Zakir Nawaz, 21, died after being attacked in Highfield Road, Washwood Heath , in September 2016. His second child had been born just ten days earlier. Mohamed and two associates were in a vehicle that had earlier collided with the victim's hire car.\n\nMr Nawaz, from Stechford, was repeatedly kicked, punched and stamped on before being stabbed in the chest. He was pronounced dead at the scene minutes later while Mohamed, 23, pictured for the first time, and suspected knifeman Abdulahi Shire fled the country.\n\nFugitive Mohamed, who is understood to have gone to Holland, sneaked back into the UK and was arrested after police spotted him walking on the M40 in January. Mohamed, from James Turner Street, Winson Green, tried giving false details but checks revealed he was wanted over the murder and arrested.\n\nHe was due to stand trial for murder but pleaded guilty to manslaughter at a later stage. Mohamed was given a four-and-a-half year jail sentence for manslaughter and two years for violent disorder, to run concurrently at Birmingham Crown Court on Wednesday.\n\nA married police officer who sent sexual messages to vulnerable victims and contacted prostitutes while at work has been jailed for 14 months. Pc Palvinder Singh sent \"hundreds and hundreds\" of flirty messages to four victims, including ones about bondage and threesomes, a court heard.\n\nBirmingham Crown Court was told that Singh sent naked pictures of himself to two women, including a selfie in the shower and one beside his locker at a police station. In a statement summarised by the prosecution to the court, one of the women he had formed a relationship with said he had treated his job \"as a dating agency\".\n\nThe 39-year-old Smethwick-based officer, who has been married for 16 years, invited one of the women to his family home to engage in sexual activity while his wife was away.\n\nJailing Singh, Judge Roderick Henderson told the disgraced officer: \"You have a fine record as a police officer over 14 years and you have thrown it away. \"Over five months you went off the rails and committed these offences. \"We give our police officers great power, not just legal powers, but influence.\"\n\nThree friends who appeared in a YouTube video glamorising drugs and guns have been jailed for a total of nearly 40 years. In the video, which has been viewed by more than 48,900 times, the Birmingham men rap about shootings, cash, drugs and the police .\n\nA West Midlands Regional Organised Crime Unit (ROCU) investigation spanning three years led to their arrest, crown court trial and prison sentences.\n\nRemi Carty first came to police attention in 2016 when he was caught with a loaded pistol in a Birmingham fast food restaurant. After his release from prison, he remained on licence and when detectives conducted a warrant at a property in Redhill Road, Northfield in September 2018, CCTV showed the 20-year-old fleeing the property in his socks as police arrived.\n\nOfficers found a large quantity of class A drugs, a loaded 9mm pistol, a sawn-off shotgun and ammunition in two bags in a shed in the rear garden. Fingerprint analysis also connected Carty’s friend - 21-year-old Shaun Barnhurst - to the find.\n\nDuring the investigation a third man - Kyle Esty - retrieved items from a wheelie bin at Barnhurst’s address and between November and January 2019 the 22-year-old made several street-level drug deals.\n\nA pervert pensioner has been JAILED - after getting a schoolgirl to perform a sex act on him. Phillip Thornton was told in court: \"There was a significant disparity in age.\" The Midland OAP has been locked up for four years.\n\nHe incited the girl - who was aged between nine and 11 - to touch him sexually and perform the act. The abuse was reported years later and the 70-year-old denied the allegations, reports StokeonTrentLive, our sister title.\n\nHe went on trial at Stoke-on-Trent Crown Court charged with indecent assault, indecency with a child and indecency towards a child. He was cleared of indecent assault and the jury could not reach a verdict on the indecency towards a child charge and a not guilty verdict was entered on that matter. But Thornton, of Burnaby Road, Sandyford, was found guilty of indecency with a child and has been jailed for four years.\n\nProsecutor Richard McConaghy said the victim can recall the defendant asking her to rub some powder on his private parts. The victim confided in her boyfriend years later and he called the NSPCC. She reported the matters to police in 2017.\n\nA bungling burglar left his DNA at a garage during a break-in - helping him be rumbled by police.\n\nDim Craig Kirkland broke into the detached garage of a house in the Midlands. His burglary - which was his 25th offence - came while the homeowners were asleep. He stole power tools worth £1,590. Kirkland, 43, has been handed a two-and-a-half year prison sentence. He was traced by Staffordshire Police after forensic scientists discovered his DNA on the garage window.\n\nStoke-on-Trent Crown Court heard Kirkland has 124 previous offences on his record. The latest break-in - on High Lane - happened sometime between 11.30pm on October 21 and 8am the next day.\n\nStokeonTrentLive, our sister title, reports his 30-month prison term will run concurrently to the two-and-a-half year custodial sentence he is currently serving after burgling a property in Fegg Hayes.\n\nA son who battered his mother to death after flying into a rage over her drinking has been jailed.\n\nMatthew Page claimed Mary Page told him to \"finish it\" after he kicked her in the face at the family home in James Street, Bilston, on January 31. He had exploded with rage when he came home to find his mother had barricaded herself in her bedroom - warning him not to come in because she was \"pissed\".\n\nThe 40-year-old forced his way into the room as she had previously tried to commit suicide while under the influence - but when he saw his mother worse for wear, he launched his attack, kicking and punching her before picking up a bedside cabinet and hitting the 68-year-old over the head with it.\n\nPage, who admitted manslaughter on the grounds of diminished responsibility, moved his mother onto her bed when he believed she was dead and began cleaning up the blood. Wolverhampton Crown Court was told Page had also covered his mother with a duvet and wrapped her head in a towel,  which he said he had done to spare his brother the distress.\n\nThree Midland men have been jailed for a total of more than eight years after police spotted a local 'gopher' and busted a County Lines drugs ring in Wales.\n\nTwo men from Dudley and a third from Walsall travelled to Llanelli to take part in an operation to supply cocaine, heroin, synthetic cannabinoids ('spice') and cannabis. But they were caught after police spotted local man Damien Hearne, who was described in court as 'a gopher'.\n\nSwansea Crown Court heard it was a ' County Lines operation ', where a telephone line referred to as Mitch was used to facilitate the sale of the drugs, WalesOnline reported . Ravi Talware, Daniel Higgins and Ben Walker all travelled from the West Midlands to the town in south west Wales to take part in an operation.\n\nTalware, 29, of Quicksand Lane, Walsall, admitted two counts of conspiring to supply class A drugs and two counts of conspiring to supply class B drugs, along with having an offensive weapon. Higgins, 37, of Vauxhall Street in Dudley, admitted two counts of conspiracy to supply class B drugs, and one count of having an offensive weapon. Walker, 21, of Bath Meadow in Cradley, Dudley, admitted one count of conspiring to supply class A drugs. Hearne, 35, of Elizabeth Street in Llanelli, admitted two counts of conspiring to supply class A drugs and one count of conspiring to supply class B drugs.\n\nAn evil slavery gang which forced workers to live in squalid conditions reportedly supplied the nation’s biggest supermarkets with freshly picked groceries. Some of the biggest names in the industry - including Tesco, Asda, Waitrose, Sainsbury and M&S - all bought vegetables from firms that hired vulnerable men and women brought into the UK and controlled by the ruthless gang.\n\nThe huge gang collected around 400 drug addicts and alcoholics in Poland with the promise of good money when they got to England. But they were paid just 50p a day as the majority of their earnings from hard manual labour on farms, in factories and recycling centres were siphoned off, an investigation by the Sunday Times reported.\n\nAll the supermarket chains and other companies involved said they did not know the workers were being exploited. The Sunday Times said several became aware of the mistreatment only when it contacted them. There is no suggestion the firms were actively complicit.\n\nLed by the Polish Brzeninsky family the criminal mastermind gang pocketed a staggering £2million. Now eight members of the Polish Roma gypsy gang have been jailed after two trials at Birmingham Crown Court.\n\nA woman has been jailed after brazenly assaulting a police officer for the SIXTEENTH time.\n\nVictoria Everill is back behind bars in the Midlands - after targeting a cop yet again. The abusive woman, aged 28, was jailed in August, 2018 and again in January. Over the years, she has racked up a catalogue of offences against bobbies since 2008.\n\nNow Everill has been locked up yet again after admitting her third attack on police officers in the past 12 months, reports StokeonTrentLive . Magistrates at North Staffordshire Justice Centre heard police arrested the defendant on the evening of April 29.\n\nProsecutor Emma Lineton said: “Officers noticed she appeared to be under the influence of alcohol. She was unsteady on her feet and her speech was slurred.\n\nA \"trusted\" Birmingham teacher who abused two young girls has been jailed for ten years. One of the youngsters said Iain McDowall robbed her of her innocence and ruined her childhood.\n\nThe 47-year-old, of Willow Avenue, Edgbaston , was found guilty after a trial of two charges of sexual assault on a child under 13 and another serious sexual charge. He was jailed at Birmingham Crown Court and also ordered to register as a sex offender for life.\n\nThe crimes happened between 2008 and 2010 when the defendant was working at a city school. The court heard McDowall was \" utterly trusted by his colleagues .\"\n\nThe abuse of one of the girls only came to light in October 2017 when she revealed what had happened in a letter to her mother. In a statement read to the court, the other girl said she now felt aggression towards men.\n\nA sick robber has been jailed for more than six years after targeting two pensioners - pulling gold earrings from one while she shopped.\n\nLukeny Pedro grabbed an 83-year-old woman from behind in a shop and pulled her gold earrings from her ears, a court heard. Five weeks before, he robbed a pensioner on a bus, grabbing an £1,100 gold chain from round his neck.\n\nPedro, aged 24, of Sydenham Road, Smethwick, pleaded guilty to two charges of robbery and one of fraud at Warwick Crown Court. Judge Peter Cooke jailed him for a total of six years and eight months.\n\nProsecutor Ian Speed said on April 17 a 73-year-old Asian pensioner, who suffers from Parkinson's, was targeted on a bus at Pool Meadow bus station in Coventry. He had his gold chain and pendant pulled from round his neck by Pedro, who ran from the bus with it. Later that day, police were contacted by staff at H&T Pawnbrokers to say that a man had just sold them a chain with a distinctive pendant.\n\nFirefighters were forced to tackle a 'full-on' blaze after an arsonist barricaded himself in a wardrobe.\n\nThe arsonist, high on monkey dust, locked himself away and torched his clothes in staggering scenes. He thought 'people were after him', a court in the Midlands heard.\n\nThe fire caused £4,250 damage - and the defendant's parents paid for the repairs. Adam Shaw barricaded himself inside the wardrobe in the middle of the night and used the flame from a lighter to illuminate it.\n\nNow, StokeonTrentLive reports the 38-year-old has been jailed for 28 months following the blaze at the terrace property on Stanton Road. Stoke-on-Trent Crown Court heard firefighters were faced with a 'full-on fire' after the defendant called 999 at 3.20am on November 17. He had escaped the blaze through a window.\n\nA rapist who had been hunted by police for almost 20 years was finally arrested on board a flight to Pakistan moments before it was due to take off, a court heard.\n\nMohammed Ibrar Aslam, 47, from Sutton Coldfield, had been a wanted man after he attacked a drunk woman in 2001 who had earlier been snatched off the street. Despite extensive inquiries at the time of the shocking attack, he remained at large for nearly two decades, a court heard.\n\nWest Yorkshire Police’s Cold Case Review Team began a new inquiry last year following advances in forensic science. Following a huge and time-consuming investigation, Aslam, aged 29 at the time of the rape, was identified as a potential suspect for a DNA test.\n\nInformation about Aslam had been circulated via police and E-Border systems, a court heard. Police finally got their man on January 8 this year after officers from the West Midlands found him on board an Emirates flight at Birmingham International Airport.\n\nIn February he pleaded guilty to the rape charge after his DNA matched samples taken from the victim 18 years. Aslam, of Birmingham, was jailed for 11 years and three months at Leeds Crown Court.\n\nA monkey dust addict from the Midlands waved a knife at a terrified neighbour before kung fu kicking a bush.\n\nCarlo Vella believed he was being attacked by 'demons and devils'. The man, from Staffordshire, would spend £70-a-week on his habit. The 39-year-old walked towards the retired victim while wielding the blade as she stood outside her Newcastle flat, reports StokeonTrentLive. She and a friend managed to seek refuge in her home and call the police.\n\nOfficers arrived to find the defendant huddled on the floor before seizing the blade and arresting him.\n\nNow Vella, who is a long-term drug user and has mental health issues, has been jailed for 12 months and made the subject of a five-year restraining order which prevents him having any contact with his former neighbour.\n\nProsecutor Antony Longworth told Stoke-on-Trent Crown Court the woman was waiting for a neighbour outside her flat at Stoneyfields Court, Sandy Lane, Newcastle, at 9pm on August 25 when she became aware of the defendant.\n\nA student who branded himself ‘Diablo the MDMA dealer’ has been jailed. The Midlands man has been caged after he was caught by police. Cops found hundreds of pounds worth of ecstasy and cannabis.\n\nThe 22-year-old was caught with a stash of cannabis and some scales in his girlfriend’s room at Keele University. Dawit Tekle fled the complex, reports StokeonTrentLive , our sister title. And the next day university staff intercepted a package addressed to him which contained hundreds of pounds worth of class A drug MDMA (ecstasy).\n\nThe defendant was tracked down at Southampton University a few weeks later when he was in possession of £5,500. His phones were analysed and showed he was involved in the supply of MDMA.\n\nNow Tekle has been jailed for two-and-a-half years at Stoke-on-Trent Crown Court. Prosecutor Paul Spratt said two security officers at Keele University went to the defendant’s girlfriend’s room at 3.30pm on November 23, 2017 after receiving a report someone was smoking cannabis.\n\nA thug attacked and racially abused a 'good Samaritan' in a city centre - moments after being chucked out of a bar. The 28-year-old, from Staffordshire, has been handed a jail term over the dramatic incident in the Midlands.\n\nDrunken Aaron Robinson targeted somebody who had rushed to the aid of a stricken man - before attacking both him and his friend. He has been jailed for 22 months following the altercation in Hanley, which saw police and paramedics called to the scene.\n\nStoke-on-Trent Crown Court heard how the 28-year-old had been ejected from a bar in Trinity Street before the incident on the night of September 18.\n\nA depraved man - branded a \"sexual predator\" - has been jailed after abusing seven children over two decades.\n\nThe Midlands man has been locked up after abusing kids over a 20-year period. Derek Stevenson, from Staffordshire, raped one victim on numerous occasions and indecently and sexually assaulted the others.\n\nStoke-on-Trent Crown Court heard all seven victims were aged between five and 15 and have been deeply affected by his offending. The 65-year-old, of Mendip Place, Knutton, has been handed a 25-year prison term for the offences, reports StokeonTrentLive .",
    "author": "newsdesk@birminghamlive.co.uk ( birminghammail.co.uk)",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/this-week-in-midlands-courts-16600018",
    "published": "2019-07-21 04:30:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}