{
    "data_id": "64952",
    "id": "birminghammail--2019-07-25--Chilling CCTV of teen killer calmly walking to popular park to rape and murder girl",
    "date": "7/25/2019",
    "source": "birminghammail",
    "title": "Chilling CCTV of teen killer calmly walking to popular park to rape and murder girl",
    "content": "This is the chilling moment a youngster calmly walks to a Wolverhampton park to brutally rape and murder a 14-year-old girl.\n\nIn the footage, which was released by West Midlands Police, Ayman Aziz is captured on CCTV travelling towards West Park to violently kill Viktorija Sokolova.\n\nThe warped 17-year-old lured the Lithuanian-born youngster to the park under the pretence they would 'smoke weed and talk' on April 11, 2018.\n\nBut only today are we able to report this, after courts lifted restrictions on revealing the killer's identity .\n\nWolverhampton Crown Court had heard that he intended to have sex with Viktorija and had searched for sexually explicit content online beforehand.\n\nAziz subjected the schoolgirl to horrific levels of violence in a two-hour attack after she refused his advances.\n\nHe was caught on CCTV as he attempted to cover up the offence by hiding bloodied clothing, having deleted Facebook messages and hurled his victim's phone towards a lake. \n\n\n\nDetectives believe he used a hammer, which has never been found, to launch the assault on his victim - who suffered a fractured skull, brain injuries and shattered vertebrae.\n\n\n\n Throughout his trial, Aziz showed no remorse, gave no evidence in his defence and simply nodded as he was ordered by the judge to be taken to the cells. \n\n\n\nAziz could not be identified in reports at the time as reporting restrictions because of his age were imposed.\n\nAlthough the trial judge agreed to lift those restrictions following an application by PA and other media organisations, the teenager's lawyers challenged that decision and the restrictions remained in place pending an appeal.\n\nAdam Kane QC argued the reporting restrictions should not be lifted because they would have an adverse effect on Aziz's rehabilitation.\n\nHe also said the teenager, who has been diagnosed with paranoid schizophrenia, has been \"bullied and threatened\" in detention and has stopped attending educational classes as a result.\n\nBut the Lord Chief Justice Lord Burnett and two other senior judges rejected Aziz's challenge at the Court of Appeal on Thursday, meaning he can now be named.\n\nThe judges also rejected an appeal by Aziz, who watched the hearing over a video link from the young offenders' institution where he is detained, against his minimum term. \n\n\n\nDetective Inspector Caroline Corfield, who worked on the case, described the scene as one of the most shocking and brutal murders officers had ever seen.\n\nShe said: “It’s one of the most shocking murder investigations that I have never worked on.\n\n“She was 14-year-old, she went to the park that night to meet someone she called a friend. But he has murdered her in an explicitly violent attack and then degraded her by dragging her body from the initial site of the attack and leaving her stripped, half-naked, over a park bench to be found by a dog walker the next morning.”",
    "author": "newsdesk@birminghamlive.co.uk (Jordan Coussins)",
    "url": "https://www.birminghammail.co.uk/black-country/chilling-cctv-teen-killer-calmly-15544060",
    "published": "2019-07-25 15:40:19+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}