{
    "data_id": "651144",
    "id": "thedailyrecord--2019-07-30--Innocent Glasgow man ordered to drop boxers and lift testicles as blunder cops raid wrong house",
    "date": "7/30/2019",
    "source": "thedailyrecord",
    "title": "Innocent Glasgow man ordered to 'drop boxers and lift testicles' as blunder cops raid wrong house",
    "content": "A family say police raided their home with a drugs warrant and even ordered their son to strip to his underwear - before they realised they were on the wrong street.\n\nThe Gracey family were all staying at grandfather Joe's home after a party the day before to celebrate his granddaughter Ellie's 11th birthday.\n\nBut they were left baffled when 10 cops barged into the home, looking for people suspected of drug offences , they said.\n\nSon Anthony, 23, was in bed when he claims officers told him to take off his boxers as part of the raid - before the entire family of six were gathered in the living room of their Glasgow home.\n\nJoe, 60, said he told police to check paperwork \"six times\" and it was only when they called his ex wife Jacqueline, 56, by the wrong name, they realised their mistake, he said.\n\nHe said they were at the correct house number - but on the wrong street.\n\nGrandfather-of-one Joe, lodged an official complaint with Police Scotland following the mix up, and the force said it is investigating.\n\nDistraught retail worker, Anthony, said: \"I was fast asleep and they woke me up.\n\n\"They came upstairs and into my room. One of them said 'drop your boxers'.\n\n\"I said 'are you being serious' but they made me do it. I felt guilty but I hadn't done anything wrong.\n\n\"They made me lift up my testicles. I didn't know what to think. I've never done anything wrong in my life.\n\n\"I said I was innocent but they said they'd arrest me if I didn't shut up.\n\n\"It was really embarrassing.\"\n\nPolice officers burst into Joe's home, in Easterhouse, Glasgow, at around 8.15am on July 15.\n\nHis granddaughter Ellie, 11, his sons, Anthony and Andrew, 32, and a friend, were all asleep, having celebrated the schoolgirl and ex-wife Jacqueline's birthday the day before.\n\nJacqueline came downstairs and noticed lots of police outside, so she opened the door and around 10 officers barged past her to get inside, he said.\n\n\"Ellie was fast asleep on the sofa and Anthony and Andrew were asleep upstairs,\" said Joe, who has a heart condition and has had two strokes.\n\n\"They said 'we have a drugs warrant' and wanted to search the house.\n\n\"Some of them went upstairs into the bedrooms everyone was woken up.\n\n\"Anthony was asked to take off his boxer shorts.\n\n\"I told them it must have been a mistake six or seven times but they didn't listen to me. I have never had anything to do with the police.\n\n\"But they just said 'we don't make mistakes'.\"\n\nFather-of-three Joe said police threatened to arrest Anthony while he argued he was innocent.\n\nHe said he has never had any dealings with police and pleaded with officers himself too.\n\nJoe claims the whole family were made to gather in the living room, and after 15 minutes of \"sheer panic\" the penny dropped when one of the officers called Jacqueline by the wrong name.\n\nHe found a letter with his name and address on, and police realised their \"stupid\" mistake.\n\nJoe said: \"I proved they had the wrong place with the letter.\n\n\"One of them said 'right, let's go', and they left, just like that, without an apology or anything.\n\n\"They all walked out and went to the right address.\n\n\"My granddaughter was terrified. She was inconsolable and doesn't want to come back to this house now.\"\n\nJoe said a neighbour saw police enter the same house number as him on a nearby street, moments later.\n\nA spokesperson for the force says officers were tasked with searching a property in relation to suspected drug offences.\n\nA Police Scotland spokesperson said: \"Police Scotland has received a complaint after officers attended the wrong address whilst executing a search warrant in the Easterhouse area of Glasgow.\n\n\"Enquiries are ongoing and we are unable to comment further.\"",
    "author": "reporters@dailyrecord.co.uk (Jack Longstaff)",
    "url": "https://www.dailyrecord.co.uk/news/scottish-news/innocent-glasgow-man-ordered-drop-18801028",
    "published": "2019-07-30 16:20:38+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}