{
    "data_id": "65303",
    "id": "birminghammail--2019-08-01--Listen as killer mum Louise Porton calmly calls 999 - despite daughter being dead for some time",
    "date": "8/1/2019",
    "source": "birminghammail",
    "title": "Listen as killer mum Louise Porton calmly calls 999 - despite daughter being dead 'for some time'",
    "content": "This is the moment killer mum Louise Porton calmly dialled 999 to request urgent help for her 'unconscious' daughter - despite the tot having been dead 'for some time'.\n\nPorton, 23, was today (August 1) found guilty of the murder of daughters Lexi Draper and Scarlett Vaughan - who died just two weeks apart.\n\nShe was convicted after a five-week trial at Birmingham Crown Court.\n\nLexi, three, was pronounced dead by paramedics at the family home in Beechwood Court, Rugby in the early hours of January 15 last year. Porton called an ambulance saying she had found Lexi lifeless in her bed after going in to check on her.\n\nFollowing Lexi's death the Sudden Unexpected Death in Infancy and Childhood procedures (SUDIC) were followed by professionals.\n\nPorton claimed that on the evening of February 1, she had set out to take Scarlett to the hospital after she had fallen ill.\n\nOn her way to the hospital she pulled over in the car park at Elliott's Retail Park in Rugby to call an ambulance.\n\nScarlett was taken to hospital where she was pronounced dead.\n\nIn audio released by the Crown Prosecution Service, Porton can be heard calmly speaking to an ambulance service operator - claiming daughter Lexi was unconscious and not breathing.\n\nAmbulance service: \"This is the ambulance service, is the patient breathing?\"\n\nAmbulance: \"Who are we talking about?\"\n\nPorton: \"Lexi, she is three\"\n\nAmbulance: \"She's three? OK. She's unconscious and she's not breathing? Help has been arranged OK?\"\n\nAlmost two weeks before her death, Lexi had been taken to hospital on January 2 and then January 4, but was sent home with antibiotics for an apparent chest infection.\n\nProsecutors said that while in hospital with her sick daughter, Porton went to the toilets and took topless photos.\n\nIt was in the days after Lexi was discharged on January 4, the prosecution alleged the mother looked online for \"can you actually die if you have a blocked nose and cover your mouth with tape\".\n\nPorton also searched \"how long after drowning can someone be resuscitated?\" and accessed an article called \"Toddler brought back to life after nearly drowning\", jurors heard.\n\nThe Crown alleged Lexi had been dead for some time before the 999 call was made from her home on January 15, with prosecutor Oliver Saxby QC pointing to evidence of Porton's web searches.\n\nShe was then heard \"laughing\" at a funeral parlour two days before killing Scarlett on February 1.\n\nProsecutors said it had appeared to the funeral arranger present that Porton was \"using FaceTime and that she was speaking to a man\".\n\nJurors were told that after police seized her phone, they uncovered searches including how long it took a dead body \"to go cold up to the shoulder\" and \"five weird things that happen when you die\".\n\nOpening the Crown's case at the start of the trial, prosecutor Oliver Saxby QC said: \"The overwhelming inference is that Lexi and Scarlett died because someone deliberately interfered with their breathing.\n\n\"That someone can only have been this defendant.\"\n\nBoth children had symptoms consistent with deliberate airway obstruction and Scarlett had signs of recent bleeding in her neck tissue, suggestive of neck compression, jurors heard.\n\nMr Saxby said specialist doctors could find no \"natural reason\" for why either child had died.\n\nAfter Scarlett's fatal collapse, Porton told police it was \"entirely false\" to suggest the toddler was already dead when she was recorded on CCTV carrying the little girl from a hotel, in Rugby, where she had been staying.\n\nBut the paramedic responding to the subsequent non-emergency 111 call Porton made, described the girl being \"freezing and completely lifeless\" when he arrived.\n\nCCTV showed Porton filling up with petrol during the period when jurors heard Scarlett had already died.\n\nPorton had denied wrong-doing throughout, telling police in a prepared statement: \"My children were never an inconvenience to me and I accommodated my lifestyle and personal life around them.\n\n\"I still don't know how my daughters died, or what caused it.\"\n\nPorton, formerly of Skiddaw, Rugby, Warwickshire, will be sentenced by Mrs Justice Yip on Friday.",
    "author": "newsdesk@birminghamlive.co.uk (Charlotte Paxton)",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/listen-killer-mum-louise-porton-16684948",
    "published": "2019-08-01 17:22:06+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}