{
    "data_id": "656109",
    "id": "thedcclothesline--2019-02-22--Prosecutors Reviewing 1400 Cases Tied to Houston Cop Whose Lies Got Innocent Couple Murdered",
    "date": "2/22/2019",
    "source": "thedcclothesline",
    "title": "Prosecutors Reviewing 1,400 Cases Tied to Houston Cop Whose Lies Got Innocent Couple Murdered",
    "content": "Houston, TX — Despite their best intentions of sweeping the deaths of Dennis and Rhogena Tuttle under the rug, the Houston police department is currently under the microscope of the nation. Now, in yet another major move, the FBI is stepping in as well as Houston-area prosecutors, who will examine 1,400 other cases which are linked to the cop who fabricated evidence to spark the raid on this innocent couple—in which they were murdered in their own home by police.\n\nOne thing is nearly certain, and if this cop was willing to fabricate information to raid the home of an innocent couple who have lived in the same home for decades and were adored by all their neighbors—he’s likely done this before. So, prosecutors are stepping in and have their work cut out as HPD narcotics Officer Gerald Goines has been involved in more than 1,400 cases throughout his decades-long career of kicking in doors to find illegal substances.\n\nNBC News reports that the FBI also said it has opened an independent civil rights investigation into Jan. 28 raid that left a man and a woman who lived at the home dead and several police officers shot and injured. The agency’s Houston office said the investigation is “into allegations that a search warrant obtained by Houston police officers was based on false, fabricated information.”\n\nAs TFTP reported over the weekend, after controversy and rumors have swarmed the case, the Houston police department has admitted that the entire raid was most likely based on the lies of one of their own.\n\n“That’s totally unacceptable. I’ve told my police department that if you lie, you die,” Acevedo said Friday. “When you lie on an affidavit, that’s not sloppy police work, that’s a crime.”\n\nWhen speaking of these crimes on Monday, Acevedo noted that the officer responsible for lying about this raid will likely be charged. As to what those charges are, however, we are still unclear.\n\nDespite the fact that the officer has yet to be charged, the city’s proactive response to his deadly lies has been surprisingly swift.\n\n“Our duty is to see that justice is done in every case,” Harris County District Attorney Kim Ogg said in a statement. “Although the criminal investigation of Officer Goines is ongoing, we have an immediate ethical obligation to notify defendants and their lawyers in Goines’ other cases to give them an opportunity to independently review any potential defenses.”\n\nWhat’s more, as TFTP reported Wednesday, the Houston police department is claiming they are taking steps to prevent future scenarios like this from happening—by ceasing the use of no-knock raids.\n\n“The no-knock warrants are going to go away like leaded gasoline in this city,” Chief Art Acevedo said during a heated town hall meeting.\n\n“I’m 99.9 percent sure we won’t be using them,” he continued. “If for some reason there would be a specific case, that would come from my office.”\n\nWith news of the 1,400 cases now being reviewed, others who say they have been unjustly charged are coming forward.\n\nThe family of a man arrested in one of the more than two dozen active cases currently tied to Goines is speaking out and has released a video of his arrest.\n\nExclusive video obtained by ABC13 Eyewitness News shows Goines’ arrest of Andrew Hebert last July.\n\nABC13 reports that Cheryl watched as her brother was arrested in front of the family home on Panay. Houston police said he led them on a chase, which he disputes. He followed their commands and surrendered. Cheryl then watched as Goines’ narcotics unit searched her brother’s car.\n\n“They didn’t find anything inside his car,” she added.\n\nDespite Cheryl noting that police didn’t find anything, Hebert was charged with two counts of possessing 200-400 grams of cocaine.\n\nIn light of the recent revelations, Hebert was just granted bail after being denied bond.\n\nAnother family came forward with even more damning information, claiming that Goines had a fit of road rage and killed a man.\n\nReginald Dorsey was fatally wounded in September 1997. What was first reported as a drug bust that turned violent, ended up being a case of road rage on the Southwest Freeway, according to ABC13.\n\nGoines claimed Dorsey cut him off on the freeway and opened fire, leaving the officer no other option but to fire back. This was a claim the victim’s family denies and said Dorsey just defended himself from a plainclothes man who attacked him.\n\n“We knew from the beginning it was a lie,” the victim’s sister, Rhonda Dorsey Williams said. “He murdered my brother. He murdered my brother.”\n\n“You need to pay,” Williams said. “He needs to pay.”\n\n“The concern, of course, is if it’s true, how much smoke is there and how much fire is there in his other cases? Is this just a one-off incident if he, in fact, lied or has been doing this in other cases, and that’s a grave concern to us as defense attorneys and our clients,” said Neal Davis, the vice president of the Harris County Criminal Lawyers Association.\n\nEroding away the notion of this being a one-off incident is the fact that the officer had heroin in his car that fateful day. Was he using this to frame people? Was it for personal consumption?\n\nHopefully, as the investigation continues, the answers to these questions and others will come out.\n\nBelow is the video from ABC 13 of this former arrest:\n\n",
    "author": "Matt Agorist",
    "url": "https://www.dcclothesline.com/2019/02/22/prosecutors-reviewing-1400-cases-tied-to-houston-cop-whose-lies-got-innocent-couple-murdered/",
    "published": "2019-02-22 14:23:12+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}