{
    "data_id": "657322",
    "id": "thedcclothesline--2019-08-18--New Jersey Innocent Father and Daughter Held at Gunpoint on Knees as Cops Shot Their Dogs Lawsuit",
    "date": "8/18/2019",
    "source": "thedcclothesline",
    "title": "New Jersey: Innocent Father and Daughter Held at Gunpoint on Knees as Cops Shot Their Dogs — Lawsuit!",
    "content": "Tinton Falls, NJ — Roberton Fullerton and his daughter Bobbi Rene Fullerton had committed no crime, had harmed no one, and were in their own home when police officers came to the door, ordered them to their knees at gunpoint and shot their two dogs. While apologists continue to claim “if you do nothing wrong, you have nothing to worry about,” this case — like so many others before it — proves them entirely wrong. Now the taxpayers of Tinton Falls will be held liable for the officers’ actions in the form of a lawsuit.\n\nThe Fullertons are now suing the Borough of Tinton Falls, Police Officer Adrian Reyes, several officers referred to only as “John Does,” and Police Chief John Scrivanic in federal court for an amount “yet to be determined.” for the disturbing abuse doled out by the officers. On Tuesday, the lawsuit was scheduled for pretrial.\n\n“They were victims of excessive force. They were held at gunpoint by this officer (Reyes). They were scared out of their minds. The whole thing was very traumatic,” the Fullerton’s attorney Thomas J. Mallon told the Asbury Park Press.\n\nAccording to the lawsuit, the incident unfolded on Oct. 8, 2017. Robert and Bobbi were having a verbal argument at their home that night when someone overheard them and called 911. Police were then dispatched to the residence.\n\nThere was no physical assault, and before any officers arrived, Robert Fullerton received a phone call from “longtime friend,” Tinton Falls Police Officer Lt. Kyle Pearson, the lawsuit states. Pearson confirmed everything was okay and that Robert had simply been arguing with his daughter. Officer Pearson, according to the lawsuit, then attempted to notify the responding officers that “no assault had occurred.” However, he was too late.\n\nAs the Asbury Park Press reports, notwithstanding, the police went to Fullerton’s home and knocked on the door. Robert Fullerton opened the door and stepped outside. Sadie, one of the plaintiffs’ German shepherds, brushed passed Fullerton, walked onto the driveway “and was immediately shot three times,” by Reyes, or one of the John Doe officers, the lawsuit said.\n\nReyes then “ordered Fullerton at gunpoint, with the gun pointed at his face, to get on the ground,” according to the lawsuit.\n\nWhile on his knees, Robert watched as police then ordered his daughter to her knees as their dog Hannah followed her outside. Police then opened fire on Hannah, shooting the German Shepherd twice.\n\nAccording to the report, Sadie died from the gunshots while Hannah was taken to a veterinary hospital. The Fullertons claim they incurred over $7,000 in veterinary expenses.\n\nAfter watching the officers shoot their dogs all the while having guns pointed at their heads, neither of the Fullertons were charged with any crime and the officers left.\n\nImagine for a moment that non-police officers had gone to the Fullerton’s home, held them at gunpoint on their knees and shot their dogs. This story would be on the front page of newspapers across the country and may even be the subject of a feature film.\n\nHowever, because the assailants were police officers, there will be very little media coverage and they will face zero accountability. And, as the video below illustrates, this is all done by design.\n\nLuckily for the Fullertons, when the police officers shot their dogs, neither of them were shot in the process. Others cannot say the same.\n\nAs TFTP reported earlier this month, in Texas, police were conducting a welfare check on a sleeping woman who was reportedly napping in a grassy area near Canton Drive and North Collins Street in Arlington. Instead of receiving help, however, this sleeping woman received a fatal bullet.\n\nAccording to police, as the officer approached the sleeping woman lying in the grass, he saw a stray dog. The officer claims to have called out to the woman when all of the sudden, the dog started charging him, so he fired his weapon several times. The officer missed the dog, but hit the woman instead. She did not survive.",
    "author": "Matt Agorist",
    "url": "https://www.dcclothesline.com/2019/08/18/new-jersey-innocent-father-and-daughter-held-at-gunpoint-on-knees-as-cops-shot-their-dogs-lawsuit/",
    "published": "2019-08-18 16:10:07+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}