{
    "data_id": "657928",
    "id": "thedcclothesline--2019-11-01--Colorado: SWAT Team Blows Up Innocent Man’s Home in Search of Clothing Shoplifter—Deal With It, Says",
    "date": "11/1/2019",
    "source": "thedcclothesline",
    "title": "Colorado: SWAT Team Blows Up Innocent Man’s Home in Search of Clothing Shoplifter—Deal With It, Says Court",
    "content": "Greenwood Village, CO – A Federal Appeals court has granted police new powers for which they will not be held accountable. They can now completely destroy your home and they will not have to pay for it. That’s what happened to Leo Lech’s home in 2015 after a shoplifter — accused of stealing a shirt — illegally entered his home, forcing Greenwood Village SWAT to go room by room ransacking the place with explosives.\n\nThe 19-hour standoff ended with the suspect being taken into custody, but not before the home, as TFTP previously reported, was destroyed. The place looked like it was hit with a bulldozer. None of the windows were intact, and the doors were blown off their hinges. The Lech family’s possessions were completely destroyed, left in tatters after the SWAT team showed no concern for the home nor its belongings. According to the DailyMail:\n\nInitially, the Lech family was offered $5,000 in housing assistance and insurance deductible compensation, a far cry from what it would take to simply raze the home, let alone rebuild it. Leo Lech sued the city, but the court ruled what happened to the home did not amount to eminent domain and was simply a result of a police matter. Therefore, the city was under no obligation to condemn the home nor rebuild it. In other words, apart from the $5000, Lech was getting nothing else. Lech commented in 2015:\n\nIn 2017, after being offered the $5,000, Lech had this to say.\n\nLech appealed the decision to a higher court but on Wednesday was denied, yet again. He says he’s now going to appeal to the Supreme Court of the United States and he has a lot more to say about how police upended his life and the lives of his other family members.\n\nLeo Lech was renting the destroyed home to his son John, his girlfriend, and their son. Far from being a tenant in a rental home, when police destroyed all of John’s possessions along with his dwelling, he says he was forced to live with his parents, find another job, and force his son to attend another school. The chaos which ensued from the SWAT melee which included an estimated 50 officers, truly caused the family an enormous amount of discomfort the family says. And, rightfully so, they are upset, to say the least. On Tuesday, Lech told the Washington Post:\n\nIt’s true America. We don’t know whether to categorize it as the effects of a Police State or Judicial Tyranny, but one man’s quest to get his home rebuilt by the very police department which completely destroyed it with grenades, explosives, gas canisters, battering rams, and an armored personnel carrier (typically used by the military), ended in defeat.\n\nIn the land of the free, the cops can now destroy your home completely and you’ll be left to pick up the pieces. Hopefully, Lech and his lawyers will appeal to the SCOTUS and the dangerous precedent will be overturned.\n• Michigan: Mother and Children Left Homeless After Police Destroy House Looking for Non-Existent Suspect",
    "author": "Jack Burns",
    "url": "https://www.dcclothesline.com/2019/11/01/colorado-swat-team-blows-up-innocent-mans-home-in-search-of-clothing-shoplifter-deal-with-it-says-court/",
    "published": "Fri, 01 Nov 2019 15:54:28 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}