{
    "data_id": "658089",
    "id": "thedcclothesline--2019-11-18--The rule of law has collapsed in America, a nation where the guilty go free while the innocent are p",
    "date": "11/18/2019",
    "source": "thedcclothesline",
    "title": "The rule of law has collapsed in America, a nation where the guilty go free while the innocent are persecuted and silenced",
    "content": "(Natural News) As of November 15, 2019, the rule of law no longer exists in the United States of America.\n\nThis has become abundantly apparent with the rigged jury decision to incarcerate Roger Stone for the “process crime” of misstating memories during interrogations with federal agents. In an era where Hillary Clinton is openly allowed by the director of the FBI (treasonous criminal James Comey) to destroy evidence, obstruct justice and get away with high-level crimes because “she didn’t mean to” violate the law, Roger Stone is about to be sentenced to what will essentially be life in prison (he’s 67 years old).\n\nIn an era when former president Barack Obama illegally laundered billions of dollars through international banks in order to fly actual pallets of cash to Iran to fund their nuclear weapons program, Julian Assange rots in custody, denied his freedom, his health and his sanity for over a decade, all as punishment for daring to expose the dark secrets of the military industrial complex.\n\nThe jury against Roger Stone was rigged with over 90% of the people in the jury pool found to be supporters of Hillary Clinton. The malicious fake news media smeared Stone for years, installing intense hatred in the minds of the jurists and cementing the outcome of the “trial,” if it can even be called that.\n\ntake our poll - story continues below\n\nMeanwhile, Adam Schiff (Loonbag-CA) holds secret trials with secret transcripts in secret dungeons, coaching witnesses to say what he wants them to say while editing secret transcripts to make those witnesses appear to say things they never said. The treasonous media runs with every lie Schiff hands them, having long abandoned any last shred of journalistic integrity or basic human decency.\n\nThe rule of law has collapsed in America, and no one is safe from the hate-filled left-wing mob that now openly seeks to criminalize all political opposition.\n\nIf you oppose the Democrat mob, you will be targeted and destroyed\n\nIf you oppose the Democrats, you will eventually be targeted by the IRS (Lois Lerner, anyone?), arrested by the Feds in a midnight raid that’s coordinated with CNN (a la Roger Stone), de-platformed from all the major tech platforms, smeared on Wikipedia with an onslaught of fabricated lies, demonized by the fake news media with coordinated hit pieces (as the NYT just did with John Solomon) and harassed in public by violent, drooling left-wing mobs that are triggered into rage by the very sight of the American flag or a MAGA hat.\n\nThe juries in left-wing cities will never find a violent Leftist guilty, nor a conservative patriot innocent. A jury in San Francisco, for example, set an illegal alien free after he shot and killed an American woman in an obvious case of manslaughter, if not homicide. But he was set free because San Francisco is a “sanctuary” city, which means the people who run that collapsing sh#thole of feces and filth have decided to ignore the laws they don’t like.\n\nAnd this is how things are now progressing — if you can call it that — all across the country, where the rule of law is abandoned at will, replaced by a raging, anti-American, anti-Trump, anti-freedom tyranny of the left-wing majority mob.\n\nThe left-wing dedication to authoritarianism and tyranny is now so complete that all the tech giants recently conspired to memory hole the name of the deep state spy “whistleblower” Eric Ciaramella. Even uttering that name will get you banned on Facebook, YouTube and Twitter. Indeed, stating a name now gets you banned from the public square for the simple reason that the deep state has ordered the tech giants to eliminate that name from public discourse.\n\nSimilarly, the tech giants have now banned a Republican candidate for congress simply for being a Republican. Under the tyrannical thumb of Jack Dorsey, an un-indicted criminal guilty of treason against America for rigging elections, Twitter is now banning people for merely tweeting, “I hired Donald Trump to fire people like Yovanovitch,” referring to the lying former ambassador of Ukraine, who is whining about being fired after wasting taxpayer money by doing a lousy job as ambassador.\n\nThe effort to criminalize Trump’s foreign policy, you see, is really just a symptom of a much larger effort being pursued by the lawless, deranged, lunatic Left: The complete criminalization of “disobedience” to the left-wing agenda.\n\nThe real goal is the criminalization of conservatism\n\nTry standing up at your local city council meeting and declaring, “There are only two genders,” and you’ll get a taste of the level of outright lunacy, violence and authoritarianism that has now infected the minds of the American people (including those who call themselves “conservatives” but have surrendered to the insanity of the Left in order to try to sue for peace).\n\nThe real goal of the authoritarian Left is to criminalize conservativism, Christianity and disobedience against every left-wing agenda, including their desire to pump your children full of chemical castration drugs in the name of “transgenderism” justice — just the latest mental illness to sweep through the ranks of deranged Leftists whose cognitive function now resembles that of zombies.\n\nThe attacks on Trump, Roger Stone, Alex Jones, John Solomon, Sean Hannity and other prominent independent analysts were never about the real rule of law… it has always been about criminalizing opposition and using the twisted “injustice” system to incarcerate anyone who stands in the way of the lawless left-wing mob and its criminal mafia mob bosses like Hillary Clinton.\n\nNow, because of the collapse of the rule of law in America, here’s where we find ourselves:\n• There is now no point in surrendering to any federal agent in any circumstance, since there is zero possibility of experiencing a fair trial. Everything will be rigged against you: The evidence, the judge, the witnesses, the jury and the media. You will be gagged, denied your right to defend yourself and denied the right to say “you didn’t mean to” like Hillary Clinton got away with.\n• Federal law enforcement is hopelessly corrupt, with the FBI now running political smear operations and staging nearly all the domestic terrorism plots in America. The FBI, under people like Mueller and Comey, has not only been involved in covering up the truths about 9/11, Oklahoma City, the assassination of Dr. MLK, Jr., the Waco raids and the 1993 attempted bombing of the Twin Towers; it actually turns out the FBI ran those operations. (See FBIcorruption.news.)\n• Federal judges have zero loyalty to the rule of law and absolute loyalty to the deep state. They have abandoned any last shred of even the pretense of following the Constitution and now exploit their positions of power to shore up the power of the deep state while destroying all those who threaten it.\n• There is no expectation of safety for a law-abiding citizen, since any person can be targeted by the left-wing mob (a la Adam Schiff, the left-wing media, the tech giants, deep state agents, etc.) and then silenced, assassinated, indicted, audited or otherwise destroyed by any combination of establishment weapons against dissent.\n• Elections are now hopelessly rigged, with Democrats controlling nearly every election outcome through a combination of illegals voting (14 states give driver’s licenses to illegal aliens now), ballot harvesting and vote stuffing by using cyber warfare techniques to make sure all the people who previously left a particular state magically vote for Democrats. This is how Kentucky’s recent election was rigged.\n• Democrats are now openly calling for acts of violence and street warfare against not just conservative candidates but their financial supporters. Recently, a Democrat in Texas doxxed Trump donors, releasing their names and home addresses to the public in order to encourage left-wing Antifa brownshirts to harass and intimidate Trump donors.\n• There is no free speech in America, as the tech giants have now brazenly conspired to silence all pro-Trump voices in their highly illegal conspiracy to rig all future elections. Yet somehow, they seem to face zero push back from regulators, the FTC, the DOJ or Republican lawmakers (with a few exceptions such as MO Sen. Hawley, who is leading the charge against Big Tech’s illegal censorship).\n• Second Amendment rights are being rapidly dismantled by left-wing cities and states as they seek to completely disarm the citizenry so that no resistance can be mounted against the corruption, treason and tyranny of left-wing government run by extreme criminals known as “Democrats.”\n• The “mainstream media” has now devolved into nothing but a coordinated smear engine to de-legitimize and de-humanize the political opponents of the radical Left. NBC News, in particular, is engaged in such malicious smears that one of their hate pieces targeting my own publishing company resulted in hundreds of deranged, violent left-wing lunatics calling and threatening the employee of a hosting company that hosts some of our websites. The child of one employee was even threatened in public school by other students who were children of radical left-wing Antifa parents. As All News Pipeline reports, “With the MSM also releasing ‘hit pieces‘ upon outlets such as The Federalist and the Western Journal, we keep coming back to just how deeply the CIA had infiltrated the mainstream media going all the way back to the early 1950’s and ‘Operation Mockingbird‘, the large-scale propaganda program designed to manipulate the news media and, in so doing, manipulate the minds of every man, woman and child across America.”\n• Driven to psychological extremism by the hate-filled fake news media, Leftists are now openly celebrating the abandonment of due process and the politically targeted extermination of free speech, claiming that these basic civil rights of speech and law have no place in a “tolerant” society. Yes, that’s their actual argument. They claim free speech is “violence.”\n• As a result, Twitter has now collapsed into a cesspool of radical left-wing extremism and “groupthink,” where all voices of opposition are silenced, effectively creating a feedback loop of left-wing insanity that now drives Democrat candidates to positions so extreme and insane that even Barack Obama now claims the Left has gone way too far. (When Obama tells you that you’ve gone too far to the Left, you’re beyond all hope…)\n• Mass mental illness is now parading around as “progressivism,” even when the signs of mental illness are irrefutable, such as parents trying to physically chop off the reproductive organs of their baby boys in order to convert them into transgenders.\n\nUnder the tyrannical rule of lawless, mentally ill Democrats, the government is now run like an organized crime syndicate. John W. Whitehead of The Rutherford Institute sums it all up perfectly in a recent column:\n\nAll of us are in danger.\n\nIn an age of prosecutions for thought crimes, pre-crime deterrence programs, and government agencies that operate like organized crime syndicates, there is a new kind of tyranny being imposed on those who dare to expose the crimes of the Deep State, whose reach has gone global.\n\nThe Deep State has embarked on a ruthless, take-no-prisoners, all-out assault on truth-tellers.\n\nActivists, journalists and whistleblowers alike are being terrorized, traumatized, tortured and subjected to the fear-inducing, mind-altering, soul-destroying, smash-your-face-in tactics employed by the superpowers-that-be.\n\nFollowing the current downward trajectory, it won’t be long before anyone who believes in holding the government accountable is labeled an “extremist,” is relegated to an underclass that doesn’t fit in, must be watched all the time, and is rounded up when the government deems it necessary.\n\nEventually, we will all be potential suspects, terrorists and lawbreakers in the eyes of the government.\n\nNow the collapse will accelerate, and America will become Venezuela\n\nNow that the rule of law has collapsed in America, and the media has become a psychological terrorism hub run by the CIA, and the courts have abandoned all justice, and the elections are all rigged by treasonous Democrats, we are going to witness a rapid collapse into despotism, lawlessness and desperation.\n\nThe model for this collapse is already on display for the world to see: Venezuela.\n\nA doctor who still survives the collapse of civil society in Venezuela, Maybell Nieves, has written about how this collapse accelerates year after year, stripping away every right and last shred of human decency from the citizens as the corrupt, treasonous government becomes powerful and treacherous to everyone:\n\nThat’s probably why those first few years didn’t really feel like something was taken away from us… Later came the control of the prices of basic products, which caused the disappearance of those items and initiated a black market that is also very much in force to this day.\n\nThe decay was soon seen in many aspects. There was no longer maintenance on public roads, and public services failed often until reaching the point of constant failures of electric service, even for days. The public health situation is also getting worse and worse. As a health professional, I have seen this deterioration for the last 10 years.\n\nThe state will rip you off, but it doesn’t happen all of a sudden. There are a lot of logistics; it takes a long time to develop the kind of policy that makes citizens totally dependent on the state.\n\nYou start by losing something unimportant, like some kind of monetary bonus now given to you as government-run grocery store credits, and you end up losing your freedom and all kinds of rights, including freedom of speech and protest, but these issues are so extensive that they require an article of their own to explain them properly.\n\nThe state has taken charge, with great success I must say, and you are now living in fear of the so-called public authorities, meaning police and military police, since they serve as pro-government forces of repression.\n\nIn any public protest, savage repression is a constant. That violence is what we Venezuelans have become used to.When there is no public or social security, when the devaluation of the currency is occurring on a daily basis, and when you don’t know if the bakery on the corner is going to be broken into tomorrow, at that moment, the debacle has already occurred.\n\nSo the mismanagement of incompetent and corrupt civil servants results in the deep separation of three social classes: extreme poverty, which represents more than 80% of the population and is totally dependent on the government; the working middle class, which manages to subsist through one or two basic incomes plus the economic help of family members abroad; and those who do business with the government and can live in a very comfortable, ideal world that has nothing to do with reality.\n\nThere comes a point at which the only thing in your mind is to know if you will return home alive. Everything else is secondary. At that point, the state has already massacred you internally. You can never be the same again. I’m sure I am not.\n\nThis is the future for America if We the People do not take this country back from the lawless, treasonous, eternally corrupt deep state puppetmasters\n\nWhat you read above is what you will be living soon in America as the collapse continues:\n• The streets of left-wing cities will be running with feces and filth. In many cities, they already are.\n• The collapse of the rule of law will lead to exploding crime rates everywhere.\n• Corporations like Google will decide all future elections, and if your speech does not agree with the ideas of unelected Google engineers, you will be silenced and demonized.\n• The deep state will make sure that all voices of opposition to the corrupt establishment — including independent journalists — will be criminalized, arrested, indicted and likely “Jeffrey Epsteined.”\n• As the rule of law collapses, business transactions will become increasingly difficult to complete. Eventually, food supplies will collapse and deliveries will cease, leading to mass food riots in the nation’s most populated cities.\n• After Trump is removed from power by treasonous criminals in the deep state (Brennan, Comey, Mueller, McCabe, etc.), the federal government will declare war on the American people and go door to door, seizing guns, executing Christians, setting fire to the homes of conservatives, looting household valuables and kidnapping wives and daughters for human trafficking operations run in conjunction with UN troops which will also occupy U.S. soil.\n• America will be turned into a war zone, with the government waging war against the Constitution, the People and human rights.\n• The economic collapse will accelerate, leading to widespread impoverishment, starvation, desperation, crime and corruption.\n• The violence of the lunatic Left will rapidly increase to the point where Leftists openly engage in executions, rapings, kidnappings, lootings and anything else they can get away with, always targeting conservatives and “white people,” thanks to the hatred pushed by the NYT, WashPost, CNN, MSNBC and late night comedy shows like Jimmy Kimmel.\n\nThe rule of LAW now collapses to the rule of FORCE\n\nYou can probably imagine what else will occur. Basically it’s the collapse of human society. During all this, of course, armed American patriots will be taking it to the criminal traitors in all sorts of various ways, all across America. It will probably be open season on corruption, everywhere across America. Sadly, with the rule of law now dead in America, any reasonable person must wonder incentive remains for anyone to abide by any law whatsoever?\n\nThe only thing that matters to the corrupt Democrats now is force. The radical Left will use force to destroy you if you don’t comply. They will have you arrested at gunpoint or attacked on the streets at the hands of violent Antifa mobs. They will even force you to vaccinate your children at gunpoint… or they will medically kidnap your children at gunpoint if you refuse to comply.\n\nForce is now the only rule remaining in deep state-controlled America. Everything else has collapsed. There is no free speech, no fair trial, no system of justice, no reasonable expectation of human rights anywhere, no fair elections, no honest news, no honest Wall Street operations, no real public education, no clean food, no certainty of safety with products purchased on Amazon.com, no faith in the broken banking system, no faith that any elected official will keep any promises, no trust in the FBI or federal law enforcement and no reasonable expectation that anything will get better.\n\nJust as I promised they would, the Democrats are destroying everything of value as they seek to demolish human decency, human rights and human society. This is their goal. Do not be deluded into thinking anything else.\n\nIt won’t be long before this website is blockaded by all internet tech companies, by the way. All voices of dissent will be erased and memory holed. You will soon be on your own.\n\nPrepare to take steps to defend your survival, for that is what all this has come to. If you aren’t willing to defend your nation, your Constitution, your life and the rule of law, then the DEMONrats have already won and humanity will be extinguished in no time at all.\n\nThe Second Amendment tipping point now appears imminent.",
    "author": "Mike Adams",
    "url": "https://www.dcclothesline.com/2019/11/18/the-rule-of-law-has-collapsed-in-america-a-nation-where-the-guilty-go-free-while-the-innocent-are-persecuted-and-silenced/",
    "published": "Mon, 18 Nov 2019 16:07:11 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}