{
    "data_id": "66396",
    "id": "birminghammail--2019-09-10--First picture of killer girlfriend Olivia Halcrow who stabbed partner to death in drunken rage",
    "date": "9/10/2019",
    "source": "birminghammail",
    "title": "First picture of killer girlfriend Olivia Halcrow who stabbed partner to death in drunken rage",
    "content": "A drunk girlfriend who killed her boyfriend in a frenzied stabbing has been jailed for 18 years.\n\nThe body of Gary Cunningham, 29, was discovered by a delivery driver outside her home in Harborne, Birmingham.\n\nHe had been stabbed by Olivia Labinjo Halcrow TWELVE times and bled to death.\n\nThe 26 year-old previously been acquitted of murder but was found guilty of manslaughter on the grounds of diminished responsibility by a jury at Birmingham Crown Court.\n\nThe court heard that Labinjo Halcrow had been Mr Cunningham's on and off girlfriend and had a young son from a previous relationship.\n\nText messages between the pair suggested there had been a history of physical violence between them.\n\nLabinjo Halcrow lived in a block of flats in Frensham Way and in the early hours of February 23 a neighbour had heard \"banging and screaming\".\n\nMr Cunningham had gone out in the morning to a garage but he was later found propped up against a fire exit door with blood around him.\n\nOne of the wounds he suffered had severed an artery below his left knee and he had bled to death.\n\nKate Bex QC, prosecuting, said there was evidence that both had been on drink and drugs before the killing and said that the defendant had been three and a half times over the alcohol limit for driving when the victim died.\n\nAli Bajwa QC, defending, said Labinjo Halcrow suffered from a depressive illness and had no memory of the stabbing.\n\nHe claimed that she had been subjected by Mr Cunningham to a controlling and manipulative relationship.\n\nIn passing sentence Judge Simon Drew QC said: \"On the morning of 23 February after consuming large quantities of alcohol you attacked Gary Cunningham.\n\n\"I accept that your relationship with him was a volatile one, punctuated by episodes of violence. However I do not accept that was only one way.\n\n\"It also became clear to me as the trial progressed that you are someone who can be bullying, manipulative, prone to exaggeration and if necessary lies, in order to get your own way.\"\n\nHe added: \"In my judgement the degree of responsibility retained by you was somewhere between medium and high.\n\n\"I accept you may not have been aware of the fact that Gary Cunningham was bleeding to death on the landing outside your flat.\n\n\"However not only did he suffer multiple injuries but he also sustained 12 separate wounds.\n\n\"The fact that some of them were relatively superficial suggests that the attack went on for some time, therby prolonging the suffering.\n\n\"Furthermore the fatal blow did not cause instant death.\"",
    "author": "newsdesk@birminghamlive.co.uk (Ross McCarthy)",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/first-picture-killer-girlfriend-olivia-16896219",
    "published": "2019-09-10 15:20:06+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}