{
    "data_id": "665002",
    "id": "thedenverpost--2019-11-04--Guest Commentary: Lying jailhouse informants shouldn’t put innocent Coloradans behind bars",
    "date": "11/4/2019",
    "source": "thedenverpost",
    "title": "Guest Commentary: Lying jailhouse informants shouldn’t put innocent Coloradans behind bars",
    "content": "Imagine being convicted of a brutal crime you did not commit as a teenager. The recent Netflix series “When They See Us” told the story of the Central Park Five, a group of teenagers who were wrongly convicted of raping a jogger in New York City. Korey Wise was one of those young men, and he is the namesake of the innocence project that I direct at Colorado Law.\n\nSimilar injustices have happened in our state. This week marks 18 years since Lawrence Montoya was convicted and sentenced to life in prison for the 2000 murder of a teacher in Denver. At the age of 15 he was sent to prison because of lies told by a jailhouse informant.\n\nThe prosecution’s case largely relied on a jailhouse informant who claimed that Lawrence confessed to him when they shared a room together in juvenile detention as Lawrence awaited trial. The jailhouse informant gave details that appeared to be corroborated by a crime scene expert, and the jailhouse informant’s mother said that he told her about the alleged confession shortly after it happened.\n\nTo a jury, it looked like the jailhouse informant was telling the truth. In reality, he never shared a room with Lawrence. His testimony was inconsistent with both the physical evidence and earlier statements he gave to law enforcement. The prosecution also denied that the jailhouse informant got a deal. However, his probation sentence for burglary was terminated shortly after he agreed to testify. The prosecution failed to meet its constitutional obligation to disclose this information to the defense. As a result, Lawrence’s lawyers could not adequately expose the jailhouse informant’s motivations and credibility to the jury.\n\nOn November 3, 2000, Lawrence was convicted of murder and sentenced to life in prison without parole. It would take over a decade for DNA testing to undermine the conviction and for Lawrence to finally be released from prison.\n\nIt was too easy for lies told by a jailhouse informant to wrongfully convict Lawrence Montoya. The unchecked system of offering leniency for testimony also harms crime victims and public safety. When a jailhouse informant receives a reduced sentence or gets his charges dismissed, what kind of message does that send to the victims of his own crimes? Plus, when the questionable testimony of an informant leads to the conviction of an innocent person, the actual perpetrators may go on to harm others.\n\nAs more cases like Lawrence’s have come to light, there has been a growing national movement to increase transparency and scrutiny around jailhouse witnesses. This year, Connecticut passed a new law that will create the nation’s first statewide system to track the use of and benefits provided for their testimony. The measure will give prosecutors more complete information to vet potential jailhouse witnesses before putting them on the stand.\n\nAdditionally, Connecticut and Illinois require judges to hold pre-trial hearings to screen out unreliable testimony before it is heard by jurors. Recently, Nebraska and Texas passed laws specifying when and what types of evidence the prosecution must disclose to the defense if it plans to use a jailhouse witness.\n\nNebraska’s law also requires that victims of a jailhouse informant’s crimes be notified if charges are dismissed or reduced in exchange for cooperation. A number of states including Oklahoma and Utah give special jury instructions about the specific factors that should be considered when evaluating jailhouse informant testimony.\n\nWhat happened to Lawrence Montoya shouldn’t happen to any other innocent person. Colorado should adopt the safeguards that have been implemented in other states when the legislature meets this session.\n\nAnne-Marie Moyes is the program director of the Korey Wise Innocence Project at Colorado Law. which investigates claims of wrongful convictions and advocates for policies that address and prevent wrongful convictions.\n\nTo send a letter to the editor about this article, submit online or check out our guidelines for how to submit by email or mail.",
    "author": "Anne-Marie Moyes",
    "url": "https://www.denverpost.com/2019/11/04/guest-commentary-lying-jailhouse-informants-shouldnt-put-innocent-coloradans-behind-bars/",
    "published": "Mon, 04 Nov 2019 23:06:45 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}