{
    "data_id": "66776",
    "id": "birminghammail--2019-10-03--Killer Paul Proctor shocked when told he faced manslaughter charge 17 years after punching victim",
    "date": "10/3/2019",
    "source": "birminghammail",
    "title": "Killer Paul Proctor \"shocked\" when told he faced manslaughter charge 17 years after punching victim in face",
    "content": "A man who killed a \"gentle giant\" was left \"shocked\" as he was dragged back into a police station and charged with the manslaughter of his victim 17 years after brutally attacking him.\n\nBut the detective who investigated the tragic case said that Proctor, who was today jailed for two years and ten months for manslaughter\n\nPaul Proctor, 47, of Priestland Road, Shard End, had already served an 18 month custodial sentence back in 2002 after pleading guilty to a charge of wounding following an attack on Mark Wilkie outside The Tyburn pub, in  Castle Vale , on August 6, 2000.\n\nMr Wilkie was left for dead in a sickening assault where he suffered a horrific brain injury from a single brutal punch. He was just 27 and never fully recovered.\n\nMark was left in a wheelchair and needing round-the-clock care, before he finally succumbed to his injuries in October 2017.\n\nHis close-knit family were torn apart by the attack and his mum, Lilly, died just two months after him.\n\nFollowing Mark's death from pneumonia, linked to a head injury, Proctor - of Priestland Road, Shard End - was charged again with manslaughter and pleaded guilty to the offence at Birmingham Crown Court back in August.\n\nToday he was starting another period in custody after being sentenced to two years and ten months.\n\nDetective Inspector Jim Colclough, who led the investigation, said Proctor hadn't shown any remorse following Mr Wilkie's death.\n\nHe said: \"As a result of the sad death of Mr Wilkie in October 2017 we reopened the case and due to medical evidence we were able to link his death with Paul Proctor and the one punch he inflicted on Mr Wilkie on that day. We were then able to secure a manslaughter charge.\n\n\"Following Mr Wilkie's death Proctor was brought into the police station. He had served a custodial sentence of 18 months back in 2002 for wounding. As a result of his death we spoke to Proctor. He was clearly shocked facing a manslaughter charge 17 years after Mr Wilkie's death.\"\n\nDI Colclough said Proctor's actions had turned the lives of Mr Wilkie and his family upside down.\n\nHe added: \"This brutal act had a devastating affect on Mr Wilkie and his close family. He was left with a brain injury and required long term care for his injuries. This now brings closure and some kind of justice for Mr Wilkie's family.\"\n\nSpeaking exclusively to Birmingham Live  Mark's sister Claire Hazel said said her family's lives had been shattered by the unprovoked attack, and they were 'struggling to come to terms' with the events of the past two decades.\n\nShe said: \"We put our lives on hold - the attack destroyed our family.\n\n\"I half expected him to go back to being the Mark we all knew and loved, but he never recovered and was left severely disabled and needing 24-hour care.\n\n\"He had no quality of life and to this day, we still can't believe it happened.\n\n\"It had a huge affect on our mum and the rest of the family. We would go to hospital every day and sit with him, I'd take my son who was only one at the time and I'd only leave when it was time to fetch my daughter from school.\n\n\"I did it out of sisterly love - Mark was my only brother and he was wonderful. He was kind, caring, loving, thoughtful and a real family man.\"",
    "author": "newsdesk@birminghamlive.co.uk (Charlotte Paxton, Andy Richardson)",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/killer-paul-proctor-shocked-faced-17025731",
    "published": "2019-10-03 15:19:26+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}