{
    "data_id": "67281",
    "id": "birminghammail--2019-10-16--First picture of killer driver Adrian Paskin who left his girlfriend Sarah Handley to die in horror ",
    "date": "10/16/2019",
    "source": "birminghammail",
    "title": "First picture of killer driver Adrian Paskin who left his girlfriend Sarah Handley to die in horror crash",
    "content": "This is the first picture of driver Adrian Paskin who killed his girlfriend in a high speed crash whilst fleeing from police.\n\nMum Sarah Handley was left with fatal head injuries in the back of the vehicle - but cowardly Paskin fled the scene in Handsworth , leaving her to die.\n\nPaskin was jailed for over nine years at Birmingham crown court on Wednesday (October 16).\n\nThe 35-year-old, of no fixed address, pleaded guilty to causing death by dangerous driving, driving while disqualified and driving with no insurance.\n\nIt happened as Paskin fled from officers in his Ford Fiesta after being spotted on the M6 on the evening of Saturday August 17.\n\nHis vehicle had already being involved in a police pursuit earlier that day which was abandoned by officers due to his dangerous driving.\n\nAfter leaving the motorway, Paskin realised he was being followed and made off at speed.\n\nHe drove on pavements in excess of 70mph and ran two red lights. The pursuit was again abandoned as it was considered too high risk.\n\nSadly within a minute of the pursuit being abandoned Paskin’s Fiesta was found on Crocketts Road, where it had collided head on with a WV Golf at the junction with Junction Road.\n\nPaskin ran from the scene, leaving his girlfriend, 28-year-old Sarah Handley, in the back of the car. Tragically Sarah died shortly after in hospital from head injuries sustained in the collision.\n\nThe three people in the WV Golf all received hospital treatment for minor injuries.\n\nSix hours after the collision Paskin handed himself in to police and was arrested for causing death by dangerous driving.\n\nHe was today given a 14 year sentence reduced to nine years and four months for his guilty plea at Birmingham Crown Court.\n\nThe force’s Professional Standards Department was informed as well as the Independent Office for Police Conduct, as is normal procedure in a collision where a police vehicle is involved, who are conducting an investigation.\n\nSergeant Dean Caswell, from the Serious Collision Investigation Unit, said: \"This is such a tragic case, Sarah was a much loved mother, daughter, sister and aunty.\n\n\"She was taken in such horrific circumstances and my sympathy remains with her family at this extremely difficult time.\n\n\"Paskin’s behaviour was persistently dangerous on two occasions on that day, the judge describing it as a deliberate act.\n\n\"He showed no regard for the law or the safety of his girlfriend and other road users, and his dangerous actions lead to Sarah’s death.\"",
    "author": "newsdesk@birminghamlive.co.uk (Jane Tyler)",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/first-picture-killer-driver-adrian-17096880",
    "published": "Wed, 16 Oct 2019 17:21:45 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}