{
    "data_id": "68689",
    "id": "birminghammail--2019-12-05--Alesha MacPhail's killer Aaron Campbell 'could not have been stopped'",
    "date": "12/5/2019",
    "source": "birminghammail",
    "title": "Alesha MacPhail's killer Aaron Campbell 'could not have been stopped'",
    "content": "A review into the case of teenage killer Aaron Campbell has found his actions could not have been predicted by authorities.\n\nCampbell was jailed for life after snatching Alesha MacPhail from her bed on the Isle of Bute before raping and murdering the six-year-old last summer.\n\nArgyll and Bute Child Protection Committee carried out a review following the crime, which said Campbell, then 16, had been known to the authorities and was twice referred to the Youth Justice Service.\n\nHis offending was considered low-level, however, and did not warrant the implementation of the authority's Sexual Harmful Behaviours Protocol.\n\nThe report was produced in June but not published in full due to data protection laws.\n\nA summary, which refers to Campbell as \"X\", said: \"The review has established that those professionals working with X were not aware of concerning behaviours that would have raised concerns for those professionals working with X.\n\n\"The review group are of the view that there was no indication that agencies could have foreseen or predicted X's offending behaviour.\"\n\nThe group commended the response of the local secondary school head teacher and staff in helping Campbell's fellow pupils come to terms with the crime.\n\nThe report said: \"Initially, some pupils could not believe that X had committed the offence and could not accept this up until the point where he was found guilty and sentenced.\n\n\"The head teacher sensitively and effectively managed an exceptional set of circumstances and worked with colleagues from educational psychology and Rape Crisis to provide support and counselling to pupils and staff.\"\n\nAlesha, from Coatbridge in North Lanarkshire, was staying with her grandparents and father Robert MacPhail on her school holidays when she was preyed on by Campbell on July 2 last year.\n\nThe teenager, who the High Court in Glasgow heard had previously bought cannabis from Mr MacPhail, tried to incriminate his partner, Toni McLachlan.\n\nCampbell was found guilty and sentenced to a minimum term of 27 years in jail, reduced to 24 years following an appeal.\n\nThe review group included representatives from Argyll and Bute Health and Social Care Partnership and Police Scotland.\n\nThe committee found evidence of good communication between the island's social work team and education services, which it said had \"played a key role as named person in supporting and monitoring X\".\n\nIt ruled out carrying out a significant case review.\n\nAlesha's uncle, Calum-John MacPhail, told the Daily Mail: \"There should be a full investigation to find out if opportunities were missed to save Alesha.\n\n\"We had no idea before this that there were any markers or concerns about Campbell - apart from unconfirmed rumour - and I'm angry about that.\n\n\"There has to be a full significant case review and we need to find out what happened to prevent any future tragedies.\"\n\nCleland Sneddon, chairman of Argyll and Bute chief officers group for public protection, said: \"Our drive is to do all we can to protect children.\n\n\"We therefore went beyond what is required from an initial review and carried out a thorough, multi-agency assessment of what happened.\n\n\"This robust process has evidenced that a crime of this nature could not have been foreseen.\"\n\nHe added: \"Given the extensive and thorough nature of the multi-agency assessment, it is our view that the initial review has covered everything that would be expected to be assessed by a significant case review.\n\n\"We will use the work of our initial review to support ongoing development of child protection practices.\n\n\"Our thoughts continue to be with Alesha's family and everyone affected by her loss.\"",
    "author": "newsdesk@birminghamlive.co.uk (James Rodger)",
    "url": "https://www.birminghammail.co.uk/news/midlands-news/alesha-macphails-killer-aaron-campbell-17372511",
    "published": "Thu, 5 Dec 2019 21:58:45 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}