{
    "data_id": "696",
    "id": "21stcenturywire--2019-11-17--Episode #302 – ‘American-Style Justice’ with guest George Szamuely, Andre Vltchek and more",
    "date": "11/17/2019",
    "source": "21stcenturywire",
    "title": "Episode #302 – ‘American-Style Justice’ with guest George Szamuely, Andre Vltchek and more",
    "content": "Episode #302 of SUNDAY WIRE SHOW resumes on Nov 17, 2019 with host Patrick Henningsen, broadcasting LIVE on the Alternate Current Radio Network (ACR)…\n\n5pm-8pm UK Time | 12pm-3pm ET (US) | 9am-12pm PT (US)\n\n \n\n This week the SUNDAY WIRE broadcasts LIVE on ACR with host Patrick Henningsen covering the top stories in the US, Europe and Internationally. This week we’ll look at the concept of “American-style justice” both at home and abroad, as we discuss last week’s US-backed coup in Bolivia, along with two momentous judicial circuses which took place in Washington over the weekend, the #UkraineGate Impeachment Hearings and the Show Trial of Roger Stone – both completely politicized exhibitions that would sure make even Uncle Joe Stalin wince. We’ll also be joined in he first hour by international intrepid correspondent Andre Vltchek who is on the ground in South America to give insight on the historic uprising in Chile, and more. In the second hour, we’ll also be joined by author and international political commentator, George Szamuely, to breakdown Washington’s Impeachment fiasco and why this just may be a real historic low for US politics, media and society in general. Later in the final hour, we’ll talk with SUNDAY WIRE roving correspondent for Culture & Sport, Basil Valentine, to talk about Epstein pal Prince Andrew’s BBC debacle, the increasingly macabre UK Election pantomime and more . All this and much more. Enjoy the show…\n\n*NOTE: THIS EPISODE MAY CONTAIN STRONG LANGUAGE AND MATURE THEMES*",
    "author": "21wire",
    "url": "https://21stcenturywire.com/2019/11/17/episode-302-american-style-justice-with-guest-george-szamuely-andre-vltchek/",
    "published": "Sun, 17 Nov 2019 14:42:34 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}