{
    "data_id": "699896",
    "id": "theguardianuk--2019-05-07--Pamela Anderson visits innocent man Julian Assange in prison",
    "date": "5/7/2019",
    "source": "theguardianuk",
    "title": "Pamela Anderson visits 'innocent man' Julian Assange in prison",
    "content": "Pamela Anderson has described Julian Assange as “the world’s most innocent man” and said a fight was on to “save his life”, after the actor and model visited the WikiLeaks founder at Belmarsh prison.\n\nShe was accompanied by the website’s editor-in-chief, Kristinn Hrafnsson, for what WikiLeaks described as Assange’s first social visit since he was arrested by police after Ecuador revoked the political asylum granted to him at the country’s London embassy.\n\nA struggle over a US request for Assange’s extradition is under way after he was jailed for just under a year for breaching bail conditions to avoid being extradited to Sweden. Assange took refuge in the Ecuadorian embassy in 2012 to avoid extradition over sexual assault allegations, which he denies.\n\n“He does not deserve to be in a supermax prison. He has never committed a violent act. He is an innocent person,” Anderson said outside the prison in south-east London, which is a maximum-security jail but holds a range of prisoners.\n\nAnderson said he was “really cut off from everybody” and had not been able to access the internet, use a library or speak to his children.\n\n“He is a good man, he is an incredible person. I love him, I can’t imagine what he has been going through,” said Anderson, who was wearing what appeared to be a cape covered with text that made references to prison, tyranny and Oliver Cromwell.\n\nShe tweeted a link to a Wikipedia page for John Lilburne, an English Leveller who was a friend of Cromwell but whose opposition to the policies of his regime led to his trial for sedition in 1649. She also tweeted a photograph of a handwritten letter that appeared to have been signed by her and another celebrity supporter of Assange, the fashion designer Vivienne Westwood.\n\n“We need to save his life. That is how serious it is,” Anderson said.\n\nHrafnsson, who last week criticised “austerity and cutbacks” in the prison system and said Assange usually spends 23 hours a day in his cell, added: “He has lost weight but his spirit is strong and that is the most important thing.”\n\nDuring a court appearance last Thursday, Assange declined a chance to consent to his extradition to the US in a hearing at Westminster magistrates court, where lawyers for Washington began pressing the case to take him across the Atlantic. Ben Brandon, the counsel for the US government, said the charges related to one of the largest compromises of information in US history.\n\nSwedish prosecutors have said they are considering reopening the investigation into rape and sexual assault allegations against Assange.",
    "author": "Ben Quinn",
    "url": "https://www.theguardian.com/media/2019/may/07/pamela-anderson-visits-innocent-man-julian-assange-in-prison",
    "published": "2019-05-07 13:28:49+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}