{
    "data_id": "7038",
    "id": "ageofautism--2019-04-12--Physician Father and Caretaker of 29 Year Old Autistic Man Found Brutally Murdered",
    "date": "4/12/2019",
    "source": "ageofautism",
    "title": "Physician, Father and Caretaker of 29 Year Old Autistic Man Found Brutally Murdered",
    "content": "\"One family member said Derek “can be violent and has attacked Rex in the past,” court documents stated. The family member also said Derek’s mother had died years ago and Rex was taking care of him alone.\" \n\n\n\nThis grisly story offers another side to the shiny, happy portrayal of autism during the month of April. A Spokane, Washington widowed physician, age 61, was found brutally murdered and his 29 year old, preverbal autistic son living amid squalor. It appears that the son is at least, a suspect. If not, he is also a victim, left alone in the home without life skills.  Either version is a far cry from what we're spoon fed about autism. This kind of tragic story is going to repeat itself over and over, like the stories of autistic children wandering and drowning. Parents will age. Strong adult men (and women) with autism will rage. The future may be bleak and harsh. Meanwhile, we're told we are \"allowed\" to seek awareness, but not cure or even true treatment. Our loved ones must suffer a lifetime of... autism.  God bless Dr. Rex Porter and his son Derek. \n\n\n\n###\n\n\n\n\n\nDetectives are investigating the death of a retired Spokane anesthesiologist whose body was found dismembered and burned in the backyard of his Dishman Hills area home.\n\nThe victim, Dr. Rex C. Porter, 61, previously worked for Providence Sacred Heart Medical Center. He was the caretaker of his son, Derek C. Porter, 29, who is autistic and nonverbal, according to court documents. They lived on an 11-acre property in the 2800 block of South Park Lane near the Iller Creek Conservation Area.\n\nOn Saturday, a neighbor called 911 to report that Porter’s car had been sitting in the driveway for two days with a door open. A garage door had been left open, too.\n\nSpokane County Sheriff’s deputies responded Sunday to the house for a welfare check, according to a search warrant filed Tuesday in Spokane County Superior Court.\n\nDeputies reported seeing the house in disarray as they looked through the windows, including broken glass on the floor. Attempts to call Rex Porter were unsuccessful, prompting deputies to enter the house. They smelled a strong odor they believed to be animal feces, according to court documents.\n\nDeputies continued their search downstairs to the basement and found more glass, along with blood and damaged items. They opened a door and “suddenly an adult male was standing in front of them with only shorts and a T-shirt,” according to court documents.\n\nDeputies detained the individual, believing he was squatting in the house, according to court records.\n\nIn the bathroom, the toilet was full of feces and the sink held what deputies thought was the remains of a dead animal, court records stated....  Read more at Spokesman.com",
    "author": "Age of Autism",
    "url": "http://feedproxy.google.com/~r/ageofautism/~3/zc44EG7xWFM/physician-father-and-caretaker-of-29-year-old-autistic-man-found-brutally-murdered.html",
    "published": "2019-04-12 09:00:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}