{
    "data_id": "70460",
    "id": "breaking911--2019-10-07--FBI Confirms Samuel Little Is The Most Prolific Serial Killer In U.S. History",
    "date": "10/7/2019",
    "source": "breaking911",
    "title": "FBI Confirms Samuel Little Is The Most Prolific Serial Killer In U.S. History",
    "content": "The FBI confirms that Samuel Little, 79, is the most prolific serial killer in U.S. history. To date, Little has confessed to 93 murders. The FBI’s Violent Criminal Apprehension Program (ViCAP) can also confirm that Little has been matched to 50 cases, with many more pending final confirmation.\n\nIn 2012, Little was arrested and extradited to California on a narcotics charge. Los Angeles Police Department (LAPD) obtained DNA that connected Little to three unsolved homicides that occurred in 1987 and 1989. In 2013, the LAPD notified ViCAP, which initiated a full background investigation and found an alarming pattern that linked Little to many more murders. Little was charged with three counts of murder and ultimately convicted and sentenced in 2014 to three consecutive life terms without parole.\n\nIn May 2018, the Texas Rangers and the FBI were able to obtain detailed information on additional murders across the country that Little voluntarily provided.\n\nLittle says he strangled his 93 victims between 1970 and 2005. Many of his victims’ deaths, however, were originally ruled overdoses or attributed to accidental or undetermined causes. Some bodies were never found.\n\n“The FBI is grateful for the Texas Rangers and state and local law enforcement partners who have worked diligently to confirm these cases,” said John Selleck, assistant director of the FBI’s Critical Incident Response Group. “Strong cooperation and information sharing between the FBI and its partners resulted in successful connections to Little’s crimes, ultimately bringing him to justice and helping victims’ families through the closure process.”",
    "author": "----",
    "url": "https://breaking911.com/breaking-fbi-confirms-samuel-little-is-the-most-prolific-serial-killer-in-u-s-history/",
    "published": "Mon, 07 Oct 2019 18:33:59 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}