{
    "data_id": "70705",
    "id": "breaking911--2019-11-24--14-Year-Old Killer Charged As Adult In ‘Brutal’ Slaying Of Susan Spiller",
    "date": "11/24/2019",
    "source": "breaking911",
    "title": "14-Year-Old Killer Charged As Adult In ‘Brutal’ Slaying Of Susan Spiller",
    "content": "MINNESOTA — Adult criminal murder charges were filed against a teenager after a Hennepin County District Court judge ordered he should be tried as an adult, even though he was just 14 at the time of the murder.\n\nDemetrius Wynne, who will turn 19 on Thursday, was charged with second-degree murder with intent and second-degree murder while committing a felony (burglary) in the July 2015 death of 68-year-old Susan Spiller in her home at 5120 Dupont Ave. N. He is expected to make his first court appearance on the adult charges Thursday.\n\nWynne was arrested and charged by juvenile petition in the murder on June 21, 2019. However, nearly all information, including Wynne’s identity, was not public because he was a juvenile at the time of the murder and would continue to be treated as one even though he was 18 at the time of his arrest.\n\nThe Hennepin County Attorney’s Office immediately filed a petition to have Wynne certified as an adult. Closed juvenile court hearings were held before Hennepin County District Court Judge Tanya Bransford on Sept. 18 and Oct. 22 with final written comments submitted by Oct. 29. She ruled in favor of adult certification Tuesday, noting that his age precluded him from being treated as a juvenile and even Extended Juvenile Jurisdiction would only keep him on probation for two years.\n\n“We appreciate Judge Bransford’s decision and believe it is the correct one to protect public safety,” Freeman said. “This was a home burglary and brutal killing and by no stretch of the imagination would two years be sufficient for either punishment or rehabilitation. Now we will focus on proving Mr. Wynne guilty beyond a reasonable doubt.”\n\nAccording to the new adult criminal complaint, Wynne and his family lived next door to Spiller at 5116 Dupont Ave. N. Sometime in the evening of July 15-16, 2015, someone cut the screen to a rear window of Spiller’s home and removed it to gain entry into the house. Spiller was found in her bedroom where she had been beaten, strangled and stabbed five times. Her cell phone was missing.\n\nThe break in the case came on June 12, 2019 when Wynne was booked and fingerprinted on an adult felony case, which is pending. Two days later, the computer matched his booking fingerprints to prints taken from the rear window of Spiller’s home, the complaint states. In addition, a DNA profile from a fingernail clipping from Spiller’s right hand has been connected to Wynne.\n\nFOX 9 reported after her killing that Spiller had spoke at a community meeting, saying she feared retaliation after reporting neighborhood problems such as noise complaints.",
    "author": "----",
    "url": "https://breaking911.com/14-year-old-killer-charged-as-adult-in-brutal-slaying-of-susan-spiller/",
    "published": "Sun, 24 Nov 2019 19:25:56 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}