{
    "data_id": "70734",
    "id": "breaking911--2019-11-27--Cop Convicted of Excessive Force After Innocent Man Was Kicked Into Critical Condition While Being B",
    "date": "11/27/2019",
    "source": "breaking911",
    "title": "Cop Convicted of Excessive Force After Innocent Man Was Kicked Into Critical Condition While Being Bit By K9",
    "content": "Today, a federal jury convicted Brett Palkowitsch, 32, an officer with the St. Paul Police Department, of using excessive force against an unarmed civilian.\n\n“The behavior of the defendant will not be tolerated and the Department of Justice will seek to prosecute those who abuse their power,” said Assistant Attorney General Eric Dreiband for the Civil Rights Division. “We commend the officers who came forward and brought about the opening of the investigation. We also thank our law enforcement partners who assisted in this case.”\n\n“Law enforcement officers receive certain powers from the government so they can protect the rights of the citizens they serve,” said FBI Minneapolis Special Agent in Charge, Jill Sanborn. “When an individual officer’s actions violate that trust, he or she should be held accountable which the jury confirmed with today’s verdict. We thank all those who assisted on this case,” Sanborn added.\n\nThe evidence presented at trial established that the Defendant and other officers responded to a 911 call alleging that an unidentified black male with dreadlocks and a white t-shirt had been involved in a street fight and was carrying a gun. Upon their arrival on scene, officers found no evidence of any street fight, but they noticed one man who matched that general description, sitting in his car talking on a cellphone. One of the responding officers, along with his police K-9, approached the man’s car and, without identifying himself as a police officer, yelled at the man to get out. The man, later identified as Frank Baker, got out of the car, as the officer yelled commands and the police K-9 barked loudly at him. Seven seconds later, the officer released the K-9, which took Mr. Baker to the ground and began mauling his leg. While Baker was on the ground, screaming in pain, the Defendant arrived and kicked Baker three times in the ribs. The defendant’s kicks broke seven of Baker’s ribs and caused both of his lungs to collapse, putting him in critical condition. Officers found no gun at the scene and no evidence that Baker, a 52-year-old grandfather who lived in the neighborhood, had been involved in any fight.\n\nTwo of the officers who witnessed the defendant’s actions that night, Officers Joseph Dick and Anthony Spencer, reported the Defendant to their supervisor. Dick and Spencer both testified for the government at trial, about the defendant’s use of force and about harassment and retaliation they suffered after stepping forward to report a fellow officer. Dick, Spencer, and a third officer from the scene told the jury that they saw no legitimate reason for the defendant’s kicks. Additionally, officers testified that the defendant boasted afterward about having kicked Baker.\n\nFollowing more than two weeks of trial, the jury in the U.S. District Court in St. Paul, MN, deliberated for 11 hours before finding the Defendant guilty of using excessive force.\n\nThe Defendant faces a maximum sentence of 10 years in federal prison. A sentencing hearing will be scheduled after the completion of a presentence investigation by the United States Probation Office.",
    "author": "----",
    "url": "https://breaking911.com/cop-convicted-of-excessive-force-after-man-was-kicked-into-critical-condition-while-being-bit-by-k9/",
    "published": "Wed, 27 Nov 2019 03:24:05 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}