{
    "data_id": "71919",
    "id": "breitbart--2019-08-20--Warren Emphasizes LGBT Protections in Criminal Justice Reform Plan",
    "date": "8/20/2019",
    "source": "breitbart",
    "title": "Warren Emphasizes LGBT Protections in Criminal Justice Reform Plan",
    "content": "She echoed many of Sen. Bernie Sanders’ (I-VT) ideas, like ending cash bail, legalizing marijuana, eliminating private prisons, reducing the prisoner population, and implementing implicit bias training for officers. She also went squarely for Joe Biden’s (D) 1994 crime bill, calling for its repeal.\n\n“The 1994 crime bill exacerbated incarceration rates in this country, punishing people more severely for even minor infractions, and limiting discretion in charging and sentencing in our judicial system,” she wrote, calling the “tough on crime” approach “wrong.”\n\n“That punitive ‘tough on crime’ approach was wrong, it was a mistake, and it needs to be repealed,” she continued. “There are some sections of law, like those relating to domestic violence, that should be retained — but the bulk of the law must go.”\n\nUnlike Sanders’ plan, however, Warren placed a significant emphasis on LGBT Americans, calling for the U.S. to “tackle” the problems within our criminal justice system by looking at the roots.\n\n“That means implementing a set of bold, structural changes at all levels of government. And it starts by reimagining how we talk and think about public safety,” she wrote, using LGBTQ+ Americans as a key example:\n\n“It should mean policies that recognize the humanity of trans people and other LGBTQ+ Americans and keep them safe from violence,” she wrote, later echoing Sanders’ call to “stop criminalizing homelessness,” which she says “disproportionately impact communities of color, LGBTQ+ people, and people with disabilities”:\n\nHousing provides safety and stability, but too many experience homelessness. To make matters worse, many cities have criminalized homelessness by banning behavior associated with it, like sleeping in public or living in vehicles. These laws draw people into the justice system instead of giving them access to the services they need. They disproportionately impact communities of color, LGBTQ+ people, and people with disabilities, all of whom experience higher rates of homelessness. Rather than treating the homeless like criminals, we should get them with the resources they need to get back on their feet.\n\nWarren also devoted an entire section to protecting “special populations,” including LGBTQ+ individuals.\n\n“Vulnerable individuals like pregnant women, victims of domestic violence, people with disabilities, and LGBTQ+ individuals often require special protections while behind bars,” she wrote.\n\n“I’ll implement a rigorous auditing program to ensure that prisons are adhering to legal requirements to protect LGBTQ+ individuals and others from sexual violence and assault while incarcerated, and prosecute prison staff who engage in misconduct,” she added.\n\nUltimately, Warren calls for more “preventative” approaches to criminal justice reform, with a heavy emphasis on “reforming police behavior” and “demilitarizing” law enforcement in order to gain public trust:\n\nMilitarizing our police contributes to mutual fear and distrust, and there is evidence to suggest it can actually make officers themselves less safe. As President, I will eliminate the transfer of military-grade weapons and lethal equipment to local police via the 1033 program, prohibit local law enforcement from buying military equipment with federal funding, and create a buy-back program for equipment already in use in our communities.\n\n“Our system is the result of choices we’ve made—choices that together stack the deck against the poor and the disadvantaged,” Warren wrote in a tweet Tuesday.\n\n “We can create real law and order and real justice in our country by making long overdue big, structural change,” she added:",
    "author": "Hannah Bleau",
    "url": "http://feedproxy.google.com/~r/breitbart/~3/_i5NI_nvFsQ/",
    "published": "2019-08-20 15:16:36+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}