{
    "data_id": "72041",
    "id": "breitbart--2019-08-22--Florida Serial Killer Who Targeted Gay Men to Be Executed",
    "date": "8/22/2019",
    "source": "breitbart",
    "title": "Florida Serial Killer Who Targeted Gay Men to Be Executed",
    "content": "Gary Ray Bowles, 57, is scheduled to receive a lethal injection Thursday evening at Florida State Prison in Stark, Florida, the Associated Press reported.\n\nFlorida Today reported that Bowles was sentenced to death row in 1996 for murdering six men he met on a trip up and down the East Coast between March and November 1994.\n\nBecause he picked up most of his victims in gay bars between Daytona Beach, Florida, and Maryland, he earned himself the nickname “the I-95 killer.”\n\nHe often offered his victims money or sex before strangling them to their deaths, taking their identification and credit cards. Bowles was featured on America’s Most Wanted on five different occasions and made the FBI’s most wanted list in 1994, shortly before detectives questioned him on his last murder, Walter Hinton.\n\nBowles was raised in abusive household, causing him to leave home at 14 and earn his keep by working as a prostitute, letting gay men perform sex acts on him in exchange for money.\n\nDespite his violence towards gay men, Bowles has said he is straight. He also had a history of violence against women.\n\nIn 1982, Bowles was convicted of brutally beating and sexually assaulting his girlfriend in Tampa. He served less than three years for that crime. She suffered severe injuries from his beatings.\n\nAfter a second prison stint for robbery and grand theft, Bowles went back to working as a prostitute in Daytona Beach and moved in with another girlfriend. The relationship faltered when she found out he was a sex worker, the Daytona Beach News-Journal reported.\n\nBowles later told the police he blamed gay men for his breakup, and that was why he targeted gay men for his killing sprees.\n\nPolice caught Bowles in Jacksonville in November 1994 several days after he murdered his sixth victim, Walter Jamelle Hinton, the Washington Post reported.\n\nIn his confession to police, Bowles said he murdered six men in four states and dropped a concrete block on Hinton’s head while he slept. Bowles pleaded guilty to murder in court and received the death penalty in 1996. The Florida Supreme Court reversed the death penalty in 1999, due to improper handling of his case.\n\nBowles was re-sentenced to death in a court hearing that same year. Florida Gov. Ron DeSantis signed a warrant for Bowles’ death sentence on June 11.\n\nBarring a stay of execution by Florida’s Supreme Court, Bowles will die by lethal injection Thursday evening.",
    "author": "Katherine Rodriguez",
    "url": "http://feedproxy.google.com/~r/breitbart/~3/_LmIZEoKNMg/",
    "published": "2019-08-22 19:40:49+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}