{
    "data_id": "721185",
    "id": "thehill--2019-03-29--Two black men wrongfully convicted of murder freed after 43 years",
    "date": "3/29/2019",
    "source": "thehill",
    "title": "Two black men wrongfully convicted of murder freed after 43 years",
    "content": "Two black men who were wrongfully convicted of murder in Florida were freed earlier this week after serving more than 40 years behind bars.\n\nClifford Williams Jr. was 34 years old and his nephew, Hubert Nathan Myers, was just 18 when they were arrested in May 1976 after the shooting of two women, CNN reports.\n\nThe two were reportedly at a party in Jacksonville when the two women were shot, one fatally, in an apartment nearby. But they were quickly arrested, wrongfully convicted and subsequently handed life sentences after just a two-day trial at the time.\n\nIt wasn’t until Thursday that Williams, who is now 76, and Myers, 61, had their convictions vacated.\n\n\"I'm nervous because I feel like I'm still locked up,\" Williams told CNN Thursday. \"Once I get with my family and know I can look back ... and the reality hits in, I think I'll be all right.\"\n\nThe news comes after a review of the men’s case under the Conviction Integrity Review (CIR) division of the State’s Attorney’s Office in Florida found that the state “no longer has confidence in the integrity of the convictions or guilt of the accused,” a report on the state's investigation seen by ABC News read.\n\nThe two men reportedly filed multiple motions for \"postconviction relief” that would eventually fail before they began to see a change of luck after petitioning the CIR unit in 2017.\n\nAmong the findings from their work with the unit, officials also reportedly discovered another man, Nathaniel Lawson, had confessed to the 1976 shooting years after Williams and Myers were convicted for it.\n\nThe comprehensive review of the case would later lead to the state throwing out Williams's and Myers’s convictions and setting them free.\n\nAccording to The Florida Times-Union, Myers will be eligible for compensation from the state for his wrongful imprisonment but Williams will not due to his past criminal record prior to the wrongful conviction.",
    "author": "Aris Folley",
    "url": "https://thehill.com/blogs/blog-briefing-room/news/436493-two-black-men-wrongfully-convicted-of-murder-freed-after-43",
    "published": "2019-03-29 19:04:19+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}