{
    "data_id": "726817",
    "id": "thehuffingtonpost--2019-05-04--Wells Fargo Botched A Fraud Inquiry An Innocent Man Landed In Court",
    "date": "5/4/2019",
    "source": "thehuffingtonpost",
    "title": "Wells Fargo Botched A Fraud Inquiry. An Innocent Man Landed In Court.",
    "content": "Over the past two and a half years, Wells Fargo has admitted to mistakenly foreclosing on hundreds of families, illegally repossessing more than 27,000 cars and fraudulently opening over 3 million accounts for people who never asked for them. The bank has undertaken at least four separate marketing campaigns aimed at improving its dreadful corporate image, issuing official apology after official apology for its litany of abuses. It has rolled out a new logo and a new brand tagline, and replaced its CEO twice since the fake account scandal started to make headlines.\n\nFor Edwards, the madness began in April 2018, when the New Jersey Turnpike Authority noticed a problem with several checks the agency had written. Somehow the checks were being deposited not once but twice, with different dollar amounts each time. The immediate suspicion was check forgery ― someone, it seemed, had copied a stack of legitimate checks from the agency, scanned in a new name and new dollar amounts, and deposited the forgeries at a Wells Fargo branch in Parsippany.\n\nThe police decided not to charge Mathis, concluding she was a victim of the scheme, rather than a culprit. It’s common, in fact, for scammers to talk people into depositing checks on their behalf. Banks make money available to their customers immediately after a check is deposited, and it can take a few days for the transaction to be flagged as fraudulent. When that happens, whoever received the bogus funds has to pay everything back in full ― even if they’ve already handed over some of the money over to someone else, like the mysterious Cousin Swing.\n\nNone of this should have been a problem for Edwards. He’d never met Mathis or Cousin Swing. But he had deposited four checks of his own on April 16, at the same Wells Fargo branch where Cousin Swing deposited the forgeries. And Wells Fargo seems to have screwed up the surveillance evidence it provided to the police, handing them images from the bank’s ATM of Edwards depositing his checks. Edwards didn’t fit the description Mathis had given police of Cousin Swing ― but police trusted the bank to have its records straight. Neither Wells Fargo nor the New Jersey State Police would comment for this story, citing ongoing litigation.\n\nEdwards had been going to the same bank branch for nearly three decades, remaining a customer as new corporate owners took over his account via a series of mergers. The bank became a Wells Fargo in 2008, when Wells took over the remains of Wachovia, which failed during the financial crisis. The church even kept its official accounts there. So Edwards knew there were bank records that would show that his deposits on April 16 were ordinary, legal transactions. He reached out to the police, sending Detective William Condron his bank statement and copies of the legitimate checks he’d deposited, explaining there had been a mistake.\n\nCondron was skeptical, but he went back to Wells Fargo and asked the bank to make sure Edwards was the right guy. This should have been a red flag for both the bank and the police. Check fraud isn’t a super-sophisticated crime, but usually the perpetrators are smart enough to avoid using their own local bank. If the bank catches you engaging in fraud on camera, there’s a decent chance they’ll recognize you whenever you come back in. It was extremely unlikely that the person running the fraud scheme was a long-term customer who just happened to start sprinkling bogus checks in with his regular banking activity.\n\nEdwards didn’t hear back from the police for a while. A little over a week after he first reached out to them, he called Condron again to follow up. Edwards says Condron told him he was getting bounced “from department to department” by the bank. He was dealing with people deep in the Wells Fargo bureaucracy ― the subpoena compliance team and someone from a “research unit,” at least one of whom, the detective said, was in Arizona.\n\nSo Edwards went down to his local branch, hoping to put everything to rest with the bank itself. The branch manager had never heard of his case, but promised to bring it up with her bosses. When he checked back a few days later, Edwards was told it was now in the hands of the bank’s “resolutions” team ― at least the third internal department at Wells Fargo to touch the debacle.\n\nEdwards didn’t learn about the other photograph and the other forged check until months later, when his case went to trial. On Sept. 4, the police called Edwards and asked him to come down to their headquarters ― more than an hour’s drive from where he lived ― to clear everything up. When Edwards arrived the next day, he was taken to an interrogation room and berated. Police showed him the ATM photos with the forged check numbers scrawled across them, saying these images proved he was guilty of a crime. He’d better confess if he knew what was good for him.",
    "author": "",
    "url": "https://www.huffpost.com/entry/wells-fargo-customer-fraud_n_5ccb2153e4b0d123955021ce",
    "published": "2019-05-04 12:00:19+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}