{
    "data_id": "744392",
    "id": "theindependent--2019-01-31--Innocent people caught up in serious police investigations due to data-handling errors watchdog fin",
    "date": "1/31/2019",
    "source": "theindependent",
    "title": "Innocent people caught up in serious police investigations due to data-handling errors, watchdog finds",
    "content": "Innocent people were wrongly caught up in serious police investigations such as child pornography and paedophile grooming because of data-handling errors, a watchdog found.\n\nThe failures led to homes being searched, equipment seized, and people being arrested for crimes they had nothing to do with.\n\nIn its first annual report, the Investigatory Powers Commissioner’s Office (IPCO) said it carried out 33 “serious error investigations” in 2017 – 24 of which were deemed to be serious errors.\n\nIn many cases they were caused by the submission of an incorrect phone number or IP address – sometimes by just one digit.\n\nThey resulted in 11 cases, affecting 19 individuals, where innocent people were interviewed or arrested by police.\n\nIn seven cases, affecting 10 people, police visited the home or work address of an individual with “no sustainable link” with an investigation.\n\nFifteen of the investigations related to unspecified “public authorities” and the rest to internet or communications service providers.\n\n“Errors in this context can have grave consequences for the victims of the mistake, together with his or her family and friends,” the report said. \"This is particularly evident when home or offices are searched and the nature of the investigation is revealed to members of the individual’s family, and his or her neighbours or employer.\n\n“Children are at risk of being taken into care and individuals in notifiable, and other, occupations may be suspended or dismissed. Strict bail conditions can result in a suspect having to leave his or her home.”\n\nOverall, the IPCO, which has taken over the work of three predecessor bodies, found that while the number of serious cases was broadly the same as the previous year, the total number of errors reported was down from 1,200 to 926.\n\nIt said that it was unable to say with “absolute confidence” that the fall was significant, and that it was “in all probability a positive development”.\n\nThe Investigatory Powers Commissioner Lord Justice Sir Adrian Fulford expressed concern that the IPCO’s inspectorate and “numerically small” legal and policy team may have been “insufficiently resourced” to carry out the functions assigned to it.",
    "author": "Chiara Giordano",
    "url": "http://www.independent.co.uk/news/uk/home-news/police-errors-watchdog-data-wrongful-arrest-child-pornography-paedophile-grooming-a8757346.html",
    "published": "2019-01-31 20:26:03+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}