{
    "data_id": "749211",
    "id": "theindependent--2019-02-25--California man freed after wrongly imprisoned for 40 years wins 21m settlement",
    "date": "2/25/2019",
    "source": "theindependent",
    "title": "California man freed after wrongly imprisoned for 40 years wins $21m settlement",
    "content": "A man wrongly convicted and imprisoned for nearly 40 years in the killing of his girlfriend and her four-year-old son reached a $21m (£16m) settlement with the city of Simi Valley, California over the weekend.\n\nCraig Coley, 71, was released from prison in 2017 after DNA evidence and another investigation proved the man’s innocence. Then-Governor Jerry Brown pardoned Mr Coley.\n\nThe large-sum settlement agreement will also cover the arduous, costly and unneeded legal proceedings, Simi Valley officials told the Los Angeles Times.\n\n“While no amount of money can make up for what happened to Mr Coley, settling this case is the right thing to do for Mr. Coley and our community,” city manager Eric Levitt said in a statement.\n\nSimi Valley will be paying $4.9m (£3.75m) whereas the rest of the settlement will be paid out by insurance and other revenue sources.\n\nLast year, the state approved a separate $2m payment for Mr Coley.\n\nThe 71-year-old spent 39 years in prison after he was wrongly convicted of killing Rhonda Wicht, 24, and her toddler son in 1978.\n\nSimi Valley’s police chief and Ventura County’s district attorney requested the then-governor Mr Brown to pardon Mr Coley following results from forensic tests proving that his DNA was not on the victim’s bed sheet.\n\nThe contained DNA came from an unknown man.\n\nMr Coley had an alibi for the time of the killing. Investigators disproved eyewitness testimonies that placed him at the scene of the slayings.\n\nHis parents died while he was still behind bars. They mortgaged their home to pay for his legal bills.\n\nRon Kaye, Mr Coley’s attorney, said the settlement offers only a little bit of closure and vindication for his client. He added that no amount of money could pay back the time and life he missed while being falsely imprisoned.\n\n“He now can live the rest of his life, which we hope will be really well into the future, with the security he deserves,” Mr Kaye told the Associated Press.\n\nAfter Mr Coley was pardoned, the judge declared him “factually innocent.” There has been no other arrests made in the killings.\n\nWe’ll tell you what’s true. You can form your own view.\n\nAt The Independent, no one tells us what to write. That’s why, in an era of political lies and Brexit bias, more readers are turning to an independent source. Subscribe from just 15p a day for extra exclusives, events and ebooks – all with no ads.",
    "author": "Sarah Harvard",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/california-man-wrongly-imprisoned-for-40-years-wins-21m-settlement-a8796296.html",
    "published": "2019-02-25 16:31:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}