{
    "data_id": "75527",
    "id": "breitbart--2019-11-11--Killers, Other Felons Arrested Sneaking Across Southwest Border",
    "date": "11/11/2019",
    "source": "breitbart",
    "title": "Killers, Other Felons Arrested Sneaking Across Southwest Border",
    "content": "Border Patrol agents and U.S. Customs and Border Protection officers arrested multiple felons, including a convicted killer, attempting to cross the southwest border from Mexico.\n\nEl Paso Sector agents assigned to the Ysleta Border Patrol Station arrested Miguel Marines-Patino, a Mexican national, after he illegally crossed the border south of the Padres Overpass on November 7. The agents observed the man illegally crossing the border about two miles west of the Ysleta Port of Entry, according to information obtained from El Paso Sector Border Patrol officials.\n\nThe agents arrested the man and transported him to the Ysleta Station for processing, including a biometric background investigation. During the investigation the agents uncovered and immigration and criminal history, officials stated. A court in Chicago convicted Marines-Patino in 1986 on a charge of murder. The court sentenced the Mexican migrant to 24 years in state prison. Immigration officers twice removed the migrant, most recently in March 2016.\n\n“Federal authorities in El Paso filed a federal criminal complaint this morning charging Marines-Patino with illegal re-entry after deportation,” El Paso Sector officials stated. “Upon conviction, Marines-Patino faces up to 20 years in federal prison.”\n\n“Every day, criminal aliens attempt to illegally enter the United States, often concealing themselves among family units or taking advantage of the current crisis,” officials stated. “The men and women of the U.S. Border Patrol are our first line of defense in stopping these criminals before they can wreak havoc in communities all over our country.”\n\nElsewhere on the border, San Diego CBP officers arrested four felons in three days as they attempted to enter the U.S. from Mexico.\n\nOn November 6, officers assigned to the Otay Mesa pedestrian facility observed a woman approaching for inspection from Mexico. Officers identified her as Roxana Salazar, a 26-year-old U.S. citizen. A database check revealed the woman is wanted by the San Bernadino Sheriff’s Department to face a charge of murder. The warrant carries a bond of $1 million, officials stated.\n\nTwo days earlier, CBP officers assigned to the San Ysidro PedWest facility apprehended another U.S. citizen wanted for murder in Los Angeles, San Diego CBP officials stated. The man attempted to cross the border on November 4. Officers check the man’s identity against the database and uncovered the active warrants for charges of murder and attempted murder, officials stated. Deputies turned Joey Alvarado, 32, over to U.S. Marshals for transportation to the San Diego Central Jail.\n\nOfficers assigned to the San Ysidro PedWest facility arrested the two men wanted for escaping from the jail located in Salinas, California. The two men, 21-year-old Santos Fonesca and 20-year-old Jonathan Salazar, both U.S. citizens, presented themselves for inspection by CBP officers. The officers ran a background check and found the warrants from the Monterrey County Sheriff’s Department for jail escaped.\n\n“We would like to thank the CBP for their partnership and assistance in taking these two violent and dangerous people safely into custody,” said John Thornburg, Captain with the Monterrey County Sheriff’s Office in a written statement.",
    "author": "Bob Price",
    "url": "http://feedproxy.google.com/~r/breitbart/~3/3sNwg6-YcS0/",
    "published": "Mon, 11 Nov 2019 16:23:18 +0000",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}