{
    "data_id": "764577",
    "id": "theindependent--2019-07-01--Man freed after 17 years in prison when newly examined fingerprints prove his innocence",
    "date": "7/1/2019",
    "source": "theindependent",
    "title": "Man freed after 17 years in prison when newly examined fingerprints prove his innocence",
    "content": "A man who spent 17 years behind bars for an armed robbery he did not commit has finally been freed after new fingerprint evidence proved his innocence.\n\nRoyal Clark Jr walked out of a Louisiana jail last week the day after his 41st birthday. He was convicted of the crime on his 25th birthday, back in 2002.\n\n\"I don't know what to say,\" a tearful Mr Clark told reporters and crowds of well-wishers.\n\nThere were times he had abandoned any hope he might be released from his 49-year sentence, he admitted.\n\n“I'm not going to sit here and lie and tell you I didn't,\" he said, when asked if he given up. “[But] I can't let anger direct me. I can't let my past be my future.\"\n\nMr Clark was arrested after an armed robbery at a Burger King in 2001. The only evidence against him was an employee of the restaurant, who incorrectly identified Mr Clark as the robber.\n\nBut a team of lawyers at the Innocence Project New Orleans pressed the courts to re-examine fingerprints found at the scene, which when run through a state database proved to belong to another man, Jessie Perry, who had already been convicted of other robberies.\n\n\"As district attorney, my obligation to seek justice does not end upon conviction,\" the local district attorney Paul Connick said in a statement.\n\n\"When the evidence reveals an individual was wrongfully convicted, my office will take action to correct that injustice.\"\n\nOutside the jail Mr Clark’s son, also called Royal, spoke about the absence of his father from his life.\n\nRoyal Clark III was only a baby when his father was locked up. “My mama couldn't always be there for me. She had to work,\" he said, his father's arm draped over his shoulder.\n\nTears streamed down his father's face. \"He was supposed to be there to teach me.\"\n\nKia Hall Hayes, from the Innocence Project, said the miscarriage of justice showed how unreliable eyewitness testimony could be.\n\n“His case serves as another example of the unreliability of eyewitness identification evidence, the importance of judges allowing juries all the tools they need to assess the evidence accurately, and the danger of relying exclusively on such evidence to take away someone’s liberty,” she said.\n\nMr Clark is the second person to be exonerated in Louisiana based on fingerprint evidence this year.\n\nIn March, Archie Williams was freed after serving 36 years for a rape once the authorities had finally agreed to run fingerprint evidence through an updated state database.\n\nThe Innocence Project said the state should now create a legal right for prisoners to access such databases where it could clear their names.\n\nBut in Mr Clark’s case, the Jefferson Parish Sheriff’s Office said they were only able to re-test the fingerprint evidence from the Burger King holdup because of new techniques, which were not available back in 2002.",
    "author": "Tim Wyatt",
    "url": "https://www.independent.co.uk/news/world/americas/royal-clark-jr-freed-innocent-jail-exonerated-armed-robbery-louisiana-fingerprints-a8982246.html",
    "published": "2019-07-01 10:04:00+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}