{
    "data_id": "769541",
    "id": "theindependent--2019-08-25--Innocent man jailed for 82 days and loses jobs for bringing three jars of honey back to US",
    "date": "8/25/2019",
    "source": "theindependent",
    "title": "Innocent man jailed for 82 days and loses jobs for bringing three jars of honey back to US",
    "content": "Which is why during his Christmas visit to relatives in Jamaica, he made his regular stop and bought three bottles from a favourite roadside stand before heading home to Maryland.\n\nIt was a routine purchase for him until he landed at the airport in Baltimore.\n\nUS customs officers detained Mr Haughton and police arrested him, accusing him of smuggling in not honey, but liquid methamphetamine.\n\nMr Haughton spent nearly three months in jail before all charges were dropped and two rounds of law enforcement lab tests showed no controlled substances in the bottles.\n\nBy then, Mr Haughton, who according to his lawyer had no criminal record, had lost both of his jobs as a cleaner and a construction worker.\n\n“They messed up my life,” Mr Haughton said. “I want the world to know that the system is not right. If I didn’t have strong people around me, they would probably leave me in jail. You’re lost in the system.”\n\nMonths after his release, he is only now fully rebuilding his life after the setback devastated him and his family of six children.\n\nMr Haughton’s status as a legal permanent resident with a green card complicated his case.\n\nBecause he was arrested at an airport for alleged drug felonies, his case triggered a federal detention order that extended his time in jail, court testimony shows.\n\nTwenty days after his arrest, a state police lab test looking for drugs in the bottles came up negative.\n\nYet the 45-year-old father sat behind bars for two more months before the last of the charges were dropped after a second all-clear in a federal lab test.\n\n“Someone dropped the ball somewhere,” Mr Haughton’s lawyer Terry Morris said. “An innocent man spent 82 days in jail for bringing honey into the United States.”\n\nAfter landing at Baltimore-Washington International Thurgood Marshall Airport on 29 December at around 10pm, US Customs and Border Protection detained Mr Haughton for more than two hours before Maryland Transportation Authority Police put him in handcuffs, according to charging documents.\n\nThe bottles with gold-coloured screw tops labelled “honey” in his bag, they told him, had tested positive in a drug field test for methamphetamine.\n\nMr Haughton fainted. Police took him to a hospital. Then they took him to jail.\n\nEvery year for the nearly 10 years since Mr Haughton has been living in Prince George’s County, the native of Jamaica travels to the island in December to visit his mother.\n\nThe green card holder never had any problem returning to Maryland until last year, when a police dog unit started sniffing around his bag.\n\nMr Haughton thought the dog was interested in his leftover chicken. But Mr Haughton said he quickly noticed agents and officers whispering to one another before disappearing behind a screen. When they returned, a man took Mr Haughton away. His bag didn’t come with him.\n\nPolice in charging documents said a dog named Beny conducted a “random scan” and alerted to possible drugs.\n\n“Inside the bag were three large plastic bottles labelled as ‘honey’ of suspected liquid methamphetamine,” charging documents said.\n\nMr Haughton and Mr Morris contend he was stereotyped because of his race. Authorities, Mr Haughton’s lawyer said, questioned him about “a big Jamaican gang and drug-dealing conspiracy”.\n\n“I’m 100 per cent sure I don’t have drugs,” Mr Haughton recalled telling the agents. “I only have honey.”\n\nMr Haughton had given up sugar years ago but drinks honey with his tea.\n\nHe prefers honey from a particular bee farm in Jamaica because it is cheaper and “more pure” and always asks friends visiting the island to bring him back some.\n\nCarey Phillips, Mr Haughton’s girlfriend, said that when he didn’t come home from his Jamaica trip, she assumed he had extended his stay as he had done in the past and couldn’t get in touch with her.\n\nBut days later she got a letter from the Anne Arundel County detention centre from Mr Haughton.\n\n“I was shocked,” Ms Phillips said. “It seems unreal to me. If someone does a crime, you understand, but if there’s nothing, that time is wasted.”\n\nMr Haughton – facing at least 25 years in jail – appeared in court for a bail review two days after his arrest.\n\nA public defender at the hearing said Mr Haughton had no prior convictions and had lived in the area for the past nine years. A judge agreed to let him go on work release, court files and recordings of the hearing show.\n\nBut more than three weeks later, Mr Haughton was still behind bars.\n\nThe drug charges triggered detention orders from customs officials, Mr Haughton’s lawyer said.\n\nAlthough the Maryland State Police lab returned test results on the bottles that indicated “No CDS detected” on 17 January, and although prosecutors had dropped the three felony drug counts on 23 January, Mr Haughton was still facing a misdemeanour charge for possession of a controlled dangerous substance, or CDS.\n\nMr Haughton asked to be released on 24 January at his second bail review, but Anne Arundel County District Court judge Laura Robinson worried he would not appear for trial.\n\n“The problem is I can’t let him go to ICE [Immigration and Customs Enforcement] because he would be deported potentially,” the judge said, according to a recording of the hearing. “Even if I released you, you still wouldn’t necessarily be released. You would go into federal detention.”\n\nMr Haughton was sent back to jail, appearing in court for a third bail review on 5 February.\n\nMr Morris, Mr Haughton’s lawyer, told the judge that Mr Haughton should be released because the immigration detainer was triggered by the felony charges, which had been dropped.\n\nThe federal government was in the middle of last winter’s shutdown, and Mr Morris said he couldn’t reach anyone at immigration and customs enforcement to lift the detainer.\n\n“The thing that’s going to end up happening, and they’re going to realise it is, it’s just honey,” Mr Morris said during the bail review. “He’s been in jail for 30 days for honey.”\n\nThe judge said she would consider releasing Mr Haughton on his own recognisance but only if the federal government pulled the detention order.\n\n“The ICE detainer is really prohibitive,” the judge said. “I’m kind of up against it on the ICE detainer.”\n\nHad Mr Haughton been stopped at any other location, according to multiple immigration lawyers, federal authorities probably would not have issued a detainer for him.\n\nBut because Mr Haughton was stopped at a port of entry at an airport, the felony charges probably triggered “inadmissibility proceedings”, which require only that law enforcement officials have “reason to believe” someone is a drug trafficker to trigger possible deportation proceedings, according to the immigration lawyers.\n\nThe standard, however, is “murky”, said Adina Appelbaum, programme director of the Immigration Impact Lab at the Capital Area Immigrants’ Rights (Cair) Coalition.\n\nAs a basis for removing someone from the country, it is “concerning” because “of how broadly it can be interpreted and applied”, Ms Appelbaum said.\n\n“More broadly, this case demonstrates the disproportionate consequences that criminal offences and allegations can have in the immigration realm, including for people who have lawful status for a green card.”\n\nEmma Winger, a staff attorney for the American Immigration Council, said Mr Haughton’s case is unusual in that he was detained over honey, but not surprising in other respects.\n\n“It’s not unusual that people who are held in criminal custody with ICE detainers have their detentions prolonged and then the charges are dismissed,” Ms Winger said.\n\nMs Winger, like Mr Morris, said the detainer for Mr Haughton probably should have been dropped when the felony drug trafficking charges disappeared.\n\n“Once it was down to possession and not drug dealing, that seems like a good reason to drop the detainer,” Ms Winger said.\n\nBut, she added, “it’s a little bit fuzzier because in theory, all [ICE] needs to charge under this ground of inadmissibility is that they had probable cause” to believe Mr Haughton was a drug trafficker who should be barred entry.\n\nMr Morris said he attempted to reach ICE multiple times to get the detention order lifted but couldn’t make contact.\n\nBoth Ms Appelbaum and Ms Winger said they are not surprised.\n\nIt is generally difficult to reach someone at ICE to lift detainers for what may be considered low-priority cases, and during the shutdown, Ms Appelbaum said, “there was a lot of chaos and no responses”.\n\nWhen asked about the case, customs officials directed The Washington Post to Maryland Transportation Authority Police, which directed a reporter to prosecutors in the Anne Arundel County state’s attorney’s office.\n\nProsecutors answered some questions about their case but directed reporters to the Department of Homeland Security over questions on Mr Haughton’s detainer.\n\nICE then directed reporters back to customs, where Steve Sapp, a spokesman for Customs and Border Protection, said privacy laws prohibit the agency “from discussing specifics of any individual traveller’s arrivals inspection”.\n\nMr Haughton recalls the emotions, the stress and the pain in his children’s voices when they spoke on the phone while he was incarcerated.\n\n“It broke me right down,” Mr Haughton said. “Every time, they asked, ‘When are you coming home?’”\n\nIn explaining the need for two rounds of lab tests, Anne Arundel County state’s attorney Anne Colt Leitess said in an interview that the Maryland State Police crime lab is not equipped to analyse honey or liquid, so its results wouldn’t have cleared Mr Haughton.\n\nBecause the first test came up negative, she said, the state dropped the three felony drug charges but maintained the misdemeanour charge based on the police dog's findings and the positive field test while law enforcement sent the bottles to a Homeland Security lab in Georgia for more testing.\n\n“The ICE detainer is really what is holding him,” Ms Leitess said. “He was not being held on anything with us.”\n\nFor weeks, Mr Morris emailed prosecutors asking for the status of the lab test out of Georgia.\n\nThen, at a court hearing on 21 March – a month and a half after Mr Haughton’s third bail review and nearly three months after his initial arrest – prosecutors dropped the final charge.\n\nMs Leitess said her office had no control over how quickly the second test results arrived but that it dropped the last charge against Mr Haughton immediately after learning them.\n\nMr Haughton said he’s been trying to get his life back in order. He has a job driving a bread truck after losing his previous jobs while in jail.\n\nAnd his children are trying to improve their grades after the trauma of his disappearance affected their schoolwork.\n\nMr Haughton says he is constantly trying to reassure his children – one of whom burst into tears when Mr Haughton came home because she didn’t recognise her father – that he isn’t going to vanish again.\n\nBut some scars, Mr Haughton said, won’t go away.\n\n“I’m scared to even travel right now,” he said. “You’re innocent, and you can end up in jail.”",
    "author": "Lynh Bui",
    "url": "https://www.independent.co.uk/news/world/americas/man-jailed-honey-jars-us-liquid-methamphetamine-a9078221.html",
    "published": "2019-08-25 19:54:37+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}