{
    "data_id": "775238",
    "id": "theindependent--2019-11-11--Rodney Reed: Rihanna, Beyonce and Meek Mill sign petition to stop execution of &apos;innocent&apos; ",
    "date": "11/11/2019",
    "source": "theindependent",
    "title": "Rodney Reed: Rihanna, Beyonce and Meek Mill sign petition to stop execution of &apos;innocent&apos; man",
    "content": "Rihanna, Cass McCombs, Pusha T, Questlove, Beyonce and Meek Mill are among the high-profile stars who have signed a viral petition calling to halt Texas inmate Rodney Reed‘s execution.\n\nThe 51-year-old is currently scheduled for execution on 20 November for the 1996 murder of Stacey Stites in Bastrop, Texas. However, new information has arisen that could potentially exonerate Reed, who was convicted by an all-white jury in 1998 (Mr Reed is black).\n\nThe petition is to rescind his death warrant and ensure he is granted a new trial.\n\nIn a statement posted on her website, Beyonce urged Texas governor Greg Abbott to take a “hard look” at the evidence that points to Reed’s innocence.\n\n“Be honest,” she wrote. “Be fair. Give him back his life.”\n\nRihanna shared the petition and called on her followers to sign as well, tweeting: “One click! SIGN this petition if you don’t believe the government should kill an innocent man!”\n\nIn an article published by The New York Times, it was revealed that at least three people have come forward with new testimony regarding Ms Stites’ fiance, Jimmy Fennell – a former police officer who was released from prison in 2018. A decade earlier, he pleaded guilty to kidnapping a woman he encountered while on duty. The woman claimed he also raped her.\n\nA sworn affidavit by a man who served a sentence in the same prison as Mr Fennell said he heard him confess to the murder of Ms Stites, and alleged that Mr Fennell bragged about killing her because she had cheated on him with a black man. Mr Fennell’s lawyer said he denies killing Ms Stites.\n\nMr Reed’s lawyers say witnesses have since corroborated the existence of an affair between him and Ms Stites.\n\nHis lawyers are pleading with Governor Abbott to delay the execution by 30 days, and to order the Texas Board of Pardons and Paroles to investigate the possibility of commuting his sentence.",
    "author": "Roisin O'Connor",
    "url": "https://www.independent.co.uk/arts-entertainment/music/news/rodney-reed-death-row-execution-petition-beyonce-rihanna-meek-mill-texas-a9198031.html",
    "published": "Mon, 11 Nov 2019 10:24:00 GMT",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}