{
    "data_id": "775588",
    "id": "theindependent--2019-11-13--Rodney Reed: Urgent appeals to save &apos;innocent&apos; death row inmate with week until execution,",
    "date": "11/13/2019",
    "source": "theindependent",
    "title": "Rodney Reed: Urgent appeals to save &apos;innocent&apos; death row inmate with week until execution, as Republicans join campaign",
    "content": "A death row inmate has appealed to supporters to continue pushing for a retrial just a week before his scheduled for execution.\n\nRodney Reed, who lawyers contend was wrongly convicted of raping and strangling 19-year-old Stacy Stites in 1996 by an all-white jury, has just seven days left to live if his appeal is not granted by Texas governor Greg Abbott.\n\nA petition supporting his claim has been endorsed by celebrities like Beyonce, Susan Sarandon and Kim Kardashian-West and politicians on both sides of the political divide.\n\n“One thing that I really missed was really being a father to my kids – and having an opportunity to be grandfather to my grandchildren,\" he told the Wrongful Conviction podcast.\n\n“I just look forward to being out there with my family. With my friends, with my loved ones with my supporters\".\n\nHe added: “On November 20 the state of Texas is trying to take my life, trying to execute me – strap me to a table and inject my body with poisons. Don’t stay back and let this happen just, stay up and stay involved”.\n\nReed has long contended that Stites was killed by her fiancé, former police officer Jimmy Fennell – who he claims was angry after discovering his white partner was having an affair with a black man.\n\nMr Reed's attorneys have presented testimonies that support his claim, including one from a former prison inmate who claims Mr Fennell bragged about killing Ms Stites.\n\nReed's brother, Rodrick Reed, told the podcast: “I have great faith and hope and confidence that he is going to come home alive and well – I believe that. I have to believe that. I can’t put anything negative into my mind. I can’t use my energy in that way”.\n\nThe decision will come down to Governor Abbott, an ardent Republican and supporter of the death penalty who has previously referred to the punishment as “Texas justice”.\n\nHe has only spared a man’s life once while overseeing the execution of almost 50 prisoners.\n\nBut alongside celebrities and a petition signed by almost 3 million people, pressure to grant clemency is also coming from his political allies.\n\nIn a letter to Mr Abbott this week, more than a dozen Republicans said that getting it wrong with Reed could \"erode public trust — not only in capital punishment, but in Texas justice itself.\"\n\nRepublican State Representative James White, who has served in the legislature for nearly a decade said: \"We have a lot of executions, right? We're Texas. This probably is the first one I've directly reached out to the attorney general's office and the governor's office on.\n\n\"Not on the prospect that I believe that Mr Reed is innocent. But I do believe there is a lot of information and evidence that does deserve to be vetted.\"",
    "author": "Vincent Wood",
    "url": "https://www.independent.co.uk/news/world/americas/rodney-reed-texas-death-row-execution-texas-petition-sign-retrial-case-a9201711.html",
    "published": "Wed, 13 Nov 2019 17:19:00 GMT",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}