{
    "data_id": "776096",
    "id": "theindependent--2019-11-18--Sedley Alley: Man executed 13 years ago may be proven innocent by DNA",
    "date": "11/18/2019",
    "source": "theindependent",
    "title": "Sedley Alley: Man executed 13 years ago may be proven innocent by DNA",
    "content": "Sedley Alley was strapped to a gurney and put to death in 2006, convicted of killing a 19-year-old Marine two decades earlier.\n\nAlley had confessed to the slaying of lance corporal Suzanne Collins, but later said his confession was coerced.\n\nNow, a nonprofit legal group dedicated to clearing the wrongly convicted hopes DNA evidence may be used to exonerate the man 13 years after his execution.\n\nSince the early 1990s, 22 death row inmates around the US have been absolved of crimes through DNA evidence.\n\nIf the Innocence Project succeeds with Alley, it will be the first time anyone has used such evidence to exonerate a person who has already been executed.\n\nCollins was stationed at the former Memphis Naval Air Station in Millington when she went jogging in a nearby park in July 1985.\n\nHer body was discovered early the next day. She had been beaten, raped and mutilated.\n\nShortly before Alley was led to the execution chamber and given a lethal injection June 2006, Innocence Project co-founder Barry Scheck helped argue for DNA evidence testing.\n\nBut at the time, the request was denied and Alley, who had spent two decades on Tennessee's death row, was put to death at the age of 50.\n\nThat might have been the end of the story if Mr Scheck had not received a call earlier this year from investigators in St. Louis. He said they wanted to discuss a possible connection between Collins and Thomas Bruce, who is jailed in Missouri and charged with sexually assaulting two women and killing a third at a Catholic Supply store there about a year ago.\n\nMr Scheck said investigators had told him Bruce attended the same avionics course as Collins in Millington, Tennessee.\n\nMr Scheck reached out to Alley's daughter, April Alley, who agreed to petition for DNA evidence testing on behalf of her father's estate.\n\nAlong with her brother, April Alley witnessed her father's execution.\n\nThey had their hands up against the glass as he spoke his last words, telling them he loved them and to “stay strong”.\n\nApril Alley has been reluctant to talk about her effort to get DNA testing, but when she filed the petition in May, she spoke to reporters briefly.\n\n“Watching my father die was so painful,” she said. “I'm hoping I can get the answer, one way or another, that I want.”\n\nShelby County Criminal Court Judge Paula Skahan heard arguments in the case last month and promised to rule on the petition Monday.\n\nShelby County District Attorney Amy Weirich said in an email after the petition was filed that Sedley Alley's case and conviction were repeatedly scrutinised by the courts over 21 years, and his guilt was established with “absolute certainty”.\n\nAt the hearing last month, Assistant District Attorney Steve Jones argued the state's DNA analysis law allows only the person convicted of the crime to request testing. He also argued that even if DNA from a third party were found on some of the evidence, it would not prove Alley was innocent.\n\nAlley was convicted based on “a combination of factors that corroborated his confession,” Jones said.\n\nMr Scheck has said Alley's confession did not match the crime scene evidence. For example, Alley said he hit Collins with his car, but Collins hadn't been run over.\n\nIn court last month, Scheck argued that it was a matter of justice to test the DNA evidence, noting the court has the power to order the testing.\n\nEvidence they want tested includes a pair of men's underwear recovered at the scene.\n\n“April Alley wants to know the truth. She has the courage to seek the truth,” Mr Scheck said at the hearing. “DNA testing can ... provide that truth.”",
    "author": "Associated Press reporters",
    "url": "https://www.independent.co.uk/news/world/americas/sedley-alley-death-row-innocent-execution-murder-dna-evidence-a9207686.html",
    "published": "Mon, 18 Nov 2019 15:12:50 GMT",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}