{
    "data_id": "777257",
    "id": "theindependent--2019-11-26--Three innocent men released after 36 years in prison for crime they did not commit",
    "date": "11/26/2019",
    "source": "theindependent",
    "title": "Three innocent men released after 36 years in prison for crime they did not commit",
    "content": "Three men who spent 36 years behind bars for a murder they did not commit have been released, after they managed to unearth new evidence from prison.\n\nAlfred Chestnut, Ransom Watkins and Andrew Stewart were teenagers when they were arrested in November 1983 over the murder of 14-year-old DeWitt Duckett in Baltimore, Maryland.\n\nThe pupil was shot in the neck and killed for his Georgetown University basketball jacket while walking to a lesson at Harlem Park Junior High School.\n\nMr Chestnut and Mr Watkins, who were 16 at the time, and Mr Stewart, who was 17, were playing truant from another school to visit former friends and teachers at Harlem Park on the day of the killing, according to CNN.\n\nA security guard testified that he kicked the trio out and watched them walk up the street before locking the school doors at about 12.45pm – half an hour before the shooting, the news channel reports.\n\nThe three friends were convicted of the killing based on witness testimonies and a Georgetown University jacket found in Mr Chestnut’s bedroom.\n\nThe jacket, however, reportedly had no traces of blood or gunshot residue, and Mr Chestnut’s mother had produced a receipt showing she had bought it recently.\n\nThey trio always maintained their innocence and were denied early release from prison because they refused to confess to the shooting.\n\nThe case was eventually reopened earlier this year after Mr Chestnut, who never gave up fighting for a review, filed a public records request and uncovered evidence withheld from the defence team and jury during their trial, CNN reports.\n\nMr Chestnut sent a letter including the new evidence to Baltimore City State attorney Marilyn Mosby’s Conviction Integrity Unit.\n\nProsecutors now say police reports show multiple witnesses told police that a different suspect, who was 18 at the time of the crime, was the shooter.\n\nOne student reported seeing him flee the scene and dump a gun as police arrived at the school, but authorities at the time focused their investigation on the trio.\n\nThe new suspect, who was shot dead in 2002, was also allegedly seen wearing Mr Duckett’s jacket and confessing to the murder after the shooting, another witness said.\n\nAn assistant prosecutor working on the case told the court in 1984 that the state did not have any reports that would have raised doubts about the three defendants’ guilt, even though police records had statements involving the 18-year-old and also showed trial witnesses had failed to identify the teenagers in photo line-ups.\n\nA judge sealed those documents, but they were among the information Mr Chestnut obtained last year.\n\nMr Chestnut, Mr Watkins and Mr Stewart were released from custody hours after a judge cleared their convictions and prosecutors dropped the charges on Monday.\n\nCircuit Court Judge Charles Peters told the men: “On behalf of the criminal justice system, and I’m sure this means very little to you gentlemen, I’m going to apologise”, the Baltimore Sun reported.\n\nMs Mosby said the result was a “tragedy”, not a “victory”.\n\nShawn Armbrust, executive director of the Mid-Atlantic Innocence Project, which represents Mr Watkins, said: “Everyone involved in this case – school officials, police, prosecutors, jurors, the media, and the community – rushed to judgment and allowed their tunnel vision to obscure obvious problems with the evidence.\n\n“This case should be a lesson to everyone that the search for quick answers can lead to tragic results.”",
    "author": "Chiara Giordano",
    "url": "https://www.independent.co.uk/news/world/americas/maryland-wrongful-conviction-murder-alfred-chestnut-ransom-watkins-andrew-stewart-a9218071.html",
    "published": "Tue, 26 Nov 2019 11:41:57 GMT",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}