{
    "data_id": "781842",
    "id": "theintercept--2019-03-13--There Are Innocent People on Death Row Citing Wrongful Convictions California Governor Halts Ex",
    "date": "3/13/2019",
    "source": "theintercept",
    "title": "“There Are Innocent People on Death Row” — Citing Wrongful Convictions, California Governor Halts Executions",
    "content": "signed Wednesday morning, California Gov. Gavin Newsom imposed a moratorium on executions and ordered the death chamber at San Quentin Prison — unused following a $853,000 renovation a decade ago — closed. “We are, as I speak — as I speak — shutting down, removing the equipment in the death chamber at San Quentin,” Newsom said at a press conference at the state capitol in Sacramento.\n\nIn remarks that emphasized racial disparities and the risk of executing innocent people, Newsom described his decision as the culmination of “a 40-year journey” that began when he was just a child. His grandfather introduced him to Pete Pianezzi, who came close to receiving the death penalty in 1940 after being set up by the mob. Pianezzi was eventually pardoned in 1981, at the age of 79. But wrongful convictions remain a profound danger. “You had someone just last year that was released from death row after serving 26 years in San Quentin,” he said, referring to the case of Vicente Benavides, exonerated in April 2018.\n\nNewsom’s order leaves intact the sentences of all 737 condemned people in the state, the largest death row in the country. It also does nothing to stop prosecutors from seeking new death sentences, something California district attorneys have proven eager to do. In this sense, Newsom’s announcement merely formalizes the status quo in a state whose death penalty system has come to be defined by disarray — and where no executions have been carried out in more than 13 years.\n\nNevertheless, the governor’s language against the death penalty was passionate and unambiguous, suggesting that he could take more decisive action in the future. He explained that he felt no choice but to act now upon being confronted with the question of whether he would continue the efforts of the previous administration to adopt a viable lethal injection protocol. “I would be lying if I said I could support that,” he said. In addition, he said, there are 25 people on death row who have exhausted their appeals, raising the possibility that he would have to oversee their executions, something he would be unwilling to do.\n\nNewsom’s move comes just a few years after California actually voted to hasten executions in the state. Voters in the 2016 election were faced with confusing, dueling ballot initiatives: Proposition 66, which sought to revamp the system in order to speed up executions (a measure strongly supported by law enforcement), and Proposition 62, which sought to abolish the death penalty and replace it with life without parole. Then-Gov. Jerry Brown stayed mum on the issue as did Kamala Harris, then the state’s attorney general and now a U.S. senator and Democratic candidate for president. But Newsom, at that time the state’s lieutenant governor, came out forcefully in favor of abolition, writing that the death penalty was “fundamentally immoral.” When the votes were counted, Prop 62 had failed and Prop 66 had passed by the narrowest of margins.\n\nAs predicted at the time, legal challenges have blocked the implementation of Prop 66. Today, California is one of several death penalty states where executions remain stalled with no sign of restarting. In Pennsylvania, which has not used its death chamber since 1999, Gov. Tom Wolf declared a moratorium on executions in 2015, calling the death penalty “ineffective, unjust, and expensive.” Moratoriums have also remained in place in Oregon and Colorado, two states on the cusp of abolishing executions altogether.\n\nEven the most active death penalty states have been continually mired in controversy and litigation over execution protocols. In Ohio, Gov. Mike DeWine recently announced a pause on executions while the state weighs alternatives to its lethal injection protocol. The decision came soon after he granted a reprieve to Warren Keith Henness in January, citing concerns by a federal judge that the execution would be akin to torture.\n\nIn many ways, California’s death penalty system is emblematic of the state of capital punishment nationwide. As in much of the country, people on death row in the state are more likely to die from illness, suicide, or old age than they are to be executed. California’s last execution took place in January 2006, when it put to death 76-year-old Clarence Ray Allen, the oldest person ever executed by the state. Allen, who was diabetic and legally blind, was brought to the death chamber in a wheelchair. Soon after Allen’s execution, a challenge to the state’s lethal injection protocol brought the system to a halt.\n\nYet California prosecutors continued to seek death sentences — 180 people were sent to death row between 2006 and 2015, the last year for which the California Department of Corrections and Rehabilitation has posted data. Since California reauthorized the death penalty in 1978, death sentences have rarely led to executions. According to data compiled by The Intercept, at least 72 people on death row have had their sentences reduced to life with or without parole and at least 11 have been released from prison, including six who were ultimately exonerated. And the row continues to gray: Fifty-three percent are 50 or older; 79 people have died awaiting execution. Twenty-six have killed themselves.\n\nNevertheless, prosecutors continue to insist that the death penalty is effective and necessary. The Association of Deputy District Attorneys lambasted Newsom’s order as “hasty and ill-considered,” saying that it violates the will of the people. “The voters of the State of California support the death penalty,” ADDA President Michele Hanisee said, saying that this was “powerfully demonstrated by their approval of Proposition 66 in 2016.” In an interview with The Intercept that year, Hanisee said that hastening executions was about delivering justice to victims, not about clearing the growing backlog of people awaiting execution. “I don’t think the goal is to clear death row,” she said at the time. “That would be perverse.”\n\nNews of the governor’s moratorium came as a pleasant surprise to Donald Heller, the veteran California attorney who wrote the 1978 ballot initiative that created California’s current death penalty law. Heller told The Intercept in 2016 that he was dismayed at the way the law was applied, particularly in the case of Tommy Thompson, a man executed in 1998 — and who Heller firmly believed was innocent.\n\nHeller was in Boston and had not yet heard the news about Newsom’s planned announcement when The Intercept reached him on Tuesday night. “I applaud what he’s doing,” he said. “It shows courage and a belief that capital punishment should eventually be abolished.” Heller was an outspoken supporter of Prop 34, the predecessor to the abolitionist initiative defeated in 2016. At that time, he recalled, “it was estimated we had spent $4 billion executing 13 people, which is truly insane.” Today, the estimate has climbed to $5 billion.\n\nHeller calls the ballot initiative he authored in the late 1970s “a colossal failure, because it didn’t function as intended.” Rather than make the death penalty apply to only the most egregious crimes, “it filled death row — and so many cases have been overturned for reasons that dealt with ineffective assistance of counsel. It’s just not effective — and I’m convinced it’s not a deterrent.”\n\nDarryl Stallworth, a former prosecutor turned defense attorney in Oakland who campaigned for Prop 62, was “absolutely delighted” at Newsom’s decision. Stallworth came to oppose the death penalty after prosecuting a young black man in a capital case that ultimately ended with a sentence of life without parole. After 27 years working in the justice system, he has returned time and again to “the fundamental understanding that the death penalty does not deter crime, it does not save lives, it does not provide closure, it subjects people to an awful lot of disproportionate treatment based on color, class, gender,” he said. “It is a system that does not have the proper mechanisms to make sure that they get it right, and even if they do, oftentimes it’s still not constitutional.” Stallworth called capital punishment a “scar” on the nation’s laws. “I’m happy that the governor has recognized the scar, the taint, the damage that it has left on the criminal justice system.”\n\nAs Newsom made clear at the Wednesday press conference, the enduring unfairness inherent in the death penalty was what forced him to act. More than 60 percent of California’s death row population are people of color; overall, 61 percent of Californians are white. “Our death penalty system has been — by any measure — a failure,” Newsom said. “It has discriminated against defendants who are mentally ill, black and brown, or can’t afford expensive legal representation.” It does not act as a deterrent and has wasted billions, he said. “But most of all, the death penalty is absolute. Irreversible and irreparable in the event of human error.”\n\nAnd there are lingering questions about the impact of human error — and of bias and corruption — in a number of California cases, including that of Kevin Cooper, who has been on death row since he was convicted in 1985 of a grisly quadruple murder in Chino Hills. There are serious reasons to question Cooper’s guilt — and to believe that he was framed by law enforcement — and he has long sought DNA testing in an effort to clear his name. But Kamala Harris refused to allow the testing during her time as attorney general — and then Jerry Brown dragged his heels until the last days of his administration, when he finally issued an executive order providing limited testing and consideration of disputed evidence. In February, Newsom widened the scope of the testing.",
    "author": "Jordan Smith",
    "url": "https://theintercept.com/2019/03/13/california-death-penalty-moratorium/",
    "published": "2019-03-13 20:03:18+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}