{
    "data_id": "7937",
    "id": "aljazeera--2019-01-10--Trial of Frenchman for Jewish museum attack opens in Brussels",
    "date": "1/10/2019",
    "source": "aljazeera",
    "title": "Trial of Frenchman for Jewish museum attack opens in Brussels",
    "content": "The trial of a man accused of shooting dead four people at a Jewish museum in Belgium in 2014 has started in Brussels amid high security.\n\nMehdi Nemmouche, 33, who was in court, faces a life sentence if convicted of the killings in the Belgian capital following his return from Syria where he allegedly fought alongside the Islamic State of Iraq and the Levant (ISIL, also known as ISIS) fighters.\n\nNemmouche's suspected accomplice in the May 24, 2014 attack, Nacer Bendrer, a fellow Frenchman aged 30, was also present in the Brussels courtroom on Thursday.\n\nBoth have previously denied charges of \"terrorist murder\", the first of several attacks on European soil attributed to the ISIL.\n\nThe shooting caused the death of four people: an Israeli couple, a Belgian man who worked at the museum and a French woman who volunteered there.\n\nSix days after the attack Nemmouche - born to a family of Algerian origin in the northern French town of Roubaix - was arrested in the southern French port city of Marseille, where he arrived on a bus from Brussels.\n\nInvestigators said he was carrying a handgun and an assault rifle used in the shooting.\n\nThey said he fought with an armed group in Syria from 2013 to 2014, where he met Najim Laachraoui, a member of the gang which went on to carry out suicide bombings in Brussels that killed 32 people in March 2016.\n\nThe same Brussels cell is also alleged to have carried out the Paris gun attacks and bombings on November 13, 2015, in which 130 people were killed and hundreds more wounded.\n\nBoth attacks were claimed by the ISIL group.\n\nNemmouche and Bendrer, investigators say, met nearly a decade ago while in prison in southern France, where they were both described as \"radicalised\" inmates who tried to win others over.\n\nBendrer was arrested in Marseille seven months after the Jewish museum attack and charged as Nemmouche's accomplice.\n\nAlthough he was jailed for five years in September by a French court for attempted extortion, he was transferred to Belgium for the trial.\n\nNemmouche is expected to face a separate trial in France for holding French journalists hostage in Syria.",
    "author": "",
    "url": "https://www.aljazeera.com/news/2019/01/trial-frenchman-jewish-museum-attack-opens-brussels-190110093851004.html",
    "published": "2019-01-10 12:34:08+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}