{
    "data_id": "797937",
    "id": "themanchestereveningnews--2019-03-29--Property developer tried to blame innocent employee for dishonestly claiming almost 50000 in tax",
    "date": "3/29/2019",
    "source": "themanchestereveningnews",
    "title": "Property developer tried to blame innocent employee for dishonestly claiming almost £50,000 in tax",
    "content": "A property developer who dishonestly claimed almost £50,000 in VAT tried to pin the blame on an innocent employee before admitting it was him.\n\nMark Fishwick, 49, from Northenden , failed to admit that he'd submitted fraudulent tax returns and dishonestly claimed VAT repayments.\n\nBut HM Revenue and Customs (HMRC) found Fishwick deliberately stole the money to improve the cash flow of his business.\n\nFishwick was the company director of Ecobuild (M/C) Ltd - a commercial and residential property builder and developer.\n\nThe company was based on King Street West, in Stockport , but was liquidated in December last year.\n\nOn the Ecobuild website, the firm claim to have over '30 years of experience' with 'trusted builders'.\n\nIt emerged that between October 2016 and August 2017, Fishwick stole £49,000 in total from the taxpayer.\n\nFishwick, of Shawdene Road, Northenden, admitted VAT fraud and was sentenced to 18 months in jail, suspended for two years at Manchester Minshull Street Crown Court on Friday.\n\nHe was disqualified as a company director for four years and ordered to complete 250 hours of unpaid work.\n\nFollowing the case, Tim Atkins, an assistant director at the Fraud Investigation Service of HMRC, said: “Fishwick used taxpayers’ money to try and keep his own business afloat. He even attempted to shift the blame to an innocent employee before accepting that it was all his doing.\n\n“VAT fraud steals money from vital public services. This money is equivalent to the starting salary of two paramedics for a year.\n\n\"We ask anyone with information about suspected tax fraud to contact our Fraud Hotline on 0800 788 887.”",
    "author": "Ashlie Blakey",
    "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/vat-tax-fraud-mark-fishwick-16048759",
    "published": "2019-03-29 15:47:34+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}