{
    "data_id": "815",
    "id": "abcnews--2019-01-03--Law enforcement unions frustrated over members missing pay amid shutdown",
    "date": "1/3/2019",
    "source": "abcnews",
    "title": "Law enforcement unions frustrated over members missing pay amid shutdown",
    "content": "The heads of unions representing federal law enforcement have some choice words for President Donald Trump amid the government shutdown.\n\nThe chief of the union that represents officers working for the Transportation Security Administration, whose members are responsible for securing airline travelers, expressed strong frustration Thursday at the prospect of missing paychecks if the government shutdown drags on.\n\n\"How can you protect people who fly when you're worried about paying your bills?\" Hydrick Thomas, TSA Council President, told ABC News.\n\nThomas said that 45,000 TSA employees aren't getting paid, and there is nothing that they can do about it.\n\n\"That is our Christmas gift from our president, not going to get paid,\" Thomas continued. He added that he hoped the president would \"wake up.\"\n\nWhile Acting Attorney General Matt Whitaker effusively praised the president Wednesday for \"giving up\" his holiday to deal with the government shutdown, he failed to mention the thousands of federal agents in the Department of Justice were also working -- and not getting paid.\n\nOne of those agencies that Whitaker oversees is the Federal Bureau of Prisons.\n\n“We just passed New Year's and New Year's for most of us is when we pay our mortgages, our rents and many people have been expressing through and on social media, that they went to their landlords and their landlords stated they have got to get the bills paid, and if they don’t, they’re going to come and find their stuff out on the front lawn,” Eric Young, the head of the Federal Bureau of Prisons Union, told ABC News.\n\n“In prisons, you can’t cut back on services. The results are more violence, unsafe prisons, people being killed -- the inmates and also the staff. So, when you have them being distracted now from not getting paid, worrying about whether they can put their kid in daycare, that brings undue stress on them from what they need to do inside our prisons,” Young said.\n\nThe FBI Agents Association is blasting both sides in the shutdown.\n\n“As the country celebrates the New Year, the American public can be assured that the FBIAA’s membership -- which includes nearly 13,000 Special Agents of the FBI -- are on the job 24-hours a day, seven days a week to protect our country from criminal and terrorist threats. These men and women are doing so while facing a confluence of policies and gridlock that are causing financial hardship for Agents and their families,\" President Tom O'Connor said in a statement.\n\n\"FBIAA members and others are currently working without pay or paid leave because of a fourth government shutdown in five years. The FBIAA calls on elected officials to work together to end the shutdown and restore Agents’ pay,\" O'Connor said.",
    "author": "Luke Barr",
    "url": "https://abcnews.go.com/Politics/law-enforcement-unions-frustrated-members-missing-pay-amid/story?id=60141079",
    "published": "2019-01-03 22:56:32+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}