{
    "data_id": "892",
    "id": "abcnews--2019-01-07--Justice Ruth Bader Ginsburg misses Supreme Court session due to cancer recovery",
    "date": "1/7/2019",
    "source": "abcnews",
    "title": "Justice Ruth Bader Ginsburg misses Supreme Court session due to cancer recovery",
    "content": "Supreme Court Justice Ruth Bader Ginsburg, recovering from surgery to remove two cancerous lesions from her left lung, will not attend oral arguments Monday -- the first time she has missed a scheduled public session due to illness in her 25-year career on the high court bench, a court spokeswoman said.\n\nMonday's oral arguments come 17 days after surgeons at Memorial Sloan Kettering Cancer Center in New York City performed a pulmonary lobectomy on Ginsburg, cutting out cancerous tissue in her lung. She has been working from home as she recovers. Supreme Court spokeswoman Kathy Arberg said Ginsburg still planned to \"participate\" in the cases by reading the briefs, filings and transcripts from Monday's session. It was not immediately clear whether Ginsburg would return to the bench later this week.\n\nThe court said last month that doctors found no evidence of any remaining disease and planned no further treatment. Ginsburg spent four days in the hospital following the procedure and spent the remainder of the court’s winter recess recovering at home.\n\nThe court’s oldest justice at 85, Ginsburg has shown dogged determination to participate in the court's proceedings over the years, despite three serious bouts of cancer, several other health scares and personal setbacks, including the death of her husband in 2010.\n\nIn just the past two months, Ginsburg was hospitalized twice –- first after suffering broken ribs from a fall in her office in November, then the December surgery to remove tumors –- nevertheless participating, uninterrupted, in court business, a spokesperson for the court said.\n\nOn Nov. 9, two days after being treated for the broken ribs, Ginsburg was unable to attend the formal investiture ceremony for Justice Brett Kavanaugh but did participate in conference while working from home, a court spokeswoman said at the time.\n\nDoctors contacted by ABC News said Ginsburg's resilience is an example for all Americans facing a cancer diagnosis.\n\n“Lung cancer suffers from pessimism, stigma, nihilism, but here’s a patient where lung cancer was caught early,” said Dr. Geoff Oxnard, a thoracic oncologist at the Dana Farber Cancer Institute in Boston. “There is room for hope. We can change the story here. Patients need to ask themselves, ‘How can I be like Ruth Bader Ginsburg? How can I catch it early?’”",
    "author": "Devin Dwyer",
    "url": "https://abcnews.go.com/Politics/supreme-court-returns-justice-ruth-bader-ginsburg-seat/story?id=60160648",
    "published": "2019-01-07 14:48:46+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}