{
    "data_id": "937",
    "id": "abcnews--2019-01-09--Former Guantanamo Bay commander indicted for obstructing justice in 2015 death",
    "date": "1/9/2019",
    "source": "abcnews",
    "title": "Former Guantanamo Bay commander indicted for obstructing justice in 2015 death",
    "content": "The former commander of the Naval Base at Guantanamo Bay has been indicted on federal charges of obstruction of justice related to the January, 2015 death of a base employee who had confronted the officer with allegations that he was having an affair with his wife. Christopher Tur was found drowned in the waters of Guantanamo Bay two days after confronting Captain John Nettleton about the alleged affair.\n\nNettleton was arraigned Wednesday at the federal courthouse in Jacksonville, Florida exactly four years to the day that Tur disappeared following the confrontation and subsequent fight between the two men.\n\nAt the time, Nettleton was the commander of Naval Station Guantanamo Bay in Cuba. Nettleton’s command did not include the detention facility at the base that is overseen by a one-star flag or general officer. Tur was a civilian employee of the commissary on the base.\n\nAccording to the indictment, on the night of January 9, 2015 Tur confronted and yelled at Nettleton at a party at the Officers’ Club with allegations that the Naval officer had had an affair with his wife, Lara.\n\nA short time later Tur went to Nettleton’s nearby residence and the two men engaged in a physical altercation that left Tur injured.\n\nInvestigators found texts from Nettleson's daughter, the only other person in the residence at the time, describing a loud commotion in the house. When she went to investigate she saw an unknown man hovering above her father, who was lying on the floor, attempting to use a cellphone.\n\nThe person that Tur phoned told investigators that Tur had told him he was \"at the Skipper's house\" and \"just knocked out the Skipper.\"\n\nNettleson's daughter's texts described loud arguing and fighting that lasted for another half hour.\n\nThe next day Navy personnel went looking for Tur after he had not returned home.\n\nTur's body was found on January 11 floating in Guantanamo Bay after an intensive search at the base.\n\nAn autopsy determined he had drowned but had suffered fractured ribs and a laceration on his head.\n\nFrom the moment the search for Nettlson began and throughout the subsequent investigation he did not mention to base personnel, investigators or his superior officer that Tur had last been seen at his home. He falsely claimed that he had last ween Tur at the Officers Club.\n\nHe also did not disclose that Tur had accused him of engaging in an affair with his wife, engaged in a physical fight at his home and that Tur had been injured.\n\nInvestigators later determined through DNA testing that blood stains found at Nettleson's home belonged to Tur. They also determined that Nettleson and Lara Tur had engaged in an affair in 2014.\n\nThree weeks after Tur's disappearance Nettleson was relieved of command and placed in an administrative job in Jacksonville pending the results of a joint Naval Criminal Investigative Division and Justice Department investigation.\n\nABC News cited a U.S. official who said information had come to light during the investigation into Tur’s death that led the Navy to relieve Nettleton of command. The official said the investigation found that Nettleton had allegedly been having an affair with Tur’s wife Lara, the director of the Fleet and Family Services Center at the base.",
    "author": "Luis Martinez",
    "url": "https://abcnews.go.com/Politics/guantanamo-bay-commander-indicted-obstructing-justice-2015-death/story?id=60268299",
    "published": "2019-01-09 23:34:46+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}