{
    "data_id": "937959",
    "id": "thesun--2019-02-14--Pregnant teen and husband burglars killed in A40 police chase were INNOCENT and due to have thei",
    "date": "2/14/2019",
    "source": "thesun",
    "title": "Pregnant teen and husband ‘burglars’ killed in A40 police chase ‘were INNOCENT’ and due to have their baby on Valentine’s Day",
    "content": "A PREGNANT teen and her husband who were accused of being “burglars” after being killed in a police chase were INNOCENT and were due to have their baby TODAY.\n\nPatrick McDonagh, 19, and his 18-year-old wife Shauna, died on the A40 near East Acton in West London at about 9pm on Sunday.\n\nThe car they were in was on the wrong side of the road when they were killed in a head-on collision with a coach.\n\nA second man who was travelling in the car was taken to hospital.\n\nAround 20 minutes earlier police had been called to reports of an aggravated burglary in Harrow and began a road chase.\n\nBut cops have now revealed the newlyweds were not present at the time of the burglary they were later linked to.\n\nThe Independent Office for Police Conduct (IOPC) has said it is understood that officers were pursuing the car, a Renault Scenic, for about 10 minutes but terminated the pursuit prior to the crash.\n\nAn IOPC statement said: \"It has now been confirmed, as part of a separate police investigation, that the occupants of the Renault were not present at the time of an aggravated burglary reported to have taken place in Harrow.\"\n\nThe IOPC said its investigation would look at \"the information the police had and the rationale for the pursuit\".\n\nA family statement said: \"Patrick and Shauna were a young couple who had recently got married and were very much in love.\n\n\"Patrick was a devoted husband to Shauna and they were very much looking forward to the birth of their daughter Sienna Marie who was due to be born on Valentine's Day.\"\n\nA National Police Air Service helicopter was tracking the Renault when it crashed.\n\nAccounts from officers, along with footage from the helicopter, police cars, body-worn video, CCTV and in-car data are among the evidence being gathered by investigators.\n\nThe Metropolitan Police made a mandatory referral to the IOPC later on Sunday.\n\nIOPC regional director Jonathan Green said: \"My thoughts are with the families and friends of Patrick and Shauna, those injured and all those affected by this incident.\n\n\"It is important that we now establish all of the circumstances surrounding this collision.\n\n\"We have therefore launched an independent investigation into the events leading to the collision and immediately deployed our investigators to attend the scene and the post-incident procedure.\"\n\nWe pay for your stories! Do you have a story for The Sun Online news team? Email us at tips@the-sun.co.uk or call 0207 782 4368 . You can WhatsApp us on 07810 791 502. We pay for videos too. Click here to upload yours.",
    "author": "Alex Matthews",
    "url": "https://www.thesun.co.uk/news/8431463/valentines-day-pregnant-teen-husband-killed-a40-police-chase/",
    "published": "2019-02-14 21:51:49+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}