{
    "data_id": "940633",
    "id": "thesun--2019-02-24--Innocent man 71 who WRONGLY spent 40 YEARS in jail for murdering his ex-girlfriend and her son win",
    "date": "2/24/2019",
    "source": "thesun",
    "title": "Innocent man, 71, who WRONGLY spent 40 YEARS in jail for murdering his ex-girlfriend and her son wins £16million payout",
    "content": "AN innocent man who spent nearly forty years in prison for the murder of his ex- girlfriend and her son has been awarded £16 million compensation.\n\nCraig Coley was jailed in 1978 for killing Rhonda Wicht, and her 4-year-old son, Donald, at their apartment near Los Angeles.\n\nThe 71-year-old always maintained his innocence, and was pardoned in 2017 by California’s then-governor, Jerry Brown, based on DNA evidence found by investigators.\n\nOfficials in the city of Simi Valley officials the compensation would spare Coley lengthy legal action.\n\n\"While no amount of money can make up for what happened to Mr. Coley, settling this case is the right thing to do for Mr. Coley and our community,\" said City Manager Eric Levitt.\n\nCalifornia authorities awarded Coley £1.5 million last year - or just under £110 for each day he spent in prison – which he spent buying a home.\n\nWith the money from the final settlement he will also be able visit places on his bucket list and continue to help the wrongfully convicted, his friend Mike Bender said.\n\n“He’s looking forward to being able to live his life. No one would want to trade places with him,” said Mr Bender, a former Simi Valley police detective.\n\n\n\nThe city's police chief and Ventura County's district attorney asked Brown to pardon him because  tests showed Coley's DNA was not on the victim's bedsheet.\n\nThe sheet contained DNA from an unknown man and Coley had an alibi for the time of the murders. Investigators later disproved testimony from an eyewitness who placed him at the scene.\n\nHis parents died while he was in prison after mortgaging their home to pay his legal bills.\n\nColey’s lawyer Ron Kaye said the settlement offers some closure and vindication for his client, though no amount of money can compensate him for the life he missed while imprisoned.\n\n\"He now can live the rest of his life, which we hope will be really well into the future, with the security he deserves,\" Kaye said.\n\nSimi Valley police have not arrested anyone else in the killings.\n\nSince his release, Coley has spoken to law enforcement officials about evidence collection, and has met with parents of prisoners who maintain their innocence.\n\nMore than 350 U.S. inmates have been exonerated by DNA testing since 1989, according to New York-based the Innocence Project, which helps people who were wrongfully convicted.\n\nOn average, convicts who were freed had served 14 years in prison when exonerated.\n\nWe pay for your stories! Do you have a story for The Sun Online news team? Email us at tips@the-sun.co.uk or call 0207 782 4368 . We pay for videos too. Click here to upload yours.'",
    "author": "Tariq TAHIR",
    "url": "https://www.thesun.co.uk/news/8500650/innocent-man-71-who-wrongly-spent-40-years-in-jail-for-murdering-his-ex-girlfriend-and-her-son-wins-16million-payout/",
    "published": "2019-02-24 22:23:03+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}