{
    "data_id": "952874",
    "id": "thesun--2019-04-08--How this loving family photo cleared innocent rape suspect accused by his evil fantasist ex-girlfrie",
    "date": "4/8/2019",
    "source": "thesun",
    "title": "How this loving family photo cleared innocent rape suspect accused by his evil fantasist ex-girlfriend after it proved a rock-solid alibi during four-month jail hell",
    "content": "THIS loving family photograph finally cleared a man who was jailed after his evil ex-partner wrongly accused him of raping her.\n\nThe picture of Dan Jones with his newborn nephew proved to be a solid alibi when Sarah Jane Parkinson claimed her partner had attacked and sexually assaulted her.\n\nBut the former prison guard endured four hellish months in a maximum security jail before the picture emerged.\n\nDan, of New South Wales, Australia, met Parkinson in 2011 and they got engaged after just a few months of dating.\n\nDetermined to live with his future wife, Dan bought a house and the couple moved in together.\n\nBut Parkinson, a police clerical assistant, began to concoct lies that he was violent towards her in a bid to claim their home, 9news.com.au reports.\n\nIt's alleged she told her work colleagues that her fiance was abusing her, leaving her with brusies.\n\nBut she failed to mention that she suffered a heart condition that made her dizzy, which contributed to a series of household accidents and injuries.\n\nDan was then called in for a \"chat\" with Parkinson's boss, Inspector Anthony Hill - and subsequently told that an Apprehended Violence Order (AVO) was being taken against him for abusing Parkinson.\n\nDan told 60 Minutes that Parkinson had been having an affair with a police officer she worked with.\n\nHe was targeted in a series of false allegations when Parkinson claimed she was struck by him with a lump of wood and a tyre lever.\n\nDan described Parkinson as being like a \"complete stranger\".\n\nHe was arrested and charged with 32 counts of domestic violence on Christmas Eve 2013.\n\nWhile Dan was served with a court order, Parkinson and her new lover were living in the home he had bought.\n\nHe said: \"When I first got charged, I found out [Parkinson] had been keeping a diary of things that never happened.\n\n\"She’d written entries going back more than six months with a view to using it as a historical document in court.\"\n\nOn March 21, 2014, Mr Jones was arrested at his parents' house for an alleged rape.\n\nParkinson said Mr Jones rammed her head into a wall, jumped on her, kicked her, forced her to open a condom wrapper, then raped her.\n\n\n\nBut he image proved that, at the time Parkinson claimed Dan had attacked her, he was actually with his brother Andrew and his partner Amy, who had visited him with their son, Hunter.\n\nThey had a photograph taken at around 1pm, with Mr Jones in his pyjamas holding baby Hunter on his knees.\n\nThe case was eventually passed to Detective Sergeant Leesa Alexander.\n\nParkinson accused her ex's parents of stealing her iPad before a tracking device on her car helped investigators prove she had driven up to their property and dumped the tablet on their lawn herself.\n\nDet Alexander told 60 Minutes: \"It was clear... that Sarah had lied.\"\n\nAn emergency bail hearing was called by the Department of Public Prosecutions after a series of investigations.\n\nDan was released from jail on bail conditions.\n\nEarly this year, Parkinson finally pleaded guilty to her crimes at court.\n\nShe was jailed for three years and one month in prison and at least two of those years will be spent behind bars.\n\nWe pay for your stories! Do you have a story for The Sun Online news team? Email us at tips@the-sun.co.uk or call 0207 782 4368 . You can WhatsApp us on 07810 791 502. We pay for videos too. Click here to upload yours.",
    "author": "Nicola STOW",
    "url": "https://www.thesun.co.uk/news/8818467/family-photo-cleared-innocent-rape-suspect-girlfriend/",
    "published": "2019-04-08 17:18:06+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}