{
    "data_id": "9701",
    "id": "aljazeera--2019-02-12--Mexican drug lord Joaquin El Chapo Guzman guilty in US trial",
    "date": "2/12/2019",
    "source": "aljazeera",
    "title": "Mexican drug lord Joaquin 'El Chapo' Guzman guilty in US trial",
    "content": "Notorious Mexican drug lord Joaquin \"El Chapo\" Guzman was found guilty in a US court on Tuesday of operating a criminal enterprise.\n\nJurors in federal court in Brooklyn began delivering their verdict following an 11-week trial. Guzman, 61, now faces a possible sentence of life in prison.\n\nGuzman was convicted on all 10 criminal charges he was tried for. US prosecutors said he had amassed a $14bn fortune through bribery, murder and drug smuggling.\n\nGuzman, one of the major figures in Mexican drug wars that have roiled the country since 2006, was extradited to the United States for trial in 2017 after he was arrested in Mexico the year before.\n\nThough other high-ranking cartel figures had been extradited previously, Guzman was the first to go to trial instead of pleading guilty.\n\nGuzan's trial included nearly three months of testimony about a vast drug-smuggling conspiracy steeped in violence.\n\nThroughout the months-long trial, the jury has heard more than 200 hours of testimony about Guzman's rise to power as the head of the Sinaloa cartel.\n\nProsecutors said he is responsible for smuggling at least 200 tonnes of cocaine into the US and a wave of killings in turf wars with other cartels.\n\nThe 11-week trial, which featured testimony from more than 50 witnesses, offered the public an unprecedented look into the inner workings of the cartel, named after the state in northwest Mexico where Guzman was born in a poor mountain village.\n\nProsecutors said he trafficked tonnes of cocaine, heroin, cannabis and methamphetamine into the US over more than two decades, consolidating his power in Mexico through murders and wars with rival cartels.\n\nThe defence has argued that Chapo was set up as a \"fall guy\" by Ismael \"El Mayo\" Zambada, a drug kingpin from Sinaloa who remains at large.\n\nMexico has been mired for 12 years in a deadly military-led war against drug gangs. President Andres Manuel Lopez Obrador was elected last year after promising a change, suggesting a negotiated peace and amnesty for non-violent drug dealers, traffickers and farmers.\n\nThe most detailed evidence against Guzman came from more than a dozen former associates who struck deals to cooperate with US prosecutors.\n\nThrough them, jurors heard how the Sinaloa Cartel gained power amid the shifting allegiances of the Mexican drug trade in the 1990s, eventually coming to control almost the entire Pacific coast of Mexico.\n\nThey heard how Guzman made a name for himself in the 1980s as \"El Rapido\", the speedy one, by building cross-border tunnels that allowed him to move cocaine from Mexico into the US faster than anyone else.\n\nThe witnesses, who included some of Guzman's top lieutenants, a communications engineer and a one-time mistress, described how he built a sophisticated organisation reminiscent of a multinational corporation.\n\nThey described fleets of planes and boats, detailed accounting ledgers and an encrypted electronic communication system run through secret computer servers in Canada.\n\nA former bodyguard testified that he watched Guzman kill three rival drug cartel members, including one victim who he shot and then ordered to be buried even as he was still gasping for air.\n\nEstimates of how much money Guzman made from drugs vary.\n\nIn 2009, Forbes Magazine put him on its list of the world's richest people, with an estimated one billion dollars. It later dropped him from the list, saying it was too difficult to quantify his assets.\n\nThe US Justice Department said in 2017 it sought forfeiture of more than $14bn in drug proceeds and illicit profits from Guzman.\n\nThe trial also featured extensive testimony about corruption in Mexico, most of it involving bribes to law enforcement, military and local government officials so the cartel could carry out its day-to-day drug shipping operations undisturbed.\n\nThe most shocking allegation came from Guzman's former top aide Alex Cifuentes, who accused former Mexican President Enrique Pena Nieto of taking a $100m bribe from Guzman. A spokesman for the ex-president has denied the claim.\n\nIn one of the trial's final days, Guzman told the judge he would not testify in his own defence.\n\nThe same day, he grinned broadly at audience member Alejandro Edda, the Mexican actor who plays Guzman in the Netflix drama \"Narcos\".\n\nDespite his ties to government officials, Guzman often lived on the run.\n\nImprisoned in Mexico in 1993, he escaped in 2001 hidden in a laundry cart and spent the following years moving from one hideout to another in the mountains of Sinaloa, guarded by a private army.\n\nHe was seized and imprisoned again in 2014, but pulled off his best-known escape the following year when he disappeared into a tunnel dug into his cell in a maximum security prison.\n\nBut the Mexican government says he blew his cover through a series of slip-ups, including an attempt to make a movie about his life.\n\nHe was finally recaptured in January 2016 following a shoot-out in Sinaloa.",
    "author": "",
    "url": "https://www.aljazeera.com/news/2019/02/mexican-drug-lord-joaquin-el-chapo-guzman-guilty-trial-190212173553615.html",
    "published": "2019-02-12 19:05:36+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}