{
    "data_id": "973719",
    "id": "thesun--2019-07-23--Innocent Brit spent a year in Spanish jail after 5m of drugs found at Airbnb villa he rented",
    "date": "7/23/2019",
    "source": "thesun",
    "title": "Innocent Brit spent a year in Spanish jail after £5m of drugs found at Airbnb villa he rented",
    "content": "A BRIT businessman spent a year in jail in Spain after cops found £5million of cannabis at a villa he rented.\n\nRobert Mansfield-Hewitt, 51, was seized last year in a raid on the Airbnb-listed property near Gibraltar.\n\nArmed police found 1.5 tonnes of hashish in an adjoining garage.\n\nRobert, on a business trip, had been in the property for just 48 hours. He was charged with a “crime against public health” and faced four-and-a-half years in jail and a £7million fine.\n\n Robert, of Chichester, West Sussex, was locked up in Botafuegos prison in Algeciras.\n\nHe was eventually freed earlier this month after a judge dropped the charges. However he was still fined £1,400 for renting an unlicensed house.\n\nAlthough the villa was listed with Airbnb, Robert, an MoD electrical engineer, did not book through the company.\n\nHe said: “The whole thing was a farce. They deemed me a flight risk, denied me bail and took my passport.”\n\nSpeaking of last May’s raid, the avid churchgoer, who walks with a cane due to a liver condition, said: “It was terrifying. I have never been in trouble with the law. I’m a very gentle soul, I would never get involved with drugs.”\n\nIt is understood the property’s owner, a Moroccan-born man in his 60s, has not been quizzed despite having a previous drug conviction.\n\nRobert is due to fly back to Gatwick on Thursday. He said: “Mummy’s very pleased. We’re relieved this nightmare is over.”",
    "author": "Vicky Lytaki",
    "url": "https://www.thesun.co.uk/news/9570057/innocent-brit-spent-a-year-in-spanish-jail-after-5m-of-drugs-found-at-airbnb-villa-he-rented/",
    "published": "2019-07-23 23:51:20+00:00",
    "category_level_1": "crime, law and justice",
    "Cat 2": "",
    "": ""
}